[
    {
        "chapter_number": 1,
        "chapter_name": "Chemical Reactions and Equations",
        "content": [
            {
            "heading_name": "Introduction",
            "raw_text": "Consider the following situations of daily life and think what happens when\n- milk is left at room temperature during summers.\n- an iron tawa/pan/nail is left exposed to humid atmosphere.\n -grapes get fermented.\n -food is cooked.\n -food gets digested in our body.\n -we respire.\n In all the above situations, the nature and the identity of the initial substance have somewhat changed. We have already learnt about physical and chemical changes of matter in our previous classes. Whenever a chemical change occurs, we can say that a chemical reaction has taken place.\n\n You must have observed that magnesium ribbon burns with a dazzling white flame and changes into a white powder. This powder is magnesium oxide. It is formed due to the reaction between magnesium and oxygen present in the air.\n\n  We can say that any of the following observations helps us to determine whether a chemical reaction has taken place\n- change in state\n -change in colour\n -evolution of a gas\n -change in temperature.\n\n As we observe the changes around us, we can see that there is a large variety of chemical reactions taking place around us. We will study about the various types of chemical reactions and their symbolic representation in this Chapter."
        },
        {
            "heading_name": "1.1 CHEMICAL EQUATIONS",
            "raw_text": "When a magnesium ribbon is burnt in oxygen, it gets converted to magnesium oxide. This description of a chemical reaction in a sentence form is quite long. It can be written in a shorter form. The simplest way to do this is to write it in the form of a word-equation.\n The word-equation for the above reaction would be Magnesium + Oxygen (Reactants) $\\rightarrow$ Magnesium oxide (Products)\n The substances that undergo chemical change in the reaction, magnesium and oxygen, are the reactants. The new substance is magnesium oxide, formed during the reaction, as a product.\n\n A word-equation shows change of reactants to products through an arrow placed between them. The reactants are written on the left-hand side (LHS) with a plus sign (+) between them. Similarly, products are written on the right-hand side (RHS) with a plus sign (+) between them. The arrowhead points towards the products, and shows the direction of the reaction."
        },
        {
            "heading_name": "1.1.1 Writing a Chemical Equation",
            "raw_text": "Is there any other shorter way for representing chemical equations? Chemical equations can be made more concise and useful if we use chemical formulae instead of words. A chemical equation represents a chemical reaction. If you recall formulae of magnesium, oxygen and magnesium oxide, the above word-equation can be written as:\n\n $Mg + O_2 \\rightarrow MgO$\n\n(1.2)\n\n Count and compare the number of atoms of each element on the LHS and RHS of the arrow. Is the number of atoms of each element the same on both the sides? If yes, then the equation is balanced. If not, then the equation is unbalanced because the mass is not the same on both sides of the equation. Such a chemical equation is a skeletal chemical equation for a reaction. Equation (1.2) is a skeletal chemical equation for the burning of magnesium in air."
        },
        {
            "heading_name": "1.1.2 Balanced Chemical Equations",
            "raw_text": "Recall the law of conservation of mass that you studied in Class IX; mass can neither be created nor destroyed in a chemical reaction. That is, the total mass of the elements present in the products of a chemical reaction has to be equal to the total mass of the elements present in the reactants.\n\nIn other words, the number of atoms of each element remains the same, before and after a chemical reaction. Hence, we need to balance a skeletal chemical equation. Is the chemical Eq. (1.2) balanced? Let us learn about balancing a chemical equation step by step.\n\nThe word-equation for Activity 1.3 may be represented as:\nZinc + Sulphuric acid $\\rightarrow$ Zinc sulphate + Hydrogen\n\nThe above word-equation may be represented by the following chemical equation:\n$Zn + H_2SO_4 \\rightarrow ZnSO_4 + H_2$\n(1.3)\n\nLet us examine the number of atoms of different elements on both sides of the arrow.\n\n| Element | Number of atoms in reactants (LHS) | Number of atoms in products (RHS) |\n|---|---|---|\n| Zn | 1 | 1 |\n| H | 2 | 2 |\n| S | 1 | 1 |\n| O | 4 | 4 |\n\nAs the number of atoms of each element is the same on both sides of the arrow, Eq. (1.3) is a balanced chemical equation.\n\nLet us try to balance the following chemical equation:\n$Fe + H_2O \\rightarrow Fe_3O_4 + H_2$\n(1.4)\n\nStep I: To balance a chemical equation, first draw boxes around each formula. Do not change anything inside the boxes while balancing the equation.\n\n$Fe + H_2O \\rightarrow Fe_3O_4 + H_2$\n(1.5)\n\nStep II: List the number of atoms of different elements present in the unbalanced equation (1.5).\n\n| Element | Number of atoms in reactants (LHS) | Number of atoms in products (RHS) |\n|---|---|---|\n| Fe | 1 | 3 |\n| H | 2 | 2 |\n| O | 1 | 4 |\n\nStep III: It is often convenient to start balancing with the compound that contains the maximum number of atoms. It may be a reactant or a product. In that compound, select the element which has the maximum number of atoms. Using these criteria, we select $Fe_3O_4$ and the element oxygen in it. There are four oxygen atoms on the RHS and only one on the LHS.\n\nTo balance the oxygen atoms:\n\n| Atoms of oxygen | In reactants | In products |\n|---|---|---|\n| (i) Initial | 1 (in $H_2O$) | 4 (in $Fe_3O_4$) |\n| (ii) To balance | 1×4 | 4 |\n\nTo equalise the number of atoms, it must be remembered that we cannot alter the formulae of the compounds or elements involved in the reactions. For example, to balance oxygen atoms we can put coefficient ‘4’ as $4H_2O$ and not $H_2O_4$ or $(H_2O)_4$. Now the partly balanced equation becomes:\n\n$Fe + 4H_2O \\rightarrow Fe_3O_4 + H_2$\n(1.6)\n(partly balanced equation)\n\nStep IV: Fe and H atoms are still not balanced. Pick any of these elements to proceed further. Let us balance hydrogen atoms in the partly balanced equation.\n\nTo equalise the number of H atoms, make the number of molecules of hydrogen as four on the RHS.\n\n| Atoms of hydrogen | In reactants | In products |\n|---|---|---|\n| (i) Initial | 8 (in $4H_2O$) | 2 (in $H_2$) |\n| (ii) To balance | 8 | 2 × 4 |\n\nThe equation would be:\n$Fe + 4H_2O \\rightarrow Fe_3O_4 + 4H_2$\n(1.7)\n(partly balanced equation)\n\nStep V: Examine the above equation and pick up the third element which is not balanced. You find that only one element is left to be balanced, that is, iron.\n\n| Atoms of iron | In reactants | In products |\n|---|---|---|\n| (i) Initial | 1 (in Fe) | 3 (in $Fe_3O_4$) |\n| (ii) To balance | 1×3 | 3 |\n\nTo equalise Fe, we take three atoms of Fe on the LHS.\n\n$3Fe + 4H_2O \\rightarrow Fe_3O_4 + 4H_2$\n(1.8)\n\nStep VI: Finally, to check the correctness of the balanced equation, we count atoms of each element on both sides of the equation.\n\n$3Fe + 4H_2O \\rightarrow Fe_3O_4 + 4H_2$\n(1.9)\n(balanced equation)\n\nThe numbers of atoms of elements on both sides of Eq. (1.9) are equal. This equation is now balanced. This method of balancing chemical equations is called hit-and-trial method as we make trials to balance the equation by using the smallest whole number coefficient.\n\nStep VII: Writing Symbols of Physical States Carefully examine the above balanced Eq. (1.9). Does this equation tell us anything about the physical state of each reactant and product? No information has been given in this equation about their physical states.\n\nTo make a chemical equation more informative, the physical states of the reactants and products are mentioned along with their chemical formulae. The gaseous, liquid, aqueous and solid states of reactants and products are represented by the notations (g), (l), (aq) and (s), respectively. The word aqueous (aq) is written if the reactant or product is present as a solution in water.\n\nThe balanced Eq. (1.9) becomes:\n$3Fe(s) + 4H_2O(g) \\rightarrow Fe_3O_4(s) + 4H_2(g)$\n(1.10)\n\nNote that the symbol (g) is used with $H_2O$ to indicate that in this reaction water is used in the form of steam.\n\nUsually physical states are not included in a chemical equation unless it is necessary to specify them.\n\nSometimes the reaction conditions, such as temperature, pressure, catalyst, etc., for the reaction are indicated above and/or below the arrow in the equation. For example:\n\n$CO(g) + 2H_2(g) \\xrightarrow{340atm} CH_3OH(l)$\n(1.11)\n\n$6CO_2(aq) + 12H_2O(l) \\xrightarrow[Chlorophyll]{Sunlight} C_6H_{12}O_6(aq) + 6O_2(aq) + 6H_2O(l)$\n(Glucose)\n(1.12)"
        },
        {
            "heading_name": "1.2.1 Combination Reaction",
            "raw_text": "Calcium oxide reacts vigorously with water to produce slaked lime (calcium hydroxide) releasing a large amount of heat.\n\n$CaO(s) + H_2O(l) \\rightarrow Ca(OH)_2(aq) + Heat$\n(Quick lime) (Slaked lime)\n(1.13)\n\nIn this reaction, calcium oxide and water combine to form a single product, calcium hydroxide. Such a reaction in which a single product is formed from two or more reactants is known as a combination reaction.\n\nLet us discuss some more examples of combination reactions.\n\n- (i) Burning of coal:\n$C(s) + O_2(g) \\rightarrow CO_2(g)$\n\n- (ii) Formation of water from $H_2(g)$ and $O_2(g)$:\n$2H_2(g) + O_2(g) \\rightarrow 2H_2O(l)$\n(1.16)\n\nIn simple language we can say that when two or more substances (elements or compounds) combine to form a single product, the reactions are called combination reactions.\n\nIn Activity 1.4, we also observed that a large amount of heat is evolved. This makes the reaction mixture warm. Reactions in which heat is released along with the formation of products are called exothermic chemical reactions.\n\nOther examples of exothermic reactions are:\n\n- (i) Burning of natural gas:\n$CH_4(g) + 2O_2(g) \\rightarrow CO_2(g) + 2H_2O(g)$\n\n- (ii) Do you know that respiration is an exothermic process?\nWe all know that we need energy to stay alive. We get this energy from the food we eat. During digestion, food is broken down into simpler substances. For example, rice, potatoes and bread contain carbohydrates. These carbohydrates are broken down to form glucose. This glucose combines with oxygen in the cells of our body and provides energy. The special name of this reaction is respiration, the process of which you will study in Chapter 6.\n\n$C_6H_{12}O_6(aq) + 6O_2(aq) \\rightarrow 6CO_2(aq) + 6H_2O(l) + energy$\n(Glucose)\n\n- (iii) The decomposition of vegetable matter into compost is also an example of an exothermic reaction.\n\nIdentify the type of the reaction taking place in Activity 1.1, where heat is given out along with the formation of a single product."
        },
        {
            "heading_name": "1.2.2 Decomposition Reaction",
            "raw_text": "Have you noticed that the green colour of the ferrous sulphate crystals has changed? You can also smell the characteristic odour of burning sulphur.\n\n$2FeSO_4(s) \\xrightarrow{Heat} Fe_2O_3(s) + SO_2(g) + SO_3(g)$\n(Ferrous sulphate) (Ferric oxide)\n(1.19)\n\nIn this reaction you can observe that a single reactant breaks down to give simpler products. This is a decomposition reaction. Ferrous sulphate crystals ($FeSO_4 \\cdot 7H_2O$) lose water when heated and the colour of the crystals changes. It then decomposes to ferric oxide ($Fe_2O_3$), sulphur dioxide ($SO_2$) and sulphur trioxide ($SO_3$). Ferric oxide is a solid, while $SO_2$ and $SO_3$ are gases.\n\nDecomposition of calcium carbonate to calcium oxide and carbon dioxide on heating is an important decomposition reaction used in various industries. Calcium oxide is called lime or quick lime. It has many uses – one is in the manufacture of cement. When a decomposition reaction is carried out by heating, it is called thermal decomposition.\n\n$CaCO_3(s) \\xrightarrow{Heat} CaO(s) + CO_2(g)$\n(Limestone) (Quick lime)\n\nYou will observe the emission of brown fumes. These fumes are of nitrogen dioxide ($NO_2$). The reaction that takes place is:\n\n$2Pb(NO_3)_2(s) \\xrightarrow{Heat} 2PbO(s) + 4NO_2(g) + O_2(g)$\n(Lead nitrate) (Lead oxide) (Nitrogen dioxide) (Oxygen)\n(1.21)\n\nYou will see that white silver chloride turns grey in sunlight. This is due to the decomposition of silver chloride into silver and chlorine by light.\n\n$2AgCl(s) \\xrightarrow{Sunlight} 2Ag(s) + Cl_2(g)$\n(1.22)\n\nSilver bromide also behaves in the same way.\n\n$2AgBr(s) \\xrightarrow{Sunlight} 2Ag(s) + Br_2(g)$\n(1.23)\n\nThe above reactions are used in black and white photography.\n\nWhat form of energy is causing these decomposition reactions?\n\nWe have seen that the decomposition reactions require energy either in the form of heat, light or electricity for breaking down the reactants. Reactions in which energy is absorbed are known as endothermic reactions."
        },
        {
            "heading_name": "1.2.3 Displacement Reaction",
            "raw_text": "Why does the iron nail become brownish in colour and the blue colour of copper sulphate solution fades?\n\nThe following chemical reaction takes place in this Activity:\n$Fe(s) + CuSO_4(aq) \\rightarrow FeSO_4(aq) + Cu(s)$\n(Copper sulphate) (Iron sulphate)\n(1.24)\n\nIn this reaction, iron has displaced or removed another element, copper, from copper sulphate solution. This reaction is known as displacement reaction.\n\nOther examples of displacement reactions are:\n\n$Zn(s) + CuSO_4(aq) \\rightarrow ZnSO_4(aq) + Cu(s)$\n(Copper sulphate) (Zinc sulphate)\n(1.25)\n\n$Pb(s) + CuCl_2(aq) \\rightarrow PbCl_2(aq) + Cu(s)$\n(Copper chloride) (Lead chloride)\n(1.26)\n\nZinc and lead are more reactive elements than copper. They displace copper from its compounds."
        },
        {
            "heading_name": "1.2.4 Double Displacement Reaction",
            "raw_text": "You will observe that a white substance, which is insoluble in water, is formed. This insoluble substance formed is known as a precipitate. Any reaction that produces a precipitate can be called a precipitation reaction.\n\n$Na_2SO_4(aq) + BaCl_2(aq) \\rightarrow BaSO_4(s) + 2NaCl(aq)$\n(Sodium sulphate) (Barium chloride) (Barium sulphate) (Sodium chloride)\n(1.27)\n\nWhat causes this? The white precipitate of $BaSO_4$ is formed by the reaction of $SO_4^{2-}$ and $Ba^{2+}$. The other product formed is sodium chloride which remains in the solution. Such reactions in which there is an exchange of ions between the reactants are called double displacement reactions."
        },
        {
            "heading_name": "1.2.5 Oxidation and Reduction",
            "raw_text": "The surface of copper powder becomes coated with black copper(II) oxide. Why has this black substance formed?\n\nThis is because oxygen is added to copper and copper oxide is formed.\n\n$2Cu + O_2 \\xrightarrow{Heat} 2CuO$\n(1.28)\n\nIf hydrogen gas is passed over this heated material (CuO), the black coating on the surface turns brown as the reverse reaction takes place and copper is obtained.\n\n$CuO + H_2 \\xrightarrow{Heat} Cu + H_2O$\n(1.29)\n\nIf a substance gains oxygen during a reaction, it is said to be oxidised. If a substance loses oxygen during a reaction, it is said to be reduced.\n\nDuring this reaction (1.29), the copper(II) oxide is losing oxygen and is being reduced. The hydrogen is gaining oxygen and is being oxidised. In other words, one reactant gets oxidised while the other gets reduced during a reaction. Such reactions are called oxidation-reduction reactions or redox reactions.\n\nSome other examples of redox reactions are:\n\n$ZnO + C \\rightarrow Zn + CO$\n(1.31)\n\n$MnO_2 + 4HCl \\rightarrow MnCl_2 + 2H_2O + Cl_2$\n(1.32)\n\nIn reaction (1.31) carbon is oxidised to CO and ZnO is reduced to Zn.\n\nIn reaction (1.32) HCl is oxidised to $Cl_2$ whereas $MnO_2$ is reduced to $MnCl_2$.\n\nFrom the above examples we can say that if a substance gains oxygen or loses hydrogen during a reaction, it is oxidised. If a substance loses oxygen or gains hydrogen during a reaction, it is reduced."
        },
        {
            "heading_name": "1.3.1 Corrosion",
            "raw_text": "You must have observed that iron articles are shiny when new, but get coated with a reddish brown powder when left for some time. This process is commonly known as rusting of iron. Some other metals also get tarnished in this manner. Have you noticed the colour of the coating formed on copper and silver? When a metal is attacked by substances around it such as moisture, acids, etc., it is said to corrode and this process is called corrosion. The black coating on silver and the green coating on copper are other examples of corrosion.\n\nCorrosion causes damage to car bodies, bridges, iron railings, ships and to all objects made of metals, specially those of iron. Corrosion of iron is a serious problem. Every year an enormous amount of money is spent to replace damaged iron. You will learn more about corrosion in Chapter 3."
        },
        {
            "heading_name": "1.3.2 Rancidity",
            "raw_text": "Have you ever tasted or smelt the fat/oil containing food materials left for a long time?\n\nWhen fats and oils are oxidised, they become rancid and their smell and taste change. Usually substances which prevent oxidation (antioxidants) are added to foods containing fats and oil. Keeping food in air tight containers helps to slow down oxidation. Do you know that chips manufacturers usually flush bags of chips with gas such as nitrogen to prevent the chips from getting oxidised ?"
        }
        ]
    },
    {
        "chapter_number": 2,
        "chapter_name": "Acids, Bases and Salts",
        "content": [
        {
            "heading_name": "Introduction",
            "raw_text": "You have learnt in your previous classes that the sour and bitter tastes of food are due to acids and bases, respectively, present in them.\n\nIf someone in the family is suffering from a problem of acidity after overeating, which of the following would you suggest as a remedy– lemon juice, vinegar or baking soda solution?\n\nWhich property did you think of while choosing the remedy? Surely you must have used your knowledge about the ability of acids and bases to nullify each other’s effect.\n\nRecall how we tested sour and bitter substances without tasting them.\n\nYou already know that acids are sour in taste and change the colour of blue litmus to red, whereas, bases are bitter and change the colour of the red litmus to blue. Litmus is a natural indicator, turmeric is another such indicator. Have you noticed that a stain of curry on a white cloth becomes reddish-brown when soap, which is basic in nature, is scrubbed on it? It turns yellow again when the cloth is washed with plenty of water. You can also use synthetic indicators such as methyl orange and phenolphthalein to test for acids and bases.\n\nIn this Chapter, we will study the reactions of acids and bases, how acids and bases cancel out each other’s effects and many more interesting things that we use and see in our day-to-day life."
        },
        {
            "heading_name": "2.1 UNDERSTANDING THE CHEMICAL PROPERTIES OF ACIDS AND BASES",
            "raw_text": ""
        },
        {
            "heading_name": "2.1.1 Acids and Bases in the Laboratory",
            "raw_text": ""
        },
        {
            "heading_name": "2.1.2 How do Acids and Bases React with Metals?",
            "raw_text": "Note that the metal in the above reactions displaces hydrogen atoms from the acids as hydrogen gas and forms a compound called a salt. Thus, the reaction of a metal with an acid can be summarised as:\n\nAcid + Metal \\rightarrow Salt + Hydrogen gas\n\nThe reaction that takes place can be written as follows.\n\n$2NaOH(aq) + Zn(s) \\rightarrow Na_2ZnO_2(s) + H_2(g)$\n(Sodium zincate)\n\nYou find again that hydrogen is formed in the reaction. However, such reactions are not possible with all metals."
        },
        {
            "heading_name": "2.1.3 How do Metal Carbonates and Metal Hydrogencarbonates React with Acids?",
            "raw_text": "The reactions occurring in the above Activity are written as:\n\nTest tube A: $Na_2CO_3(s) + 2HCl(aq) \\rightarrow 2NaCl(aq) + H_2O(l) + CO_2(g)$\n\nTest tube B: $NaHCO_3(s) + HCl(aq) \\rightarrow NaCl(aq) + H_2O(l) + CO_2(g)$\n\nOn passing the carbon dioxide gas evolved through lime water,\n\n$Ca(OH)_2(aq) + CO_2(g) \\rightarrow CaCO_3(s) + H_2O(l)$\n(Lime water) (White precipitate)\n\nOn passing excess carbon dioxide the following reaction takes place:\n\n$CaCO_3(s) + H_2O(l) + CO_2(g) \\rightarrow Ca(HCO_3)_2(aq)$\n(Soluble in water)\n\nLimestone, chalk and marble are different forms of calcium carbonate. All metal carbonates and hydrogencarbonates react with acids to give a corresponding salt, carbon dioxide and water.\n\nThus, the reaction can be summarised as:\n\nMetal carbonate/Metal hydrogencarbonate + Acid \\rightarrow Salt + Carbon dioxide + Water"
        },
        {
            "heading_name": "2.1.4 How do Acids and Bases React with each other?",
            "raw_text": "In the above Activity, we have observed that the effect of a base is nullified by an acid and vice-versa. The reaction taking place is written as:\n\n$NaOH(aq) + HCl(aq) \\rightarrow NaCl(aq) + H_2O(l)$\n\nThe reaction between an acid and a base to give a salt and water is known as a neutralisation reaction. In general, a neutralisation reaction can be written as:\n\nBase + Acid \\rightarrow Salt + Water"
        },
        {
            "heading_name": "2.1.5 Reaction of Metallic Oxides with Acids",
            "raw_text": "You will notice that the colour of the solution becomes blue-green and the copper oxide dissolves. The blue-green colour of the solution is due to the formation of copper(II) chloride in the reaction. The general reaction between a metal oxide and an acid can be written as:\n\nMetal oxide + Acid \\rightarrow Salt + Water\n\nSince metallic oxides react with acids to give salts and water, similar to the reaction of a base with an acid, metallic oxides are said to be basic oxides."
        },
        {
            "heading_name": "2.1.6 Reaction of a Non-metallic Oxide with Base",
            "raw_text": "You saw the reaction between carbon dioxide and calcium hydroxide (lime water) in Activity 2.5. Calcium hydroxide, which is a base, reacts with carbon dioxide to produce a salt and water. Since this is similar to the reaction between a base and an acid, we can conclude that non metallic oxides are acidic in nature."
        },
        {
            "heading_name": "2.2 WHAT DO ALL ACIDS AND ALL BASES HAVE IN COMMON?",
            "raw_text": "In Section 2.1 we have seen that all acids have similar chemical properties. What leads to this similarity in properties? We saw in Activity 2.3 that all acids generate hydrogen gas on reacting with metals, so hydrogen seems to be common to all acids. Let us perform an Activity to investigate whether all compounds containing hydrogen are acidic.\n\nThe bulb will start glowing in the case of acids, as shown in Fig. 2.3. But you will observe that glucose and alcohol solutions do not conduct electricity. Glowing of the bulb indicates that there is a flow of electric current through the solution. The electric current is carried through the acidic solution by ions.\n\nAcids contain $H^+$ ion as cation and anion such as $Cl^-$ in HCl, $NO_3^-$ in $HNO_3$, $SO_4^{2-}$ in $H_2SO_4$, $CH_3COO^-$ in $CH_3COOH$. Since the cation present in acids is $H^+$, this suggests that acids produce hydrogen ions, $H^+(aq)$, in solution, which are responsible for their acidic properties."
        },
        {
            "heading_name": "2.2.1 What Happens to an Acid or a Base in a Water Solution?",
            "raw_text": "This experiment suggests that hydrogen ions in HCl are produced in the presence of water. The separation of $H^+$ ion from HCl molecules cannot occur in the absence of water.\n\n$HCl + H_2O \\rightarrow H_3O^+ + Cl^-$\n\nHydrogen ions cannot exist alone, but they exist after combining with water molecules. Thus hydrogen ions must always be shown as $H^+(aq)$ or hydronium ion ($H_3O^+$).\n\n$H^+ + H_2O \\rightarrow H_3O^+$\n\nWe have seen that acids give $H_3O^+$ or $H^+(aq)$ ion in water. Let us see what happens when a base is dissolved in water.\n\n$NaOH(s) \\xrightarrow{H_2O} Na^+(aq) + OH^-(aq)$\n\n$KOH(s) \\xrightarrow{H_2O} K^+(aq) + OH^-(aq)$\n\n$Mg(OH)_2(s) \\xrightarrow{H_2O} Mg^{2+}(aq) + 2OH^-(aq)$\n\nBases generate hydroxide ($OH^-$) ions in water. Bases which are soluble in water are called alkalis.\n\nNow as we have identified that all acids generate $H^+(aq)$ and all bases generate $OH^-(aq)$, we can view the neutralisation reaction as follows:\n\nAcid + Base \\rightarrow Salt + Water\n\n$H^+X^- + M^+OH^- \\rightarrow MX + H_2O$\n\n$H^+(aq) + OH^-(aq) \\rightarrow H_2O(l)$\n\nLet us see what is involved when water is mixed with an acid or a base.\n\nThe process of dissolving an acid or a base in water is a highly exothermic one. Care must be taken while mixing concentrated nitric acid or sulphuric acid with water. The acid must always be added slowly to water with constant stirring. If water is added to a concentrated acid, the heat generated may cause the mixture to splash out and cause burns. The glass container may also break due to excessive local heating. Look out for the warning sign (shown in Fig. 2.5) on the can of concentrated sulphuric acid and on the bottle of sodium hydroxide pellets.\n\nMixing an acid or base with water results in decrease in the concentration of ions ($H_3O^+/OH^-$) per unit volume. Such a process is called dilution and the acid or the base is said to be diluted."
        },
        {
            "heading_name": "2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?",
            "raw_text": "We know how acid-base indicators can be used to distinguish between an acid and a base. We have also learnt in the previous section about dilution and decrease in concentration of $H^+$ or $OH^-$ ions in solutions. Can we quantitatively find the amount of these ions present in a solution? Can we judge how strong a given acid or base is?\n\nWe can do this by making use of a universal indicator, which is a mixture of several indicators. The universal indicator shows different colours at different concentrations of hydrogen ions in a solution.\n\nA scale for measuring hydrogen ion concentration in a solution, called pH scale has been developed. The p in pH stands for ‘potenz’ in German, meaning power. On the pH scale we can measure pH generally from 0 (very acidic) to 14 (very alkaline). pH should be thought of simply as a number which indicates the acidic or basic nature of a solution. Higher the hydronium ion concentration, lower is the pH value.\n\nThe pH of a neutral solution is 7. Values less than 7 on the pH scale represent an acidic solution. As the pH value increases from 7 to 14, it represents an increase in $OH^-$ ion concentration in the solution, that is, increase in the strength of alkali (Fig. 2.6). Generally paper impregnated with the universal indicator is used for measuring pH.\n\nThe strength of acids and bases depends on the number of $H^+$ ions and $OH^-$ ions produced, respectively. If we take hydrochloric acid and acetic acid of the same concentration, say one molar, then these produce different amounts of hydrogen ions. Acids that give rise to more $H^+$ ions are said to be strong acids, and acids that give less $H^+$ ions are said to be weak acids. Can you now say what weak and strong bases are?"
        },
        {
            "heading_name": "2.3.1 Importance of pH in Everyday Life",
            "raw_text": "Are plants and animals pH sensitive?\n\nOur body works within the pH range of 7.0 to 7.8. Living organisms can survive only in a narrow range of pH change. When pH of rain water is less than 5.6, it is called acid rain. When acid rain flows into the rivers, it lowers the pH of the river water. The survival of aquatic life in such rivers becomes difficult.\n\nWhat is the pH of the soil in your backyard?\n\nPlants require a specific pH range for their healthy growth. To find out the pH required for the healthy growth of a plant, you can collect the soil from various places and check the pH in the manner described below in Activity 2.12. Also, you can note down which plants are growing in the region from which you have collected the soil.\n\npH in our digestive system\n\nIt is very interesting to note that our stomach produces hydrochloric acid. It helps in the digestion of food without harming the stomach. During indigestion the stomach produces too much acid and this causes pain and irritation. To get rid of this pain, people use bases called antacids. One such remedy must have been suggested by you at the beginning of this Chapter. These antacids neutralise the excess acid. Magnesium hydroxide (Milk of magnesia), a mild base, is often used for this purpose.\n\npH change as the cause of tooth decay\n\nTooth decay starts when the pH of the mouth is lower than 5.5. Tooth enamel, made up of calcium hydroxyapatite (a crystalline form of calcium phosphate) is the hardest substance in the body. It does not dissolve in water, but is corroded when the pH in the mouth is below 5.5. Bacteria present in the mouth produce acids by degradation of sugar and food particles remaining in the mouth after eating. The best way to prevent this is to clean the mouth after eating food. Using toothpastes, which are generally basic, for cleaning the teeth can neutralise the excess acid and prevent tooth decay.\n\nSelf defence by animals and plants through chemical warfare\n\nHave you ever been stung by a honey-bee? Bee-sting leaves an acid which causes pain and irritation. Use of a mild base like baking soda on the stung area gives relief. Stinging hair of nettle leaves inject methanoic acid causing burning pain.\n\n| Natural source | Acid |\n|---|---|\n| Vinegar | Acetic acid |\n| Orange | Citric acid |\n| Tamarind | Tartaric acid |\n| Tomato | Oxalic acid |\n| Sour milk (Curd) | Lactic acid |\n| Lemon | Citric acid |\n| Ant sting | Methanoic acid |\n| Nettle sting | Methanoic acid |"
        },
        {
            "heading_name": "2.4 MORE ABOUT SALTS",
            "raw_text": ""
        },
        {
            "heading_name": "2.4.1 Family of Salts",
            "raw_text": ""
        },
        {
            "heading_name": "2.4.2 pH of Salts",
            "raw_text": "Salts of a strong acid and a strong base are neutral with pH value of 7. On the other hand, salts of a strong acid and weak base are acidic with pH value less than 7 and those of a strong base and weak acid are basic in nature, with pH value more than 7."
        },
        {
            "heading_name": "2.4.3 Chemicals from Common Salt",
            "raw_text": "By now you have learnt that the salt formed by the combination of hydrochloric acid and sodium hydroxide solution is called sodium chloride. This is the salt that you use in food. You must have observed in the above Activity that it is a neutral salt.\n\nSeawater contains many salts dissolved in it. Sodium chloride is separated from these salts. Deposits of solid salt are also found in several parts of the world. These large crystals are often brown due to impurities. This is called rock salt. Beds of rock salt were formed when seas of bygone ages dried up. Rock salt is mined like coal.\n\nYou must have heard about Mahatma Gandhi’s Dandi March. Did you know that sodium chloride was such an important symbol in our struggle for freedom?\n\nCommon salt — A raw material for chemicals\n\nThe common salt thus obtained is an important raw material for various materials of daily use, such as sodium hydroxide, baking soda, washing soda, bleaching powder and many more. Let us see how one substance is used for making all these different substances.\n\nSodium hydroxide\n\nWhen electricity is passed through an aqueous solution of sodium chloride (called brine), it decomposes to form sodium hydroxide. The process is called the chlor-alkali process because of the products formed– chlor for chlorine and alkali for sodium hydroxide.\n\n$2NaCl(aq) + 2H_2O(l) \\rightarrow 2NaOH(aq) + Cl_2(g) + H_2(g)$\n\nChlorine gas is given off at the anode, and hydrogen gas at the cathode. Sodium hydroxide solution is formed near the cathode. The three products produced in this process are all useful. Figure 2.8 shows the different uses of these products.\n\nBleaching powder\n\nYou have already come to know that chlorine is produced during the electrolysis of aqueous sodium chloride (brine). This chlorine gas is used for the manufacture of bleaching powder. Bleaching powder is produced by the action of chlorine on dry slaked lime [$Ca(OH)_2$]. Bleaching powder is represented as $Ca(ClO)_2$, though the actual composition is quite complex.\n\n$2Ca(OH)_2 + 2Cl_2 \\rightarrow Ca(ClO)_2 + CaCl_2 + 2H_2O$\n\nBleaching powder is used:\n- (i) for bleaching cotton and linen in the textile industry, for bleaching wood pulp in paper factories and for bleaching washed clothes in laundry;\n- (ii) as an oxidising agent in many chemical industries; and\n- (iii) to make drinking water free from germs.\n\nBaking soda\n\nThe baking soda is commonly used in the kitchen for making tasty crispy pakoras, etc. Sometimes it is added for faster cooking. The chemical name of the compound is sodium hydrogencarbonate ($NaHCO_3$). It is produced using sodium chloride as one of the raw materials.\n\n$NaCl + H_2O + CO_2 + NH_3 \\rightarrow NH_4Cl + NaHCO_3$\n(Ammonium chloride) (Sodium hydrogencarbonate)\n\nDid you check the pH of sodium hydrogencarbonate in Activity 2.14? Can you correlate why it can be used to neutralise an acid? It is a mild non-corrosive basic salt. The following reaction takes place when it is heated during cooking:\n\n$2NaHCO_3 \\xrightarrow{Heat} Na_2CO_3 + H_2O + CO_2$\n(Sodium hydrogencarbonate) (Sodium carbonate)\n\nSodium hydrogencarbonate has got various uses in the household.\n\nUses of Baking soda:\n- (i) For making baking powder, which is a mixture of baking soda (sodium hydrogencarbonate) and a mild edible acid such as tartaric acid. When baking powder is heated or mixed in water, the following reaction takes place:\n$NaHCO_3 + H^+ \\rightarrow CO_2 + H_2O + \\text{Sodium salt of acid}$\n(From any acid)\nCarbon dioxide produced during the reaction can cause bread or cake to rise making them soft and spongy.\n- (ii) Sodium hydrogencarbonate is also an ingredient in antacids. Being alkaline, it neutralises excess acid in the stomach and provides relief.\n- (iii) It is also used in soda-acid fire extinguishers.\n\nWashing soda\n\nAnother chemical that can be obtained from sodium chloride is $Na_2CO_3 \\cdot 10H_2O$ (washing soda). You have seen above that sodium carbonate can be obtained by heating baking soda; recrystallisation of sodium carbonate gives washing soda. It is also a basic salt.\n\nWhat does $10H_2O$ signify? Does it make $Na_2CO_3$ wet? We will address this question in the next section.\n\nSodium carbonate and sodium hydrogencarbonate are useful chemicals for many industrial processes as well.\n\nUses of washing soda:\n- (i) Sodium carbonate (washing soda) is used in glass, soap and paper industries.\n- (ii) It is used in the manufacture of sodium compounds such as borax.\n- (iii) Sodium carbonate can be used as a cleaning agent for domestic purposes.\n- (iv) It is used for removing permanent hardness of water."
        },
        {
            "heading_name": "2.4.4 Are the Crystals of Salts really Dry?",
            "raw_text": "Copper sulphate crystals which seem to be dry contain water of crystallisation. When we heat the crystals, this water is removed and the salt turns white.\n\nIf you moisten the crystals again with water, you will find that blue colour of the crystals reappears.\n\nWater of crystallisation is the fixed number of water molecules present in one formula unit of a salt. Five water molecules are present in one formula unit of copper sulphate. Chemical formula for hydrated copper sulphate is $CuSO_4 \\cdot 5H_2O$. Now you would be able to answer the question whether the molecule of $Na_2CO_3 \\cdot 10H_2O$ is wet.\n\nOne other salt, which possesses water of crystallisation is gypsum. It has two water molecules as water of cyrstallisation. It has the chemical formula $CaSO_4 \\cdot 2H_2O$. Let us look into the use of this salt.\n\nPlaster of Paris\n\nOn heating gypsum at 373 K, it loses water molecules and becomes calcium sulphate hemihydrate ($CaSO_4 \\cdot \\frac{1}{2}H_2O$). This is called Plaster of Paris, the substance which doctors use as plaster for supporting fractured bones in the right position. Plaster of Paris is a white powder and on mixing with water, it changes to gypsum once again giving a hard solid mass.\n\n$CaSO_4 \\cdot \\frac{1}{2}H_2O + 1\\frac{1}{2}H_2O \\rightarrow CaSO_4 \\cdot 2H_2O$\n(Plaster of Paris) (Gypsum)\n\nNote that only half a water molecule is shown to be attached as water of crystallisation. How can you get half a water molecule? It is written in this form because two formula units of $CaSO_4$ share one molecule of water. Plaster of Paris is used for making toys, materials for decoration and for making surfaces smooth."
        }
        ]
    },
    {
        "chapter_number": 3,
        "chapter_name": "Metals and Non-metals",
        "content": [
        {
            "heading_name": "3.1 PHYSICAL PROPERTIES",
            "raw_text": ""
        },
        {
            "heading_name": "3.1.1 Metals",
            "raw_text": "Metals, in their pure state, have a shining surface. This property is called metallic lustre. You will find that metals are generally hard. The hardness varies from metal to metal.\n\nYou will find that some metals can be beaten into thin sheets. This property is called malleability. Did you know that gold and silver are the most malleable metals? The ability of metals to be drawn into thin wires is called ductility. Gold is the most ductile metal. You will be surprised to know that a wire of about 2 km length can be drawn from one gram of gold.\n\nIt is because of their malleability and ductility that metals can be given different shapes according to our needs.\n\nmetals are good conductors of heat and have high melting points. The best conductors of heat are silver and copper. Lead and mercury are comparatively poor conductors of heat.\n\nDo metals also conduct electricity? You must have seen that the wires that carry current in your homes have a coating of polyvinylchloride (PVC) or a rubber-like material. Why are electric wires coated with such substances?\n\nWhat happens when metals strike a hard surface? Do they produce a sound? The metals that produce a sound on striking a hard surface are said to be sonorous. Can you now say why school bells are made of metals?"
        },
        {
            "heading_name": "3.1.2 Non-metals",
            "raw_text": "There are very few non-metals as compared to metals. Some of the examples of non-metals are carbon, sulphur, iodine, oxygen, hydrogen, etc. The non-metals are either solids or gases except bromine which is a liquid.\n\nDo non-metals also have physical properties similar to that of metals? Let us find out.\n\nYou must have concluded that we cannot group elements according to their physical properties alone, as there are many exceptions. For example:\n\n- (i) All metals except mercury exist as solids at room temperature. In Activity 3.5, you have observed that metals have high melting points but gallium and caesium have very low melting points. These two metals will melt if you keep them on your palm.\n- (ii) Iodine is a non-metal but it is lustrous.\n- (iii) Carbon is a non-metal that can exist in different forms. Each form is called an allotrope. Diamond, an allotrope of carbon, is the hardest natural substance known and has a very high melting and boiling point. Graphite, another allotrope of carbon, is a conductor of electricity.\n- (iv) Alkali metals (lithium, sodium, potassium) are so soft that they can be cut with a knife. They have low densities and low melting points.\n\nElements can be more clearly classified as metals and non-metals on the basis of their chemical properties.\n\nMost non-metals produce acidic oxides when dissolve in water. On the other hand, most metals, give rise to basic oxides. You will be learning more about these metal oxides in the next section."
        },
        {
            "heading_name": "3.2 CHEMICAL PROPERTIES OF METALS",
            "raw_text": ""
        },
        {
            "heading_name": "3.2.1 What happens when Metals are burnt in Air?",
            "raw_text": "Magnesium burns in air with a dazzling white flame. Do all metals react in the same manner?\n\nAlmost all metals combine with oxygen to form metal oxides.\n\nMetal + Oxygen \\rightarrow Metal oxide\n\nFor example, when copper is heated in air, it combines with oxygen to form copper(II) oxide, a black oxide.\n\n$2Cu + O_2 \\rightarrow 2CuO$\n(Copper) (Copper(II) oxide)\n\nSimilarly, aluminium forms aluminium oxide.\n\n$4Al + 3O_2 \\rightarrow 2Al_2O_3$\n(Aluminium) (Aluminium oxide)\n\nRecall from Chapter 2, how copper oxide reacts with hydrochloric acid. We have learnt that metal oxides are basic in nature. But some metal oxides, such as aluminium oxide, zinc oxide show both acidic as well as basic behaviour. Such metal oxides which react with both acids as well as bases to produce salts and water are known as amphoteric oxides. Aluminium oxide reacts in the following manner with acids and bases:\n\n$Al_2O_3 + 6HCl \\rightarrow 2AlCl_3 + 3H_2O$\n\n$Al_2O_3 + 2NaOH \\rightarrow 2NaAlO_2 + H_2O$\n(Sodium aluminate)\n\nMost metal oxides are insoluble in water but some of these dissolve in water to form alkalis. Sodium oxide and potassium oxide dissolve in water to produce alkalis as follows:\n\n$Na_2O(s) + H_2O(l) \\rightarrow 2NaOH(aq)$\n\n$K_2O(s) + H_2O(l) \\rightarrow 2KOH(aq)$\n\nall metals do not react with oxygen at the same rate. Different metals show different reactivities towards oxygen. Metals such as potassium and sodium react so vigorously that they catch fire if kept in the open. Hence, to protect them and to prevent accidental fires, they are kept immersed in kerosene oil. At ordinary temperature, the surfaces of metals such as magnesium, aluminium, zinc, lead, etc., are covered with a thin layer of oxide. The protective oxide layer prevents the metal from further oxidation. Iron does not burn on heating but iron filings burn vigorously when sprinkled in the flame of the burner. Copper does not burn, but the hot metal is coated with a black coloured layer of copper(II) oxide. Silver and gold do not react with oxygen even at high temperatures.\n\nsodium is the most reactive of the samples of metals taken here. The reaction of magnesium is less vigorous implying that it is not as reactive as sodium. But burning in oxygen does not help us to decide about the reactivity of zinc, iron, copper or lead. Let us see some more reactions to arrive at a conclusion about the order of reactivity of these metals."
        },
        {
            "heading_name": "3.2.2 What happens when Metals react with Water?",
            "raw_text": "Metals react with water and produce a metal oxide and hydrogen gas. Metal oxides that are soluble in water dissolve in it to further form metal hydroxide. But all metals do not react with water.\n\nMetal + Water \\rightarrow Metal oxide + Hydrogen\nMetal oxide + Water \\rightarrow Metal hydroxide\n\nMetals like potassium and sodium react violently with cold water. In case of sodium and potassium, the reaction is so violent and exothermic that the evolved hydrogen immediately catches fire.\n\n$2K(s) + 2H_2O(l) \\rightarrow 2KOH(aq) + H_2(g) + \\text{heat energy}$\n\n$2Na(s) + 2H_2O(l) \\rightarrow 2NaOH(aq) + H_2(g) + \\text{heat energy}$\n\nThe reaction of calcium with water is less violent. The heat evolved is not sufficient for the hydrogen to catch fire.\n\n$Ca(s) + 2H_2O(l) \\rightarrow Ca(OH)_2(aq) + H_2(g)$\n\nCalcium starts floating because the bubbles of hydrogen gas formed stick to the surface of the metal.\n\nMagnesium does not react with cold water. It reacts with hot water to form magnesium hydroxide and hydrogen. It also starts floating due to the bubbles of hydrogen gas sticking to its surface.\n\nMetals like aluminium, iron and zinc do not react either with cold or hot water. But they react with steam to form the metal oxide and hydrogen.\n\n$2Al(s) + 3H_2O(g) \\rightarrow Al_2O_3(s) + 3H_2(g)$\n\n$3Fe(s) + 4H_2O(g) \\rightarrow Fe_3O_4(s) + 4H_2(g)$\n\nMetals such as lead, copper, silver and gold do not react with water at all."
        },
        {
            "heading_name": "3.2.3 What happens when Metals react with Acids?",
            "raw_text": "Metals react with acids to give a salt and hydrogen gas.\n\nMetal + Dilute acid \\rightarrow Salt + Hydrogen\n\nBut do all metals react in the same manner?\n\nHydrogen gas is not evolved when a metal reacts with nitric acid. It is because $HNO_3$ is a strong oxidising agent. It oxidises the $H_2$ produced to water and itself gets reduced to any of the nitrogen oxides ($N_2O$, $NO$, $NO_2$). But magnesium (Mg) and manganese (Mn) react with very dilute $HNO_3$ to evolve $H_2$ gas.\n\nYou must have observed that the rate of formation of bubbles was the fastest in the case of magnesium. The reaction was also the most exothermic in this case. The reactivity decreases in the order Mg > Al > Zn > Fe. In the case of copper, no bubbles were seen and the temperature also remained unchanged. This shows that copper does not react with dilute HCl."
        },
        {
            "heading_name": "3.2.4 How do Metals react with Solutions of other Metal Salts?",
            "raw_text": "Reactive metals can displace less reactive metals from their compounds in solution or molten form.\n\nWe have seen in the previous sections that all metals are not equally reactive. We checked the reactivity of various metals with oxygen, water and acids. But all metals do not react with these reagents. So we were not able to put all the metal samples we had collected in decreasing order of their reactivity. Displacement reactions studied in Chapter 1 give better evidence about the reactivity of metals. It is simple and easy if metal A displaces metal B from its solution, it is more reactive than B.\n\nMetal A + Salt solution of B \\rightarrow Salt solution of A + Metal B"
        },
        {
            "heading_name": "3.2.5 The Reactivity Series",
            "raw_text": "The reactivity series is a list of metals arranged in the order of their decreasing activities. After performing displacement experiments (Activities 1.9 and 3.12), the following series, (Table 3.2) known as the reactivity or activity series has been developed.\n\n**Activity series : Relative reactivities of metals**\n\n| Symbol | Name | Reactivity |\n|---|---|---|\n| K | Potassium | Most reactive |\n| Na | Sodium | |\n| Ca | Calcium | |\n| Mg | Magnesium | |\n| Al | Aluminium | Reactivity decreases |\n| Zn | Zinc | |\n| Fe | Iron | |\n| Pb | Lead | |\n| [H] | [Hydrogen] | |\n| Cu | Copper | |\n| Hg | Mercury | |\n| Ag | Silver | |\n| Au | Gold | Least reactive |"
        },
        {
            "heading_name": "3.3 HOW DO METALS AND NON-METALS REACT?",
            "raw_text": "Noble gases, which have a completely filled valence shell, show little chemical activity. We, therefore, explain the reactivity of elements as a tendency to attain a completely filled valence shell.\n\nLet us have a look at the electronic configuration of noble gases and some metals and non-metals.\n\nWe can see from Table 3.3 that a sodium atom has one electron in its outermost shell. If it loses the electron from its M shell then its L shell now becomes the outermost shell and that has a stable octet. The nucleus of this atom still has 11 protons but the number of electrons has become 10, so there is a net positive charge giving us a sodium cation $Na^+$. On the other hand chlorine has seven electrons in its outermost shell and it requires one more electron to complete its octet. If sodium and chlorine were to react, the electron lost by sodium could be taken up by chlorine. After gaining an electron, the chlorine atom gets a unit negative charge, because its nucleus has 17 protons and there are 18 electrons in its K, L and M shells. This gives us a chloride anion $Cl^-$.\n\nSodium and chloride ions, being oppositely charged, attract each other and are held by strong electrostatic forces of attraction to exist as sodium chloride ($NaCl$). It should be noted that sodium chloride does not exist as molecules but aggregates of oppositely charged ions.\n\nThe compounds formed in this manner by the transfer of electrons from a metal to a non-metal are known as ionic compounds or electrovalent compounds."
        },
        {
            "heading_name": "3.3.1 Properties of Ionic Compounds",
            "raw_text": "Following are the general properties for ionic compounds—\n\n- (i) Physical nature: Ionic compounds are solids and are somewhat hard because of the strong force of attraction between the positive and negative ions. These compounds are generally brittle and break into pieces when pressure is applied.\n\n- (ii) Melting and Boiling points: Ionic compounds have high melting and boiling points (see Table 3.4). This is because a considerable amount of energy is required to break the strong inter-ionic attraction.\n\n- (iii) Solubility: Electrovalent compounds are generally soluble in water and insoluble in solvents such as kerosene, petrol, etc.\n\n- (iv) Conduction of Electricity: The conduction of electricity through a solution involves the movement of charged particles. A solution of an ionic compound in water contains ions, which move to the opposite electrodes when electricity is passed through the solution. Ionic compounds in the solid state do not conduct electricity because movement of ions in the solid is not possible due to their rigid structure. But ionic compounds conduct electricity in the molten state. This is possible in the molten state since the elecrostatic forces of attraction between the oppositely charged ions are overcome due to the heat. Thus, the ions move freely and conduct electricity."
        },
        {
            "heading_name": "3.4 OCCURRENCE OF METALS",
            "raw_text": "The earth’s crust is the major source of metals. Seawater also contains some soluble salts such as sodium chloride, magnesium chloride, etc.\n\nThe elements or compounds, which occur naturally in the earth’s crust, are known as minerals. At some places, minerals contain a very high percentage of a particular metal and the metal can be profitably extracted from it. These minerals are called ores."
        },
        {
            "heading_name": "3.4.1 Extraction of Metals",
            "raw_text": "You have learnt about the reactivity series of metals. Having this knowledge, you can easily understand how a metal is extracted from its ore. Some metals are found in the earth’s crust in the free state. Some are found in the form of their compounds. The metals at the bottom of the activity series are the least reactive. They are often found in a free state. For example, gold, silver, platinum and copper are found in the free state. Copper and silver are also found in the combined state as their sulphide or oxide ores. The metals at the top of the activity series (K, Na, Ca, Mg and Al) are so reactive that they are never found in nature as free elements. The metals in the middle of the activity series (Zn, Fe, Pb, etc.) are moderately reactive. They are found in the earth’s crust mainly as oxides, sulphides or carbonates. You will find that the ores of many metals are oxides. This is because oxygen is a very reactive element and is very abundant on the earth.\n\nThus on the basis of reactivity, we can group the metals into the following three categories (Fig. 3.9) – (i) Metals of low reactivity; (ii) Metals of medium reactivity; (iii) Metals of high reactivity. Different techniques are to be used for obtaining the metals falling in each category.\n\nSeveral steps are involved in the extraction of pure metal from ores. Each step is explained in detail in the following sections."
        },
        {
            "heading_name": "3.4.2 Enrichment of Ores",
            "raw_text": "Ores mined from the earth are usually contaminated with large amounts of impurities such as soil, sand, etc., called gangue. The impurities must be removed from the ore prior to the extraction of the metal. The processes used for removing the gangue from the ore are based on the differences between the physical or chemical properties of the gangue and the ore. Different separation techniques are accordingly employed."
        },
        {
            "heading_name": "3.4.3 Extracting Metals Low in the Activity Series",
            "raw_text": "Metals low in the activity series are very unreactive. The oxides of these metals can be reduced to metals by heating alone. For example, cinnabar (HgS) is an ore of mercury. When it is heated in air, it is first converted into mercuric oxide (HgO). Mercuric oxide is then reduced to mercury on further heating.\n\n$2HgS(s) + 3O_2(g) \\xrightarrow{Heat} 2HgO(s) + 2SO_2(g)$\n\n$2HgO(s) \\xrightarrow{Heat} 2Hg(l) + O_2(g)$\n\nSimilarly, copper which is found as $Cu_2S$ in nature can be obtained from its ore by just heating in air.\n\n$2Cu_2S + 3O_2(g) \\xrightarrow{Heat} 2Cu_2O(s) + 2SO_2(g)$\n\n$2Cu_2O + Cu_2S \\xrightarrow{Heat} 6Cu(s) + SO_2(g)$"
        },
        {
            "heading_name": "3.4.4 Extracting Metals in the Middle of the Activity Series",
            "raw_text": "The metals in the middle of the activity series such as iron, zinc, lead, copper, are moderately reactive. These are usually present as sulphides or carbonates in nature. It is easier to obtain a metal from its oxide, as compared to its sulphides and carbonates. Therefore, prior to reduction, the metal sulphides and carbonates must be converted into metal oxides. The sulphide ores are converted into oxides by heating strongly in the presence of excess air. This process is known as roasting. The carbonate ores are changed into oxides by heating strongly in limited air. This process is known as calcination. The chemical reaction that takes place during roasting and calcination of zinc ores can be shown as follows:\n\nRoasting\n$2ZnS(s) + 3O_2(g) \\xrightarrow{Heat} 2ZnO(s) + 2SO_2(g)$\n\nCalcination\n$ZnCO_3(s) \\xrightarrow{Heat} ZnO(s) + CO_2(g)$\n\nThe metal oxides are then reduced to the corresponding metals by using suitable reducing agents such as carbon. For example, when zinc oxide is heated with carbon, it is reduced to metallic zinc.\n\n$ZnO(s) + C(s) \\rightarrow Zn(s) + CO(g)$\n\nYou are already familiar with the process of oxidation and reduction explained in the first Chapter. Obtaining metals from their compounds is also a reduction process.\n\nBesides using carbon (coke) to reduce metal oxides to metals, sometimes displacement reactions can also be used. The highly reactive metals such as sodium, calcium, aluminium, etc., are used as reducing agents because they can displace metals of lower reactivity from their compounds. For example, when manganese dioxide is heated with aluminium powder, the following reaction takes place:\n\n$3MnO_2(s) + 4Al(s) \\rightarrow 3Mn(l) + 2Al_2O_3(s) + Heat$\n\nCan you identify the substances that are getting oxidised and reduced?\n\nThese displacement reactions are highly exothermic. The amount of heat evolved is so large that the metals are produced in the molten state. In fact, the reaction of iron(III) oxide ($Fe_2O_3$) with aluminium is used to join railway tracks or cracked machine parts. This reaction is known as the thermit reaction.\n\n$Fe_2O_3(s) + 2Al(s) \\rightarrow 2Fe(l) + Al_2O_3(s) + Heat$"
        },
        {
            "heading_name": "3.4.5 Extracting Metals towards the Top of the Activity Series",
            "raw_text": "The metals high up in the reactivity series are very reactive. They cannot be obtained from their compounds by heating with carbon. For example, carbon cannot reduce the oxides of sodium, magnesium, calcium, aluminium, etc., to the respective metals. This is because these metals have more affinity for oxygen than carbon. These metals are obtained by electrolytic reduction. For example, sodium, magnesium and calcium are obtained by the electrolysis of their molten chlorides. The metals are deposited at the cathode (the negatively charged electrode), whereas, chlorine is liberated at the anode (the positively charged electrode). The reactions are:\n\nAt cathode: $Na^+ + e^- \\rightarrow Na$\n\nAt anode: $2Cl^- \\rightarrow Cl_2 + 2e^-$\n\nSimilarly, aluminium is obtained by the electrolytic reduction of aluminium oxide."
        },
        {
            "heading_name": "3.4.6 Refining of Metals",
            "raw_text": "The metals produced by various reduction processes described above are not very pure. They contain impurities, which must be removed to obtain pure metals. The most widely used method for refining impure metals is electrolytic refining.\n\nElectrolytic Refining: Many metals, such as copper, zinc, tin, nickel, silver, gold, etc., are refined electrolytically. In this process, the impure metal is made the anode and a thin strip of pure metal is made the cathode. A solution of the metal salt is used as an electrolyte. The apparatus is set up as shown in Fig. 3.12. On passing the current through the electrolyte, the pure metal from the anode dissolves into the electrolyte. An equivalent amount of pure metal from the electrolyte is deposited on the cathode. The soluble impurities go into the solution, whereas, the insoluble impurities settle down at the bottom of the anode and are known as anode mud."
        },
        {
            "heading_name": "3.5 CORROSION",
            "raw_text": "You have learnt the following about corrosion \n\n- Silver articles become black after some time when exposed to air. This is because it reacts with sulphur in the air to form a coating of silver sulphide.\n\n- Copper reacts with moist carbon dioxide in the air and slowly loses its shiny brown surface and gains a green coat. This green substance is basic copper carbonate.\n\n- Iron when exposed to moist air for a long time acquires a coating of a brown flaky substance called rust."
        },
        {
            "heading_name": "3.5.1 Prevention of Corrosion",
            "raw_text": "The rusting of iron can be prevented by painting, oiling, greasing, galvanising, chrome plating, anodising or making alloys.\n\nGalvanisation is a method of protecting steel and iron from rusting by coating them with a thin layer of zinc. The galvanised article is protected against rusting even if the zinc coating is broken. Can you reason this out?\n\nAlloying is a very good method of improving the properties of a metal. We can get the desired properties by this method. For example, iron is the most widely used metal. But it is never used in its pure state. This is because pure iron is very soft and stretches easily when hot. But, if it is mixed with a small amount of carbon (about 0.05 %), it becomes hard and strong. When iron is mixed with nickel and chromium, we get stainless steel, which is hard and does not rust. Thus, if iron is mixed with some other substance, its properties change. In fact, the properties of any metal can be changed if it is mixed with some other substance. The substance added may be a metal or a non-metal. An alloy is a homogeneous mixture of two or more metals, or a metal and a non-metal. It is prepared by first melting the primary metal, and then, dissolving the other elements in it in definite proportions. It is then cooled to room temperature.\n\nIf one of the metals is mercury, then the alloy is known as an amalgam. The electrical conductivity and melting point of an alloy is less than that of pure metals. For example, brass, an alloy of copper and zinc (Cu and Zn), and bronze, an alloy of copper and tin (Cu and Sn), are not good conductors of electricity whereas copper is used for making electrical circuits. Solder, an alloy of lead and tin (Pb and Sn), has a low melting point and is used for welding electrical wires together."
        }
        ]
    },
    {
        "chapter_number": 4,
        "chapter_name": "Carbon and its Compounds",
        "content": [
        {
            "heading_name": "Introduction",
            "raw_text": "In the last Chapter, we came to know many compounds of importance to us. In this Chapter we will study about some more interesting compounds and their properties. Also, we shall be learning about carbon, an element which is of immense significance to us in both its elemental form and in the combined form.\n\nFood, clothes, medicines, books, or many of the things are all based on this versatile element carbon. In addition, all living structures are carbon based. The amount of carbon present in the earth’s crust and in the atmosphere is quite meagre. The earth’s crust has only 0.02% carbon in the form of minerals (like carbonates, hydrogencarbonates, coal and petroleum) and the atmosphere has 0.03% of carbon dioxide. In spite of this small amount of carbon available in nature, the importance of carbon seems to be immense. In this Chapter, we will know about the properties of carbon which make carbon so important to us."
        },
        {
            "heading_name": "4.1 BONDING IN CARBON - THE COVALENT BOND",
            "raw_text": "In the previous Chapter, we have studied the properties of ionic compounds. We saw that ionic compounds have high melting and boiling points and conduct electricity in solution or in the molten state. We also saw how the nature of bonding in ionic compounds explains these properties. Let us now study the properties of some carbon compounds.\n\nMost carbon compounds are poor conductors of electricity as we have seen in Chapter 2. From the data given in Table 4.1 on the boiling and melting points of the carbon compounds, we find that these compounds have low melting and boiling points as compared to ionic compounds (Chapter 3). We can conclude that the forces of attraction between the molecules are not very strong. Since these compounds are largely non-conductors of electricity, we can conclude that the bonding in these compounds does not give rise to any ions.\n\n| Compound | Melting point (K) | Boiling point (K) |\n|---|---|---|\n| Acetic acid ($CH_3COOH$) | 290 | 391 |\n| Chloroform ($CHCl_3$) | 209 | 334 |\n| Ethanol ($CH_3CH_2OH$) | 156 | 351 |\n| Methane ($CH_4$) | 90 | 111 |\n\nIn Class IX, we learnt about the combining capacity of various elements and how it depends on the number of valence electrons. Let us now look at the electronic configuration of carbon. The atomic number of carbon is 6. What would be the distribution of electrons in various shells of carbon? How many valence electrons will carbon have?\n\nWe know that the reactivity of elements is explained as their tendency to attain a completely filled outer shell, that is, attain noble gas configuration. Elements forming ionic compounds achieve this by either gaining or losing electrons from the outermost shell. In the case of carbon, it has four electrons in its outermost shell and needs to gain or lose four electrons to attain noble gas configuration. If it were to gain or lose electrons:\n\n- (i) It could gain four electrons forming $C^{4-}$ anion. But it would be difficult for the nucleus with six protons to hold on to ten electrons, that is, four extra electrons.\n\n- (ii) It could lose four electrons forming $C^{4+}$ cation. But it would require a large amount of energy to remove four electrons leaving behind a carbon cation with six protons in its nucleus holding on to just two electrons.\n\nCarbon overcomes this problem by sharing its valence electrons with other atoms of carbon or with atoms of other elements. Not just carbon, but many other elements form molecules by sharing electrons in this manner. The shared electrons ‘belong’ to the outermost shells of both the atoms and lead to both atoms attaining the noble gas configuration. Before going on to compounds of carbon, let us look at some simple molecules formed by the sharing of valence electrons.\n\nThe simplest molecule formed in this manner is that of hydrogen. As you have learnt earlier, the atomic number of hydrogen is 1. Hence hydrogen has one electron in its K shell and it requires one more electron to fill the K shell. So two hydrogen atoms share their electrons to form a molecule of hydrogen, $H_2$. This allows each hydrogen atom to attain the electronic configuration of the nearest noble gas, helium, which has two electrons in its K shell. The shared pair of electrons is said to constitute a single covalent bond between the two hydrogen atoms.\n\nThe atomic number of chlorine is 17. What would be its electronic configuration and its valency? Chlorine forms a diatomic molecule, $Cl_2$.\n\nIn the case of oxygen, we see the formation of a double bond between two oxygen atoms. This is because an atom of oxygen has six electrons in its L shell (the atomic number of oxygen is eight) and it requires two more electrons to complete its octet. So each atom of oxygen shares two electrons with another atom of oxygen. The two electrons contributed by each oxygen atom give rise to two shared pairs of electrons. This is said to constitute a double bond between the two atoms.\n\nIn order to attain an octet, each nitrogen atom in a molecule of nitrogen contributes three electrons giving rise to three shared pairs of electrons. This is said to constitute a triple bond between the two atoms.\n\nA molecule of ammonia has the formula $NH_3$.\n\nLet us now take a look at methane, which is a compound of carbon. Methane is widely used as a fuel and is a major component of bio-gas and Compressed Natural Gas (CNG). It is also one of the simplest compounds formed by carbon. Methane has a formula $CH_4$. Hydrogen, as you know, has a valency of 1. Carbon is tetravalent because it has four valence electrons. In order to achieve noble gas configuration, carbon shares these electrons with four atoms of hydrogen.\n\nSuch bonds which are formed by the sharing of an electron pair between two atoms are known as covalent bonds. Covalently bonded molecules are seen to have strong bonds within the molecule, but intermolecular forces are weak. This gives rise to the low melting and boiling points of these compounds. Since the electrons are shared between atoms and no charged particles are formed, such covalent compounds are generally poor conductors of electricity."
        },
        {
            "heading_name": "4.2 VERSATILE NATURE OF CARBON",
            "raw_text": "We have seen the formation of covalent bonds by the sharing of electrons in various elements and compounds. We have also seen the structure of a simple carbon compound, methane. In the beginning of the Chapter, we saw how many things we use contain carbon. In fact, we ourselves are made up of carbon compounds. The numbers of carbon compounds whose formulae are known to chemists was recently estimated to be in millions! This outnumbers by a large margin the compounds formed by all the other elements put together. Why is it that this property is seen in carbon and no other element?\n\nThe nature of the covalent bond enables carbon to form a large number of compounds. Two factors noticed in the case of carbon are:\n\n- (i) Carbon has the unique ability to form bonds with other atoms of carbon, giving rise to large molecules. This property is called catenation. These compounds may have long chains of carbon, branched chains of carbon or even carbon atoms arranged in rings. In addition, carbon atoms may be linked by single, double or triple bonds. Compounds of carbon, which are linked by only single bonds between the carbon atoms are called saturated compounds. Compounds of carbon having double or triple bonds between their carbon atoms are called unsaturated compounds. No other element exhibits the property of catenation to the extent seen in carbon compounds. Silicon forms compounds with hydrogen which have chains of upto seven or eight atoms, but these compounds are very reactive. The carbon-carbon bond is very strong and hence stable. This gives us the large number of compounds with many carbon atoms linked to each other.\n\n- (ii) Since carbon has a valency of four, it is capable of bonding with four other atoms of carbon or atoms of some other mono-valent element. Compounds of carbon are formed with oxygen, hydrogen, nitrogen, sulphur, chlorine and many other elements giving rise to compounds with specific properties which depend on the elements other than carbon present in the molecule. Again the bonds that carbon forms with most other elements are very strong making these compounds exceptionally stable. One reason for the formation of strong bonds by carbon is its small size. This enables the nucleus to hold on to the shared pairs of electrons strongly. The bonds formed by elements having bigger atoms are much weaker."
        },
        {
            "heading_name": "4.2.1 Saturated and Unsaturated Carbon Compounds",
            "raw_text": "We have already seen the structure of methane. Another compound formed between carbon and hydrogen is ethane with a formula of $C_2H_6$. In order to arrive at the structure of simple carbon compounds, the first step is to link the carbon atoms together with a single bond and then use the hydrogen atoms to satisfy the remaining valencies of carbon. Three valencies of each carbon atom remain unsatisfied.\n\nThese compounds are normally not very reactive.\n\nHowever, another compound of carbon and hydrogen has the formula $C_2H_4$ and is called ethene.\n\nYet another compound of hydrogen and carbon has the formula $C_2H_2$ and is called ethyne.\n\nSuch compounds of carbon having double or triple bonds between the carbon atoms are known as unsaturated carbon compounds and they are more reactive than the saturated carbon compounds."
        },
        {
            "heading_name": "4.2.2 Chains, Branches and Rings",
            "raw_text": "In the earlier section, we mentioned the carbon compounds methane, ethane and propane, containing respectively 1, 2 and 3 carbon atoms. Such ‘chains’ of carbon atoms can contain many more carbon atoms.\n\nCompounds with identical molecular formula but different structures are called structural isomers.\n\nIn addition to straight and branched carbon chains, some compounds have carbon atoms arranged in the form of a ring.\n\nAll these carbon compounds which contain only carbon and hydrogen are called hydrocarbons. Among these, the saturated hydrocarbons are called alkanes. The unsaturated hydrocarbons which contain one or more double bonds are called alkenes. Those containing one or more triple bonds are called alkynes."
        },
        {
            "heading_name": "4.2.3 Will you be my Friend?",
            "raw_text": "Carbon seems to be a very friendly element. So far we have been looking at compounds containing carbon and hydrogen only. But carbon also forms bonds with other elements such as halogens, oxygen, nitrogen and sulphur. In a hydrocarbon chain, one or more hydrogens can be replaced by these elements, such that the valency of carbon remains satisfied. In such compounds, the element replacing hydrogen is referred to as a heteroatom.\n\nThe heteroatoms and the group containing these confer specific properties to the compound, regardless of the length and nature of the carbon chain and hence are called functional groups. Some important functional groups are given in the Table 4.3. Free valency or valencies of the group are shown by the single line. The functional group is attached to the carbon chain through this valency by replacing one hydrogen atom or atoms."
        },
        {
            "heading_name": "4.2.4 Homologous Series",
            "raw_text": "You have seen that carbon atoms can be linked together to form chains of varying lengths. These chains can be branched also. In addition, hydrogen atom or other atoms on these carbon chains can be replaced by any of the functional groups that we saw above. The presence of a functional group such as alcohol decides the properties of the carbon compound, regardless of the length of the carbon chain. For example, the chemical properties of $CH_3OH$, $C_2H_5OH$, $C_3H_7OH$ and $C_4H_9OH$ are all very similar. Hence, such a series of compounds in which the same functional group substitutes for hydrogen in a carbon chain is called a homologous series.\n\nLet us look at the homologous series that we saw earlier in Table 4.2. If we look at the formulae of successive compounds, say:\n- $CH_4$ and $C_2H_6$ — these differ by a –$CH_2$– unit\n- $C_2H_6$ and $C_3H_8$ — these differ by a –$CH_2$– unit\n\nAs the molecular mass increases in any homologous series, a gradation in physical properties is seen. This is because the melting and boiling points increase with increasing molecular mass. Other physical properties such as solubility in a particular solvent also show a similar gradation. But the chemical properties, which are determined solely by the functional group, remain similar in a homologous series."
        },
        {
            "heading_name": "4.2.5 Nomenclature of Carbon Compounds",
            "raw_text": "You have seen that carbon atoms can be linked together to form chains of varying lengths. These chains can be branched also. In addition, hydrogen atom or other atoms on these carbon chains can be replaced by any of the functional groups that we saw above. The presence of a functional group such as alcohol decides the properties of the carbon compound, regardless of the length of the carbon chain. For example, the chemical properties of $CH_3OH$, $C_2H_5OH$, $C_3H_7OH$ and $C_4H_9OH$ are all very similar. Hence, such a series of compounds in which the same functional group substitutes for hydrogen in a carbon chain is called a homologous series.\n\nLet us look at the homologous series that we saw earlier in Table 4.2. If we look at the formulae of successive compounds, say:\n- $CH_4$ and $C_2H_6$ — these differ by a –$CH_2$– unit\n- $C_2H_6$ and $C_3H_8$ — these differ by a –$CH_2$– unit\n\nAs the molecular mass increases in any homologous series, a gradation in physical properties is seen. This is because the melting and boiling points increase with increasing molecular mass. Other physical properties such as solubility in a particular solvent also show a similar gradation. But the chemical properties, which are determined solely by the functional group, remain similar in a homologous series."
        },
        {
            "heading_name": "4.3 CHEMICAL PROPERTIES OF CARBON COMPOUNDS",
            "raw_text": ""
        },
        {
            "heading_name": "4.3.1 Combustion",
            "raw_text": "Carbon, in all its allotropic forms, burns in oxygen to give carbon dioxide along with the release of heat and light. Most carbon compounds also release a large amount of heat and light on burning. These are the oxidation reactions that you learnt about in the first Chapter:\n\n- (i) $C + O_2 \\rightarrow CO_2 + \\text{heat and light}$\n\n- (ii) $CH_4 + O_2 \\rightarrow CO_2 + H_2O + \\text{heat and light}$\n\n- (iii) $CH_3CH_2OH + O_2 \\rightarrow CO_2 + H_2O + \\text{heat and light}$\n\nSaturated hydrocarbons will generally give a clean flame while unsaturated carbon compounds will give a yellow flame with lots of black smoke. This results in a sooty deposit on the metal plate in Activity 4.3. However, limiting the supply of air results in incomplete combustion of even saturated hydrocarbons giving a sooty flame. The gas/kerosene stove used at home has inlets for air so that a sufficiently oxygen-rich mixture is burnt to give a clean blue flame. If you observe the bottoms of cooking vessels getting blackened, it means that the air holes are blocked and fuel is getting wasted. Fuels such as coal and petroleum have some amount of nitrogen and sulphur in them. Their combustion results in the formation of oxides of sulphur and nitrogen which are major pollutants in the environment."
        },
        {
            "heading_name": "4.3.2 Oxidation",
            "raw_text": "You have learnt about oxidation reactions in the first Chapter. Carbon compounds can be easily oxidised on combustion. In addition to this complete oxidation, we have reactions in which alcohols are converted to carboxylic acids.\n\nWe see that some substances are capable of adding oxygen to others. These substances are known as oxidising agents.\n\nAlkaline potassium permanganate or acidified potassium dichromate are oxidising alcohols to acids, that is, adding oxygen to the starting material. Hence they are known as oxidising agents."
        },
        {
            "heading_name": "4.3.3 Addition Reaction",
            "raw_text": "Unsaturated hydrocarbons add hydrogen in the presence of catalysts such as palladium or nickel to give saturated hydrocarbons. Catalysts are substances that cause a reaction to occur or proceed at a different rate without the reaction itself being affected. This reaction is commonly used in the hydrogenation of vegetable oils using a nickel catalyst. Vegetable oils generally have long unsaturated carbon chains while animal fats have saturated carbon chains.\n\nYou must have seen advertisements stating that some vegetable oils are ‘healthy’. Animal fats generally contain saturated fatty acids which are said to be harmful for health. Oils containing unsaturated fatty acids should be chosen for cooking."
        },
        {
            "heading_name": "4.3.4 Substitution Reaction",
            "raw_text": "Saturated hydrocarbons are fairly unreactive and are inert in the presence of most reagents. However, in the presence of sunlight, chlorine is added to hydrocarbons in a very fast reaction. Chlorine can replace the hydrogen atoms one by one. It is called a substitution reaction because one type of atom or a group of atoms takes the place of another. A number of products are usually formed with the higher homologues of alkanes."
        },
        {
            "heading_name": "4.4 SOME IMPORTANT CARBON COMPOUNDS – ETHANOL AND ETHANOIC ACID",
            "raw_text": " Many carbon compounds are invaluable to us. But here we shall study the properties of two commercially important compounds – ethanol and ethanoic acid."
        },
        {
            "heading_name": "4.4.1 Properties of Ethanol",
            "raw_text": "Ethanol is a liquid at room temperature (refer to Table 4.1 for the melting and boiling points of ethanol). Ethanol is commonly called alcohol and is the active ingredient of all alcoholic drinks. In addition, because it is a good solvent, it is also used in medicines such as tincture iodine, cough syrups, and many tonics. Ethanol is also soluble in water in all proportions. Consumption of small quantities of dilute ethanol causes drunkenness. Even though this practice is condemned, it is a socially widespread practice. However, intake of even a small quantity of pure ethanol (called absolute alcohol) can be lethal. Also, long-term consumption of alcohol leads to many health problems.\n\nReactions of Ethanol\n\n- (i) Reaction with sodium:\n$2Na + 2CH_3CH_2OH \\rightarrow 2CH_3CH_2O^-Na^+ + H_2$\n(Sodium ethoxide)\nAlcohols react with sodium leading to the evolution of hydrogen. With ethanol, the other product is sodium ethoxide. Can you recall which other substances produce hydrogen on reacting with metals?\n\n- (ii) Reaction to give unsaturated hydrocarbon: Heating ethanol at 443 K with excess concentrated sulphuric acid results in the dehydration of ethanol to give ethene:\n\n$CH_3CH_2OH \\xrightarrow{Hot\\ Conc.\\ H_2SO_4} CH_2=CH_2 + H_2O$\n\nThe concentrated sulphuric acid can be regarded as a dehydrating agent which removes water from ethanol."
        },
        {
            "heading_name": "4.4.2 Properties of Ethanoic Acid",
            "raw_text": "Ethanoic acid is commonly called acetic acid and belongs to a group of acids called carboxylic acids. 5-8% solution of acetic acid in water is called vinegar and is used widely as a preservative in pickles. The melting point of pure ethanoic acid is 290 K and hence it often freezes during winter in cold climates. This gave rise to its name glacial acetic acid.\n\nThe group of organic compounds called carboxylic acids are obviously characterised by their acidic nature. However, unlike mineral acids like HCl, which are completely ionised, carboxylic acids are weak acids.\n\nReactions of ethanoic acid:\n\n- (i) Esterification reaction: Esters are most commonly formed by reaction of an acid and an alcohol. Ethanoic acid reacts with absolute ethanol in the presence of an acid catalyst to give an ester:\n\n$CH_3COOH + CH_3CH_2OH \\xrightarrow{Acid} CH_3COOCH_2CH_3 + H_2O$\n(Ethanoic acid) (Ethanol) (Ester)\n\nGenerally, esters are sweet-smelling substances. These are used in making perfumes and as flavouring agents. On treating with sodium hydroxide, which is an alkali, the ester is converted back to alcohol and sodium salt of carboxylic acid. This reaction is known as saponification because it is used in the preparation of soap. Soaps are sodium or potassium salts of long chain carboxylic acid.\n\n- (ii) Reaction with a base: Like mineral acids, ethanoic acid reacts with a base such as sodium hydroxide to give a salt (sodium ethanoate or commonly called sodium acetate) and water:\n\n$NaOH + CH_3COOH \\rightarrow CH_3COONa + H_2O$\n\n- (iii) Reaction with carbonates and hydrogencarbonates: Ethanoic acid reacts with carbonates and hydrogencarbonates to give rise to a salt, carbon dioxide and water. The salt produced is commonly called sodium acetate.\n\n$2CH_3COOH + Na_2CO_3 \\rightarrow 2CH_3COONa + H_2O + CO_2$\n\n$CH_3COOH + NaHCO_3 \\rightarrow CH_3COONa + H_2O + CO_2$"
        },
        {
            "heading_name": "4.5 SOAPS AND DETERGENTS",
            "raw_text": "Most dirt is oily in nature and as you know, oil does not dissolve in water. The molecules of soap are sodium or potassium salts of long-chain carboxylic acids. The ionic-end of soap interacts with water while the carbon chain interacts with oil. The soap molecules, thus form structures called micelles where one end of the molecules is towards the oil droplet while the ionic-end faces outside. This forms an emulsion in water. The soap micelle thus helps in pulling out the dirt in water and we can wash our clothes clean.\n\nHave you ever observed while bathing that foam is formed with difficulty and an insoluble substance (scum) remains after washing with water? This is caused by the reaction of soap with the calcium and magnesium salts, which cause the hardness of water. Hence you need to use a larger amount of soap. This problem is overcome by using another class of compounds called detergents as cleansing agents.\n\nDetergents are generally sodium salts of sulphonic acids or ammonium salts with chlorides or bromides ions, etc. Both have long hydrocarbon chain. The charged ends of these compounds do not form insoluble precipitates with the calcium and magnesium ions in hard water. Thus, they remain effective in hard water. Detergents are usually used to make shampoos and products for cleaning clothes."
        }
        ]
    },
    {
        "chapter_number": 5,
        "chapter_name": "Life Processes",
        "content": [
        {
            "heading_name": "Introduction",
            "raw_text": "How do we tell the difference between what is alive and what is not alive? If we see a dog running, or a cow chewing cud, or a man shouting loudly on the street, we know that these are living beings. What if the dog or the cow or the man were asleep? We would still think that they were alive, but how did we know that? We see them breathing, and we know that they are alive. What about plants? How do we know that they are alive? We see them green, some of us will say. But what about plants that have leaves of colours other than green? They grow over time, so we know that they are alive, some will say. In other words, we tend to think of some sort of movement, either growth-related or not, as common evidence for being alive. But a plant that is not visibly growing is still alive, and some animals can breathe without visible movement. So using visible movement as the defining characteristic of life is not enough.\n\nMovements over very small scales will be invisible to the naked eye – movements of molecules, for example. Is this invisible molecular movement necessary for life? If we ask this question to professional biologists, they will say yes. In fact, viruses do not show any molecular movement in them (until they infect some cell), and that is partly why there is a controversy about whether they are truly alive or not.\n\nWhy are molecular movements needed for life? We have seen in earlier classes that living organisms are well-organised structures; they can have tissues, tissues have cells, cells have smaller components in them, and so on. Because of the effects of the environment, this organised, ordered nature of living structures is very likely to keep breaking down over time. If order breaks down, the organism will no longer be alive. So living creatures must keep repairing and maintaining their structures. Since all these structures are made up of molecules, they must move molecules around all the time.\n\nWhat are the maintenance processes in living organisms? Let us explore."
        },
        {
            "heading_name": "5.1 WHAT ARE LIFE PROCESSES?",
            "raw_text": "The maintenance functions of living organisms must go on even when they are not doing anything particular. Even when we are just sitting in class, even if we are just asleep, this maintenance job has to go on. The processes which together perform this maintenance job are life processes.\n\nSince these maintenance processes are needed to prevent damage and break-down, energy is needed for them. This energy comes from outside the body of the individual organism. So there must be a process to transfer a source of energy from outside the body of the organism, which we call food, to the inside, a process we commonly call nutrition. If the body size of the organisms is to grow, additional raw material will also be needed from outside. Since life on earth depends on carbon-based molecules, most of these food sources are also carbon-based. Depending on the complexity of these carbon sources, different organisms can then use different kinds of nutritional processes.\n\nThe outside sources of energy could be quite varied, since the environment is not under the control of the individual organism. These sources of energy, therefore, need to be broken down or built up in the body, and must be finally converted to a uniform source of energy that can be used for the various molecular movements needed for maintaining living structures, as well as to the kind of molecules the body needs to grow. For this, a series of chemical reactions in the body are necessary. Oxidising-reducing reactions are some of the most common chemical means to break-down molecules. For this, many organisms use oxygen sourced from outside the body. The process of acquiring oxygen from outside the body, and to use it in the process of break-down of food sources for cellular needs, is what we call respiration.\n\nIn the case of a single-celled organism, no specific organs for taking in food, exchange of gases or removal of wastes may be needed because the entire surface of the organism is in contact with the environment. But what happens when the body size of the organism increases and the body design becomes more complex? In multi-cellular organisms, all the cells may not be in direct contact with the surrounding environment. Thus, simple diffusion will not meet the requirements of all the cells.\n\nWe have seen previously how, in multi-cellular organisms, various body parts have specialised in the functions they perform. We are familiar with the idea of these specialised tissues, and with their organisation in the body of the organism. It is therefore not surprising that the uptake of food and of oxygen will also be the function of specialised tissues. However, this poses a problem, since the food and oxygen are now taken up at one place in the body of the organisms, while all parts of the body need them. This situation creates a need for a transportation system for carrying food and oxygen from one place to another in the body.\n\nWhen chemical reactions use the carbon source and the oxygen for energy generation, they create by-products that are not only useless for the cells of the body, but could even be harmful. These waste by-products are therefore needed to be removed from the body and discarded outside by a process called excretion. Again, if the basic rules for body design in multi-cellular organisms are followed, a specialised tissue for excretion will be developed, which means that the transportation system will need to transport waste away from cells to this excretory tissue.\n\nLet us consider these various processes, so essential to maintain life, one by one."
        },
        {
            "heading_name": "5.2 NUTRITION",
            "raw_text": "When we walk or ride a bicycle, we are using up energy. Even when we are not doing any apparent activity, energy is needed to maintain a state of order in our body. We also need materials from outside in order to grow, develop, synthesise protein and other substances needed in the body. This source of energy and materials is the food we eat.\n\nHow do living things get their food?\n\nThe general requirement for energy and materials is common in all organisms, but it is fulfilled in different ways. Some organisms use simple food material obtained from inorganic sources in the form of carbon dioxide and water. These organisms, the autotrophs, include green plants and some bacteria. Other organisms utilise complex substances. These complex substances have to be broken down into simpler ones before they can be used for the upkeep and growth of the body. To achieve this, organisms use bio-catalysts called enzymes. Thus, the heterotrophs survival depends directly or indirectly on autotrophs. Heterotrophic organisms include animals and fungi."
        },
        {
            "heading_name": "5.2.1 Autotrophic Nutrition",
            "raw_text": "Carbon and energy requirements of the autotrophic organism are fulfilled by photosynthesis. It is the process by which autotrophs take in substances from the outside and convert them into stored forms of energy. This material is taken in the form of carbon dioxide and water which is converted into carbohydrates in the presence of sunlight and chlorophyll. Carbohydrates are utilised for providing energy to the plant. We will study how this takes place in the next section. The carbohydrates which are not used immediately are stored in the form of starch, which serves as the internal energy reserve to be used as and when required by the plant. A somewhat similar situation is seen in us where some of the energy derived from the food we eat is stored in our body in the form of glycogen.\n\n$6CO_2(aq) + 12H_2O(l) \\xrightarrow[Chlorophyll]{Sunlight} C_6H_{12}O_6(aq) + 6O_2(aq) + 6H_2O(l)$\n\nLet us now see what actually happens during the process of photosynthesis. The following events occur during this process:\n\n- (i) Absorption of light energy by chlorophyll.\n- (ii) Conversion of light energy to chemical energy and splitting of water molecules into hydrogen and oxygen.\n- (iii) Reduction of carbon dioxide to carbohydrates.\n\nThese steps need not take place one after the other immediately. For example, desert plants take up carbon dioxide at night and prepare an intermediate which is acted upon by the energy absorbed by the chlorophyll during the day.\n\nLet us see how each of the components of the above reaction are necessary for photosynthesis.\n\nIf you carefully observe a cross-section of a leaf under the microscope (shown in Fig. 6.1), you will notice that some cells contain green dots. These green dots are cell organelles called chloroplasts which contain chlorophyll. Let us do an activity which demonstrates that chlorophyll is essential for photosynthesis.\n\nNow, let us study how the plant obtains carbon dioxide. In Class IX, we had talked about stomata (Fig. 6.3) which are tiny pores present on the surface of the leaves. Massive amounts of gaseous exchange takes place in the leaves through these pores for the purpose of photosynthesis. But it is important to note here that exchange of gases occurs across the surface of stems, roots and leaves as well. Since large amounts of water can also be lost through these stomata, the plant closes these pores when it does not need carbon dioxide for photosynthesis. The opening and closing of the pore is a function of the guard cells. The guard cells swell when water flows into them, causing the stomatal pore to open. Similarly the pore closes if the guard cells shrink.\n\nSo far, we have talked about how autotrophs meet their energy requirements. But they also need other raw materials for building their body. Water used in photosynthesis is taken up from the soil by the roots in terrestrial plants. Other materials like nitrogen, phosphorus, iron and magnesium are taken up from the soil. Nitrogen is an essential element used in the synthesis of proteins and other compounds. This is taken up in the form of inorganic nitrates or nitrites. Or it is taken up as organic compounds which have been prepared by bacteria from atmospheric nitrogen."
        },
        {
            "heading_name": "5.2.2 Heterotrophic Nutrition",
            "raw_text": "Each organism is adapted to its environment. The form of nutrition differs depending on the type and availability of food material as well as how it is obtained by the organism. For example, whether the food source is stationary (such as grass) or mobile (such as a deer), would allow for differences in how the food is accessed and what is the nutritive apparatus used by a cow and a lion. There is a range of strategies by which the food is taken in and used by the organism. Some organisms break-down the food material outside the body and then absorb it. Examples are fungi like bread moulds, yeast and mushrooms. Others take in whole material and break it down inside their bodies. What can be taken in and broken down depends on the body design and functioning. Some other organisms derive nutrition from plants or animals without killing them. This parasitic nutritive strategy is used by a wide variety of organisms like cuscuta (amar-bel), ticks, lice, leeches and tape-worms."
        },
        {
            "heading_name": "5.2.3 How do Organisms obtain their Nutrition?",
            "raw_text": "Since the food and the way it is obtained differ, the digestive system is different in various organisms. In single-celled organisms, the food may be taken in by the entire surface. But as the complexity of the organism increases, different parts become specialised to perform different functions. For example, Amoeba takes in food using temporary finger-like extensions of the cell surface which fuse over the food particle forming a food-vacuole (Fig. 6.5). Inside the food-vacuole, complex substances are broken down into simpler ones which then diffuse into the cytoplasm. The remaining undigested material is moved to the surface of the cell and thrown out. In Paramoecium, which is also a unicellular organism, the cell has a definite shape and food is taken in at a specific spot. Food is moved to this spot by the movement of cilia which cover the entire surface of the cell."
        },
        {
            "heading_name": "5.2.4 Nutrition in Human Beings",
            "raw_text": "The alimentary canal is basically a long tube extending from the mouth to the anus. The tube has different parts. Various regions are specialised to perform different functions. What happens to the food once it enters our body? We shall discuss this process here.\n\nWe eat various types of food which has to pass through the same digestive tract. Naturally the food has to be processed to generate particles which are small and of the same texture. This is achieved by crushing the food with our teeth. Since the lining of the canal is soft, the food is also wetted to make its passage smooth. When we eat something we like, our mouth ‘waters’. This is actually not only water, but a fluid called saliva secreted by the salivary glands. Another aspect of the food we ingest is its complex nature. If it is to be absorbed from the alimentary canal, it has to be broken into smaller molecules. This is done with the help of biological catalysts called enzymes. The saliva contains an enzyme called salivary amylase that breaks down starch which is a complex molecule to give simple sugar. The food is mixed thoroughly with saliva and moved around the mouth while chewing by the muscular tongue.\n\nIt is necessary to move the food in a regulated manner along the digestive tube so that it can be processed properly in each part. The lining of canal has muscles that contract rhythmically in order to push the food forward. These peristaltic movements occur all along the gut.\n\nFrom the mouth, the food is taken to the stomach through the food-pipe or oesophagus. The stomach is a large organ which expands when food enters it. The muscular walls of the stomach help in mixing the food thoroughly with more digestive juices. The digestion in stomach is taken care of by the gastric glands present in the wall of the stomach. These release hydrochloric acid, a protein digesting enzyme called pepsin, and mucus. The hydrochloric acid creates an acidic medium which facilitates the action of the enzyme pepsin. What other function do you think is served by the acid? The mucus protects the inner lining of the stomach from the action of the acid under normal conditions. We have often heard adults complaining about ‘acidity’. Can this be related to what has been discussed above?\n\nThe exit of food from the stomach is regulated by a sphincter muscle which releases it in small amounts into the small intestine. From the stomach, the food now enters the small intestine. This is the longest part of the alimentary canal which is fitted into a compact space because of extensive coiling. The length of the small intestine differs in various animals depending on the food they eat. Herbivores eating grass need a longer small intestine to allow the cellulose to be digested. Meat is easier to digest, hence carnivores like tigers have a shorter small intestine.\n\nThe small intestine is the site of the complete digestion of carbohydrates, proteins and fats. It receives the secretions of the liver and pancreas for this purpose. The food coming from the stomach is acidic and has to be made alkaline for the pancreatic enzymes to act. Bile juice from the liver accomplishes this in addition to acting on fats. Fats are present in the intestine in the form of large globules which makes it difficult for enzymes to act on them. Bile salts break them down into smaller globules increasing the efficiency of enzyme action. This is similar to the emulsifying action of soaps on dirt that we have learnt about in Chapter 4. The pancreas secretes pancreatic juice which contains enzymes like trypsin for digesting proteins and lipase for breaking down emulsified fats. The walls of the small intestine contain glands which secrete intestinal juice. The enzymes present in it finally convert the proteins to amino acids, complex carbohydrates into glucose and fats into fatty acids and glycerol.\n\nDigested food is taken up by the walls of the intestine. The inner lining of the small intestine has numerous finger-like projections called villi which increase the surface area for absorption. The villi are richly supplied with blood vessels which take the absorbed food to each and every cell of the body, where it is utilised for obtaining energy, building up new tissues and the repair of old tissues.\n\nThe unabsorbed food is sent into the large intestine where its wall absorb more water from this material. The rest of the material is removed from the body via the anus. The exit of this waste material is regulated by the anal sphincter."
        },
        {
            "heading_name": "5.3 RESPIRATION",
            "raw_text": "We have discussed nutrition in organisms in the last section. The food material taken in during the process of nutrition is used in cells to provide energy for various life processes. Diverse organisms do this in different ways – some use oxygen to break-down glucose completely into carbon dioxide and water, some use other pathways that do not involve oxygen. In all cases, the first step is the break-down of glucose, a six-carbon molecule, into a three-carbon molecule called pyruvate. This process takes place in the cytoplasm. Further, the pyruvate may be converted into ethanol and carbon dioxide. This process takes place in yeast during fermentation. Since this process takes place in the absence of air (oxygen), it is called anaerobic respiration. Breakdown of pyruvate using oxygen takes place in the mitochondria. This process breaks up the three-carbon pyruvate molecule to give three molecules of carbon dioxide. The other product is water. Since this process takes place in the presence of air (oxygen), it is called aerobic respiration. The release of energy in this aerobic process is a lot greater than in the anaerobic process. Sometimes, when there is a lack of oxygen in our muscle cells, another pathway for the break-down of pyruvate is taken. Here the pyruvate is converted into lactic acid which is also a three-carbon molecule. This build-up of lactic acid in our muscles during sudden activity causes cramps.\n\nThe energy released during cellular respiration is immediately used to synthesise a molecule called ATP which is used to fuel all other activities in the cell. In these processes, ATP is broken down giving rise to a fixed amount of energy which can drive the endothermic reactions taking place in the cell.\n\nSince the aerobic respiration pathway depends on oxygen, aerobic organisms need to ensure that there is sufficient intake of oxygen. We have seen that plants exchange gases through stomata, and the large inter-cellular spaces ensure that all cells are in contact with air. Carbon dioxide and oxygen are exchanged by diffusion here. They can go into cells, or away from them and out into the air. The direction of diffusion depends upon the environmental conditions and the requirements of the plant. At night, when there is no photosynthesis occurring, $CO_2$ elimination is the major exchange activity going on. During the day, $CO_2$ generated during respiration is used up for photosynthesis, hence there is no $CO_2$ release. Instead, oxygen release is the major event at this time.\n\nAnimals have evolved different organs for the uptake of oxygen from the environment and for getting rid of the carbon dioxide produced. Terrestrial animals can breathe the oxygen in the atmosphere, but animals that live in water need to use the oxygen dissolved in water.\n\nSince the amount of dissolved oxygen is fairly low compared to the amount of oxygen in the air, the rate of breathing in aquatic organisms is much faster than that seen in terrestrial organisms. Fishes take in water through their mouths and force it past the gills where the dissolved oxygen is taken up by blood.\n\nTerrestrial organisms use the oxygen in the atmosphere for respiration. This oxygen is absorbed by different organs in different animals. All these organs have a structure that increases the surface area which is in contact with the oxygen-rich atmosphere. Since the exchange of oxygen and carbon dioxide has to take place across this surface, this surface is very fine and delicate. In order to protect this surface, it is usually placed within the body, so there have to be passages that will take air to this area. In addition, there is a mechanism for moving the air in and out of this area where the oxygen is absorbed.\n\nIn human beings (Fig. 6.9), air is taken into the body through the nostrils. The air passing through the nostrils is filtered by fine hairs that line the passage. The passage is also lined with mucus which helps in this process. From here, the air passes through the throat and into the lungs. Rings of cartilage are present in the throat. These ensure that the air-passage does not collapse.\n\nWithin the lungs, the passage divides into smaller and smaller tubes which finally terminate in balloon-like structures which are called alveoli (singular–alveolus). The alveoli provide a surface where the exchange of gases can take place. The walls of the alveoli contain an extensive network of blood-vessels. As we have seen in earlier years, when we breathe in, we lift our ribs and flatten our diaphragm, and the chest cavity becomes larger as a result. Because of this, air is sucked into the lungs and fills the expanded alveoli. The blood brings carbon dioxide from the rest of the body for release into the alveoli, and the oxygen in the alveolar air is taken up by blood in the alveolar blood vessels to be transported to all the cells in the body. During the breathing cycle, when air is taken in and let out, the lungs always contain a residual volume of air so that there is sufficient time for oxygen to be absorbed and for the carbon dioxide to be released.\n\nWhen the body size of animals is large, the diffusion pressure alone cannot take care of oxygen delivery to all parts of the body. Instead, respiratory pigments take up oxygen from the air in the lungs and carry it to tissues which are deficient in oxygen before releasing it. In human beings, the respiratory pigment is haemoglobin which has a very high affinity for oxygen. This pigment is present in the red blood corpuscles. Carbon dioxide is more soluble in water than oxygen is and hence is mostly transported in the dissolved form in our blood."
        },
        {
            "heading_name": "5.4 TRANSPORTATION",
            "raw_text": ""
        },
        {
            "heading_name": "5.4.1 Transportation in Human Beings",
            "raw_text": "We have seen in previous sections that blood transports food, oxygen and waste materials in our bodies. In Class IX, we learnt about blood being a fluid connective tissue. Blood consists of a fluid medium called plasma in which the cells are suspended. Plasma transports food, carbon dioxide and nitrogenous wastes in dissolved form. Oxygen is carried by the red blood corpuscles. Many other substances like salts, are also transported by the blood. We thus need a pumping organ to push blood around the body, a network of tubes to reach all the tissues and a system in place to ensure that this network can be repaired if damaged.\n\nOur pump — the heart\n\nThe heart is a muscular organ which is as big as our fist. Because both oxygen and carbon dioxide have to be transported by the blood, the heart has different chambers to prevent the oxygen-rich blood from mixing with the blood containing carbon dioxide. The carbon dioxide-rich blood has to reach the lungs for the carbon dioxide to be removed, and the oxygenated blood from the lungs has to be brought back to the heart. This oxygen-rich blood is then pumped to the rest of the body.\n\nWe can follow this process step by step (Fig. 6.11). Oxygen-rich blood from the lungs comes to the thin-walled upper chamber of the heart on the left, the left atrium. The left atrium relaxes when it is collecting this blood. It then contracts, while the next chamber, the left ventricle, relaxes, so that the blood is transferred to it. When the muscular left ventricle contracts in its turn, the blood is pumped out to the body. De-oxygenated blood comes from the body to the upper chamber on the right, the right atrium, as it relaxes. As the right atrium contracts, the corresponding lower chamber, the right ventricle, dilates. This transfers blood to the right ventricle, which in turn pumps it to the lungs for oxygenation. Since ventricles have to pump blood into various organs, they have thicker muscular walls than the atria do. Valves ensure that blood does not flow backwards when the atria or ventricles contract.\n\nOxygen enters the blood in the lungs\n\nThe separation of the right side and the left side of the heart is useful to keep oxygenated and de-oxygenated blood from mixing. Such separation allows a highly efficient supply of oxygen to the body. This is useful in animals that have high energy needs, such as birds and mammals, which constantly use energy to maintain their body temperature. In animals that do not use energy for this purpose, the body temperature depends on the temperature in the environment. Such animals, like amphibians or many reptiles have three-chambered hearts, and tolerate some mixing of the oxygenated and de-oxygenated blood streams. Fishes, on the other hand, have only two chambers to their hearts, and the blood is pumped to the gills, is oxygenated there, and passes directly to the rest of the body. Thus, blood goes only once through the heart in the fish during one cycle of passage through the body. On the other hand, it goes through the heart twice during each cycle in other vertebrates. This is known as double circulation.\n\nThe tubes – blood vessels\n\nArteries are the vessels which carry blood away from the heart to various organs of the body. Since the blood emerges from the heart under high pressure, the arteries have thick, elastic walls. Veins collect the blood from different organs and bring it back to the heart. They do not need thick walls because the blood is no longer under pressure, instead they have valves that ensure that the blood flows only in one direction.\n\nOn reaching an organ or tissue, the artery divides into smaller and smaller vessels to bring the blood in contact with all the individual cells. The smallest vessels have walls which are one-cell thick and are called capillaries. Exchange of material between the blood and surrounding cells takes place across this thin wall. The capillaries then join together to form veins that convey the blood away from the organ or tissue.\n\nMaintenance by platelets\n\nWhat happens if this system of tubes develops a leak? Think about situations when we are injured and start bleeding. Naturally the loss of blood from the system has to be minimised. In addition, leakage would lead to a loss of pressure which would reduce the efficiency of the pumping system. To avoid this, the blood has platelet cells which circulate around the body and plug these leaks by helping to clot the blood at these points of injury.\n\nLymph\n\nThere is another type of fluid also involved in transportation. This is called lymph or tissue fluid. Through the pores present in the walls of capillaries some amount of plasma, proteins and blood cells escape into intercellular spaces in the tissues to form the tissue fluid or lymph. It is similar to the plasma of blood but colourless and contains less protein. Lymph drains into lymphatic capillaries from the intercellular spaces, which join to form large lymph vessels that finally open into larger veins. Lymph carries digested and absorbed fat from intestine and drains excess fluid from extra cellular space back into the blood."
        },
        {
            "heading_name": "5.4.2 Transportation in Plants",
            "raw_text": "We have discussed earlier how plants take in simple compounds such as $CO_2$ and photosynthesise energy stored in their chlorophyll-containing organs, namely leaves. The other kinds of raw materials needed for building plant bodies will also have to be taken up separately. For plants, the soil is the nearest and richest source of raw materials like nitrogen, phosphorus and other minerals. The absorption of these substances therefore occurs through the part in contact with the soil, namely roots. If the distances between soil-contacting organs and chlorophyll-containing organs are small, energy and raw materials can easily diffuse to all parts of the plant body. But if these distances become large because of changes in plant body design, diffusion processes will not be sufficient to provide raw material in leaves and energy in roots. A proper system of transportation is therefore essential in such situations.\n\nEnergy needs differ between different body designs. Plants do not move, and plant bodies have a large proportion of dead cells in many tissues. As a result, plants have low energy needs, and can use relatively slow transport systems. The distances over which transport systems have to operate, however, can be very large in plants such as very tall trees.\n\nPlant transport systems will move energy stores from leaves and raw materials from roots. These two pathways are constructed as independently organised conducting tubes. One, the xylem moves water and minerals obtained from the soil. The other, phloem transports products of photosynthesis from the leaves where they are synthesised to other parts of the plant. We have studied the structure of these tissues in detail in Class IX.\n\nIn xylem tissue, vessels and tracheids of the roots, stems and leaves are interconnected to form a continuous system of water-conducting channels reaching all parts of the plant. At the roots, cells in contact with the soil actively take up ions. This creates a difference in the concentration of these ions between the root and the soil. Water, therefore, moves into the root from the soil to eliminate this difference. This means that there is steady movement of water into root xylem, creating a column of water that is steadily pushed upwards.\n\nHowever, this pressure by itself is unlikely to be enough to move water over the heights that we commonly see in plants. Plants use another strategy to move water in the xylem upwards to the highest points of the plant body.\n\nProvided that the plant has an adequate supply of water, the water which is lost through the stomata is replaced by water from the xylem vessels in the leaf. In fact, evaporation of water molecules from the cells of a leaf creates a suction which pulls water from the xylem cells of roots. The loss of water in the form of vapour from the aerial parts of the plant is known as transpiration.\n\nThus, transpiration helps in the absorption and upward movement of water and minerals dissolved in it from roots to the leaves. It also helps in temperature regulation. The effect of root pressure in transport of water is more important at night. During the day when the stomata are open, the transpiration pull becomes the major driving force in the movement of water in the xylem.\n\nTransport of food and other substances\n\nSo far we have discussed the transport of water and minerals in plants. Now let us consider how the products of metabolic processes, particularly photosynthesis, are moved from leaves, where they are formed, to other parts of the plant. This transport of soluble products of photosynthesis is called translocation and it occurs in the part of the vascular tissue known as phloem. Besides the products of photosynthesis, the phloem transports amino acids and other substances. These substances are especially delivered to the storage organs of roots, fruits and seeds and to growing organs. The translocation of food and other substances takes place in the sieve tubes with the help of adjacent companion cells both in upward and downward directions.\n\nUnlike transport in xylem which can be largely explained by simple physical forces, the translocation in phloem is achieved by utilising energy. Material like sucrose is transferred into phloem tissue using energy from ATP. This increases the osmotic pressure of the tissue causing water to move into it. This pressure moves the material in the phloem to tissues which have less pressure. This allows the phloem to move material according to the plant’s needs. For example, in the spring, sugar stored in root or stem tissue would be transported to the buds which need energy to grow."
        },
        {
            "heading_name": "5.5 EXCRETION",
            "raw_text": "We have already discussed how organisms get rid of gaseous wastes generated during photosynthesis or respiration. Other metabolic activities generate nitrogenous materials which need to be removed. The biological process involved in the removal of these harmful metabolic wastes from the body is called excretion. Different organisms use varied strategies to do this. Many unicellular organisms remove these wastes by simple diffusion from the body surface into the surrounding water. As we have seen in other processes, complex multi-cellular organisms use specialised organs to perform the same function."
        },
        {
            "heading_name": "5.5.1 Excretion in Human Beings",
            "raw_text": "The excretory system of human beings includes a pair of kidneys, a pair of ureters, a urinary bladder and a urethra. Kidneys are located in the abdomen, one on either side of the backbone. Urine produced in the kidneys passes through the ureters into the urinary bladder where it is stored until it is released through the urethra.\n\nHow is urine produced? The purpose of making urine is to filter out waste products from the blood. Just as $CO_2$ is removed from the blood in the lungs, nitrogenous waste such as urea or uric acid are removed from blood in the kidneys. It is then no surprise that the basic filtration unit in the kidneys, like in the lungs, is a cluster of very thin-walled blood capillaries. Each capillary cluster in the kidney is associated with the cup-shaped end of a coiled tube called Bowman’s capsule that collects the filtrate.\n\nEach kidney has large numbers of these filtration units called nephrons packed close together. Some substances in the initial filtrate, such as glucose, amino acids, salts and a major amount of water, are selectively re-absorbed as the urine flows along the tube. The amount of water re-absorbed depends on how much excess water there is in the body, and on how much of dissolved waste there is to be excreted. The urine forming in each kidney eventually enters a long tube, the ureter, which connects the kidneys with the urinary bladder.\n\nUrine is stored in the urinary bladder until the pressure of the expanded bladder leads to the urge to pass it out through the urethra. The bladder is muscular, so it is under nervous control, as we have discussed elsewhere. As a result, we can usually control the urge to urinate."
        },
        {
            "heading_name": "5.5.2 Excretion in Plants",
            "raw_text": "Plants use completely different strategies for excretion than those of animals. Oxygen itself can be thought of as a waste product generated during photosynthesis! We have discussed earlier how plants deal with oxygen as well as $CO_2$. They can get rid of excess water by transpiration. For other wastes, plants use the fact that many of their tissues consist of dead cells, and that they can even lose some parts such as leaves. Many plant waste products are stored in cellular vacuoles. Waste products may be stored in leaves that fall off. Other waste products are stored as resins and gums, especially in old xylem. Plants also excrete some waste substances into the soil around them."
        }
        ]
    },
    {
        "chapter_number": 6,
        "chapter_name": "Control and Coordination",
        "content": [
        {
            "heading_name": "Introduction",
            "raw_text": "In the previous chapter, we looked at life processes involved in the maintenance functions in living organisms. There, we had started with a notion we all have, that if we see something moving, it is alive. Some of these movements are in fact the result of growth, as in plants. A seed germinates and grows, and we can see that the seedling moves over the course of a few days, it pushes soil aside and comes out. But if its growth were to be stopped, these movements would not happen. Some movements, as in many animals and some plants, are not connected with growth. A cat running, children playing on swings, buffaloes chewing cud – these are not movements caused by growth.\n\nWhy do we associate such visible movements with life? A possible answer is that we think of movement as a response to a change in the environment of the organism. The cat may be running because it has seen a mouse. Not only that, we also think of movement as an attempt by living organisms to use changes in their environment to their advantage. Plants grow out into the sunshine. Children try to get pleasure and fun out of swinging. Buffaloes chew cud to help break up tough food so as to be able to digest it better. When bright light is focussed on our eyes or when we touch a hot object, we detect the change and respond to it with movement in order to protect ourselves.\n\nIf we think a bit more about this, it becomes apparent that all this movement, in response to the environment, is carefully controlled. Each kind of a change in the environment evokes an appropriate movement in response. When we want to talk to our friends in class, we whisper, rather than shouting loudly. Clearly, the movement to be made depends on the event that is triggering it. Therefore, such controlled movement must be connected to the recognition of various events in the environment, followed by only the correct movement in response. In other words, living organisms must use systems providing control and coordination. In keeping with the general principles of body organisation in multicellular organisms, specialised tissues are used to provide these control and coordination activities."
        },
        {
            "heading_name": "6.1 ANIMALS – NERVOUS SYSTEM",
            "raw_text": "In animals, such control and coordination are provided by nervous and muscular tissues, which we have studied in Class IX. Touching a hot object is an urgent and dangerous situation for us. We need to detect it, and respond to it. How do we detect that we are touching a hot object? All information from our environment is detected by the specialised tips of some nerve cells. These receptors are usually located in our sense organs, such as the inner ear, the nose, the tongue, and so on. So gustatory receptors will detect taste while olfactory receptors will detect smell.\n\nThis information, acquired at the end of the dendritic tip of a nerve cell, sets off a chemical reaction that creates an electrical impulse. This impulse travels from the dendrite to the cell body, and then along the axon to its end. At the end of the axon, the electrical impulse sets off the release of some chemicals. These chemicals cross the gap, or synapse, and start a similar electrical impulse in a dendrite of the next neuron. This is a general scheme of how nervous impulses travel in the body. A similar synapse finally allows delivery of such impulses from neurons to other cells, such as muscles cells or gland.\n\nIt is thus no surprise that nervous tissue is made up of an organised network of nerve cells or neurons, and is specialised for conducting information via electrical impulses from one part of the body to another.\n\nIs there a difference in how sugar and food taste if your nose is blocked? If so, why might this be happening? Read and talk about possible explanations for these kinds of differences. Do you come across a similar situation when you have a cold?"
        },
        {
            "heading_name": "6.1.1 What happens in Reflex Actions?",
            "raw_text": "‘Reflex’ is a word we use very commonly when we talk about some sudden action in response to something in the environment. We say ‘I jumped out of the way of the bus reflexly’, or ‘I pulled my hand back from the flame reflexly’, or ‘I was so hungry my mouth started watering reflexly’. What exactly do we mean? A common idea in all such examples is that we do something without thinking about it, or without feeling in control of our reactions. Yet these are situations where we are responding with some action to changes in our environment. How is control and coordination achieved in such situations?\n\nLet us consider this further. Take one of our examples. Touching a flame is an urgent and dangerous situation for us, or in fact, for any animal! How would we respond to this? One seemingly simple way is to think consciously about the pain and the possibility of getting burnt, and therefore move our hand. An important question then is, how long will it take us to think all this? The answer depends on how we think. If nerve impulses are sent around the way we have talked about earlier, then thinking is also likely to involve the creation of such impulses. Thinking is a complex activity, so it is bound to involve a complicated interaction of many nerve impulses from many neurons.\n\nIf this is the case, it is no surprise that the thinking tissue in our body consists of dense networks of intricately arranged neurons. It sits in the forward end of the skull, and receives signals from all over the body which it thinks about before responding to them. Obviously, in order to receive these signals, this thinking part of the brain in the skull must be connected to nerves coming from various parts of the body. Similarly, if this part of the brain is to instruct muscles to move, nerves must carry this signal back to different parts of the body. If all of this is to be done when we touch a hot object, it may take enough time for us to get burnt!\n\nHow does the design of the body solve this problem? Rather than having to think about the sensation of heat, if the nerves that detect heat were to be connected to the nerves that move muscles in a simpler way, the process of detecting the signal or the input and responding to it by an output action might be completed quickly. Such a connection is commonly called a reflex arc (Fig. 7.2). Where should such reflex arc connections be made between the input nerve and the output nerve? The best place, of course, would be at the point where they first meet each other. Nerves from all over the body meet in a bundle in the spinal cord on their way to the brain. Reflex arcs are formed in this spinal cord itself, although the information input also goes on to reach the brain.\n\nOf course, reflex arcs have evolved in animals because the thinking process of the brain is not fast enough. In fact many animals have very little or none of the complex neuron network needed for thinking. So it is quite likely that reflex arcs have evolved as efficient ways of functioning in the absence of true thought processes. However, even after complex neuron networks have come into existence, reflex arcs continue to be more efficient for quick responses."
        },
        {
            "heading_name": "6.1.2 Human Brain",
            "raw_text": "Is reflex action the only function of the spinal cord? Obviously not, since we know that we are thinking beings. Spinal cord is made up of nerves which supply information to think about. Thinking involves more complex mechanisms and neural connections. These are concentrated in the brain, which is the main coordinating centre of the body. The brain and spinal cord constitute the central nervous system (Fig. 7.3). They receive information from all parts of the body and integrate it.\n\nWe also think about our actions. Writing, talking, moving a chair, clapping at the end of a programme are examples of voluntary actions which are based on deciding what to do next. So, the brain also has to send messages to muscles. This is the second way in which the nervous system communicates with the muscles. The communication between the central nervous system and the other parts of the body is facilitated by the peripheral nervous system consisting of cranial nerves arising from the brain and spinal nerves arising from the spinal cord. The brain thus allows us to think and take actions based on that thinking. As you will expect, this is accomplished through a complex design, with different parts of the brain responsible for integrating different inputs and outputs. The brain has three such major parts or regions, namely the fore-brain, mid-brain and hind-brain.\n\nThe fore-brain is the main thinking part of the brain. It has regions which receive sensory impulses from various receptors. Separate areas of the fore-brain are specialised for hearing, smell, sight and so on. There are separate areas of association where this sensory information is interpreted by putting it together with information from other receptors as well as with information that is already stored in the brain. Based on all this, a decision is made about how to respond and the information is passed on to the motor areas which control the movement of voluntary muscles, for example, our leg muscles. However, certain sensations are distinct from seeing or hearing, for example, how do we know that we have eaten enough? The sensation of feeling full is because of a centre associated with hunger, which is in a separate part of the fore-brain.\n\nStudy the labelled diagram of the human brain. We have seen that the different parts have specific functions. Can we find out the function of each part?\n\nLet us look at the other use of the word ‘reflex’ that we have talked about in the introduction. Our mouth waters when we see food we like without our meaning to. Our hearts beat without our thinking about it. In fact, we cannot control these actions easily by thinking about them even if we wanted to. Do we have to think about or remember to breathe or digest food? So, in between the simple reflex actions like change in the size of the pupil, and the thought out actions such as moving a chair, there is another set of muscle movements over which we do not have any thinking control. Many of these involuntary actions are controlled by the mid-brain and hind-brain. All these involuntary actions including blood pressure, salivation and vomiting are controlled by the medulla in the hind-brain.\n\nThink about activities like walking in a straight line, riding a bicycle, picking up a pencil. These are possible due to a part of the hind-brain called the cerebellum. It is responsible for precision of voluntary actions and maintaining the posture and balance of the body. Imagine what would happen if each of these events failed to take place if we were not thinking about it."
        },
        {
            "heading_name": "6.1.3 How are these Tissues protected?",
            "raw_text": "A delicate organ like the brain, which is so important for a variety of activities, needs to be carefully protected. For this, the body is designed so that the brain sits inside a bony box. Inside the box, the brain is contained in a fluid-filled balloon which provides further shock absorption.\n\nIf you run your hand down the middle of your back, you will feel a hard, bumpy structure. This is the vertebral column or backbone which protects the spinal cord."
        },
        {
            "heading_name": "6.1.4 How does the Nervous Tissue cause Action?",
            "raw_text": "So far, we have been talking about nervous tissue, and how it collects information, sends it around the body, processes information, makes decisions based on information, and conveys decisions to muscles for action. In other words, when the action or movement is to be performed, muscle tissue will do the final job. How do animal muscles move? When a nerve impulse reaches the muscle, the muscle fibre must move. How does a muscle cell move? The simplest notion of movement at the cellular level is that muscle cells will move by changing their shape so that they shorten. So the next question is, how do muscle cells change their shape? The answer must lie in the chemistry of cellular components. Muscle cells have special proteins that change both their shape and their arrangement in the cell in response to nervous electrical impulses. When this happens, new arrangements of these proteins give the muscle cells a shorter form. Remember when we talked about muscle tissue in Class IX, there were different kinds of muscles, such as voluntary muscles and involuntary muscles. Based on what we have discussed so far, what do you think the differences between these would be?"
        },
        {
            "heading_name": "6.2 COORDINATION IN PLANTS",
            "raw_text": "Animals have a nervous system for controlling and coordinating the activities of the body. But plants have neither a nervous system nor muscles. So, how do they respond to stimuli? When we touch the leaves of a chhui-mui (the ‘sensitive’ or ‘touch-me-not’ plant of the Mimosa family), they begin to fold up and droop. When a seed germinates, the root goes down, the stem comes up into the air. What happens? Firstly, the leaves of the sensitive plant move very quickly in response to touch. There is no growth involved in this movement. On the other hand, the directional movement of a seedling is caused by growth. If it is prevented from growing, it will not show any movement. So plants show two different types of movement – one dependent on growth and the other independent of growth."
        },
        {
            "heading_name": "6.2.1 Immediate Response to Stimulus",
            "raw_text": "Let us think about the first kind of movement, such as that of the sensitive plant. Since no growth is involved, the plant must actually move its leaves in response to touch. But there is no nervous tissue, nor any muscle tissue. How does the plant detect the touch, and how do the leaves move in response?\n\nIf we think about where exactly the plant is touched, and what part of the plant actually moves, it is apparent that movement happens at a point different from the point of touch. So, information that a touch has occurred must be communicated. The plants also use electrical-chemical means to convey this information from cell to cell, but unlike in animals, there is no specialised tissue in plants for the conduction of information. Finally, again as in animals, some cells must change shape in order for movement to happen. Instead of the specialised proteins found in animal muscle cells, plant cells change shape by changing the amount of water in them, resulting in swelling or shrinking, and therefore in changing shapes."
        },
        {
            "heading_name": "6.2.2 Movement Due to Growth",
            "raw_text": "Some plants like the pea plant climb up other plants or fences by means of tendrils. These tendrils are sensitive to touch. When they come in contact with any support, the part of the tendril in contact with the object does not grow as rapidly as the part of the tendril away from the object. This causes the tendril to circle around the object and thus cling to it.\n\nMore commonly, plants respond to stimuli slowly by growing in a particular direction. Because this growth is directional, it appears as if the plant is moving. Let us understand this type of movement with the help of an example.\n\nEnvironmental triggers such as light, or gravity will change the directions that plant parts grow in. These directional, or tropic, movements can be either towards the stimulus, or away from it. So, in two different kinds of phototropic movement, shoots respond by bending towards light while roots respond by bending away from it. How does this help the plant?\n\nPlants show tropism in response to other stimuli as well. The roots of a plant always grow downwards while the shoots usually grow upwards and away from the earth. This upward and downward growth of shoots and roots, respectively, in response to the pull of earth or gravity is, obviously, geotropism (Fig. 7.6). If ‘hydro’ means water and ‘chemo’ refers to chemicals, what would ‘hydrotropism’ and ‘chemotropism’ mean? Can we think of examples of these kinds of directional growth movements? One example of chemotropism is the growth of pollen tubes towards ovules, about which we will learn more when we examine the reproductive processes of living organisms.\n\nLet us now once again think about how information is communicated in the bodies of multicellular organisms. The movement of the sensitive plant in response to touch is very quick. The movement of sunflowers in response to day or night, on the other hand, is quite slow. Growth-related movement of plants will be even slower.\n\nEven in animal bodies, there are carefully controlled directions to growth. Our arms and fingers grow in certain directions, not haphazardly. So controlled movements can be either slow or fast. If fast responses to stimuli are to be made, information transfer must happen very quickly. For this, the medium of transmission must be able to move rapidly.\n\nElectrical impulses are an excellent means for this. But there are limitations to the use of electrical impulses. Firstly, they will reach only those cells that are connected by nervous tissue, not each and every cell in the animal body. Secondly, once an electrical impulse is generated in a cell and transmitted, the cell will take some time to reset its mechanisms before it can generate and transmit a new impulse. In other words, cells cannot continually create and transmit electrical impulses. It is thus no wonder that most multicellular organisms use another means of communication between cells, namely, chemical communication.\n\nIf, instead of generating an electrical impulse, stimulated cells release a chemical compound, this compound would diffuse all around the original cell. If other cells around have the means to detect this compound using special molecules on their surfaces, then they would be able to recognise information, and even transmit it. This will be slower, of course, but it can potentially reach all cells of the body, regardless of nervous connections, and it can be done steadily and persistently. These compounds, or hormones used by multicellular organisms for control and coordination show a great deal of diversity, as we would expect. Different plant hormones help to coordinate growth, development and responses to the environment. They are synthesised at places away from where they act and simply diffuse to the area of action.\n\nLet us take an example that we have worked with earlier [Activity 7.2]. When growing plants detect light, a hormone called auxin, synthesised at the shoot tip, helps the cells to grow longer. When light is coming from one side of the plant, auxin diffuses towards the shady side of the shoot. This concentration of auxin stimulates the cells to grow longer on the side of the shoot which is away from light. Thus, the plant appears to bend towards light.\n\nAnother example of plant hormones are gibberellins which, like auxins, help in the growth of the stem. Cytokinins promote cell division, and it is natural then that they are present in greater concentration in areas of rapid cell division, such as in fruits and seeds. These are examples of plant hormones that help in promoting growth. But plants also need signals to stop growing. Abscisic acid is one example of a hormone which inhibits growth. Its effects include wilting of leaves."
        },
        {
            "heading_name": "6.3 HORMONES IN ANIMALS",
            "raw_text": "How are such chemical, or hormonal, means of information transmission used in animals? What do some animals, for instance squirrels, experience when they are in a scary situation? Their bodies have to prepare for either fighting or running away. Both are very complicated activities that will use a great deal of energy in controlled ways. Many different tissue types will be used and their activities integrated together in these actions. However, the two alternate activities, fighting or running, are also quite different! So here is a situation in which some common preparations can be usefully made in the body. These preparations should ideally make it easier to do either activity in the near future. How would this be achieved?\n\nIf the body design in the squirrel relied only on electrical impulses via nerve cells, the range of tissues instructed to prepare for the coming activity would be limited. On the other hand, if a chemical signal were to be sent as well, it would reach all cells of the body and provide the wide-ranging changes needed. This is done in many animals, including human beings, using a hormone called adrenaline that is secreted from the adrenal glands.\n\nAdrenaline is secreted directly into the blood and carried to different parts of the body. The target organs or the specific tissues on which it acts include the heart. As a result, the heart beats faster, resulting in supply of more oxygen to our muscles. The blood to the digestive system and skin is reduced due to contraction of muscles around small arteries in these organs. This diverts the blood to our skeletal muscles. The breathing rate also increases because of the contractions of the diaphragm and the rib muscles. All these responses together enable the animal body to be ready to deal with the situation. Such animal hormones are part of the endocrine system which constitutes a second way of control and coordination in our body.\n\nRemember that plants have hormones that control their directional growth. What functions do animal hormones perform? On the face of it, we cannot imagine their role in directional growth. We have never seen an animal growing more in one direction or the other, depending on light or gravity! But if we think about it a bit more, it will become evident that, even in animal bodies, growth happens in carefully controlled places. Plants will grow leaves in many places on the plant body, for example. But we do not grow fingers on our faces. The design of the body is carefully maintained even during the growth of children.\n\nLet us examine some examples to understand how hormones help in coordinated growth. We have all seen salt packets which say ‘iodised salt’ or ‘enriched with iodine’. Why is it important for us to have iodised salt in our diet? Iodine is necessary for the thyroid gland to make thyroxin hormone. Thyroxin regulates carbohydrate, protein and fat metabolism in the body so as to provide the best balance for growth. Iodine is essential for the synthesis of thyroxin. In case iodine is deficient in our diet, there is a possibility that we might suffer from goitre. One of the symptoms in this disease is a swollen neck.\n\nSometimes we come across people who are either very short (dwarfs) or extremely tall (giants). Have you ever wondered how this happens? Growth hormone is one of the hormones secreted by the pituitary. As its name indicates, growth hormone regulates growth and development of the body. If there is a deficiency of this hormone in childhood, it leads to dwarfism.\n\nYou must have noticed many dramatic changes in your appearance as well as that of your friends as you approached 10–12 years of age. These changes associated with puberty are because of the secretion of testosterone in males and oestrogen in females.\n\nDo you know anyone in your family or friends who has been advised by the doctor to take less sugar in their diet because they are suffering from diabetes? As a treatment, they might be taking injections of insulin. This is a hormone which is produced by the pancreas and helps in regulating blood sugar levels. If it is not secreted in proper amounts, the sugar level in the blood rises causing many harmful effects.\n\nIf it is so important that hormones should be secreted in precise quantities, we need a mechanism through which this is done. The timing and amount of hormone released are regulated by feedback mechanisms. For example, if the sugar levels in blood rise, they are detected by the cells of the pancreas which respond by producing more insulin. As the blood sugar level falls, insulin secretion is reduced.\n\n| S.No. | Hormone | Endocrine Gland | Functions |\n|------|------------------|------------------|---------------------------------------------------------------------------|\n| 1 | Growth hormone | Pituitary gland | Stimulates growth and development of all organs |\n| 2 | Thyroxin | Thyroid gland | Regulates carbohydrate, protein and fat metabolism for body growth |\n| 3 | Insulin | Pancreas | Regulates blood sugar level |\n| 4 | Testosterone | Testes | Development of male reproductive organs, secondary sexual characteristics |\n| 5 | Oestrogen | Ovaries | Development of female sex organs, regulates menstrual cycle |\n| 6 | Adrenaline | Adrenal gland | Increases heartbeat, breathing rate, diverts blood to muscles, prepares body for emergency response |\n| 7 | Releasing hormones| Hypothalamus | Stimulates pituitary gland to release hormones |"
        }
        ]
    },
    {
        "chapter_number": 7,
        "chapter_name": "How do Organisms Reproduce?",
        "content": [
            {
            "heading_name": "7.1 DO ORGANISMS CREATE EXACT COPIES OF THEMSELVES?",
            "raw_text": "Before we discuss the mechanisms by which organisms reproduce, let us ask a more basic question - why do organisms reproduce? After all, reproduction is not necessary to maintain the life of an individual organism, unlike the essential life processes such as nutrition, respiration, or excretion. On the other hand, if an individual organism is going to create more individuals, a lot of its energy will be spent in the process. So why should an individual organism waste energy on a process it does not need to stay alive? It would be interesting to discuss the possible answers in the classroom!\n\nWhatever the answer to this question, it is obvious that we notice organisms because they reproduce. If there were to be only one, non-reproducing member of a particular kind, it is doubtful that we would have noticed its existence. It is the large numbers of organisms belonging to a single species that bring them to our notice. How do we know that two different individual organisms belong to the same species? Usually, we say this because they look similar to each other. Thus, reproducing organisms create new individuals that look very much like themselves.\n\nOrganisms look similar because their body designs are similar. If body designs are to be similar, the blueprints for these designs should be similar. Thus, reproduction at its most basic level will involve making copies of the blueprints of body design. In Class IX, we learnt that the chromosomes in the nucleus of a cell contain information for inheritance of features from parents to next generation in the form of DNA (Deoxyribo Nucleic Acid) molecules. The DNA in the cell nucleus is the information source for making proteins. If the information is changed, different proteins will be made. Different proteins will eventually lead to altered body designs. Therefore, a basic event in reproduction is the creation of a DNA copy. Cells use chemical reactions to build copies of their DNA. This creates two copies of the DNA in a reproducing cell, and they will need to be separated from each other. However, keeping one copy of DNA in the original cell and simply pushing the other one out would not work, because the copy pushed out would not have any organised cellular structure for maintaining life processes. Therefore, DNA copying is accompanied by the creation of an additional cellular apparatus, and then the DNA copies separate, each with its own cellular apparatus. Effectively, a cell divides to give rise to two cells.\n\nThese two cells are of course similar, but are they likely to be absolutely identical? The answer to this question will depend on how accurately the copying reactions involved occur. No bio-chemical reaction is absolutely reliable. Therefore, it is only to be expected that the process of copying the DNA will have some variations each time. As a result, the DNA copies generated will be similar, but may not be identical to the original. Some of these variations might be so drastic that the new DNA copy cannot work with the cellular apparatus it inherits. Such a newborn cell will simply die. On the other hand, there could still be many other variations in the DNA copies that would not lead to such a drastic outcome. Thus, the surviving cells are similar to, but subtly different from each other. This inbuilt tendency for variation during reproduction is the basis for evolution, as we will discuss in the next chapter."
            },
            {
            "heading_name": "7.1.1 The Importance of Variation",
            "raw_text": "Populations of organisms fill well-defined places, or niches, in the ecosystem, using their ability to reproduce. The consistency of DNA copying during reproduction is important for the maintenance of body design features that allow the organism to use that particular niche. Reproduction is therefore linked to the stability of populations of species. However, niches can change because of reasons beyond the control of the organisms. Temperatures on earth can go up or down, water levels can vary, or there could be meteorite hits, to think of a few examples. If a population of reproducing organisms were suited to a particular niche and if the niche were drastically altered, the population could be wiped out. However, if some variations were to be present in a few individuals in these populations, there would be some chance for them to survive. Thus, if there were a population of bacteria living in temperate waters, and if the water temperature were to be increased by global warming, most of these bacteria would die, but the few variants resistant to heat would survive and grow further. Variation is thus useful for the survival of species over time."
            },
            {
            "heading_name": "7.2 MODES OF REPRODUCTION USED BY SINGLE ORGANISMS",
            "raw_text": "Having discussed the context in which reproductive processes work, let us now examine how different organisms actually reproduce. The modes by which various organisms reproduce depend on the body design of the organisms."
            },
            {
            "heading_name": "7.2.1 Fission",
            "raw_text": "For unicellular organisms, cell division, or fission, leads to the creation of new individuals. Many different patterns of fission have been observed. Many bacteria and protozoa simply split into two equal halves during cell division. In organisms such as Amoeba, the splitting of the two cells during division can take place in any plane. However, some unicellular organisms show somewhat more organisation of their bodies, such as is seen in Leishmania (which cause kala-azar), which have a whip-like structure at one end of the cell. In such organisms, binary fission occurs in a definite orientation in relation to these structures. Other single-celled organisms, such as the malarial parasite, Plasmodium, divide into many daughter cells simultaneously by multiple fission. Yeast, on the other hand, can put out small buds that separate and grow further, as we saw in Activity 7.1."
            },
            {
            "heading_name": "7.2.2 Fragmentation",
            "raw_text": "In multi-cellular organisms with relatively simple body organisation, simple reproductive methods can still work. Spirogyra, for example, simply breaks up into smaller pieces upon maturation. These pieces or fragments grow into new individuals. This is not true for all multi-cellular organisms. They cannot simply divide cell-by-cell. The reason is that many multi-cellular organisms, as we have seen, are not simply a random collection of cells. Specialised cells are organised as tissues, and tissues are organised into organs, which then have to be placed at definite positions in the body. In such a carefully organised situation, cell-by-cell division would be impractical. Multi-cellular organisms, therefore, need to use more complex ways of reproduction. A basic strategy used in multi-cellular organisms is that different cell types perform different specialised functions. Following this general pattern, reproduction in such organisms is also the function of a specific cell type. How is reproduction to be achieved from a single cell type, if the organism itself consists of many cell types? The answer is that there must be a single cell type in the organism that is capable of growing, proliferating and making other cell types under the right circumstances."
            },
            {
            "heading_name": "7.2.3 Regeneration",
            "raw_text": "Many fully differentiated organisms have the ability to give rise to new individual organisms from their body parts. That is, if the individual is somehow cut or broken up into many pieces, many of these pieces grow into separate individuals. For example, simple animals like Hydra and Planaria can be cut into any number of pieces and each piece grows into a complete organism. This is known as regeneration. Regeneration is carried out by specialised cells. These cells proliferate and make large numbers of cells. From this mass of cells, different cells undergo changes to become various cell types and tissues. These changes take place in an organised sequence referred to as development. However, regeneration is not the same as reproduction, since most organisms would not normally depend on being cut up to be able to reproduce."
            },
            {
            "heading_name": "7.2.4 Budding",
            "raw_text": "Organisms such as Hydra use regenerative cells for reproduction in the process of budding. In Hydra, a bud develops as an outgrowth due to repeated cell division at one specific site. These buds develop into tiny individuals and when fully mature, detach from the parent body and become new independent individuals."
            },
            {
            "heading_name": "7.2.5 Vegetative Propagation",
            "raw_text": "There are many plants in which parts like the root, stem and leaves develop into new plants under appropriate conditions. Unlike in most animals, plants can indeed use such a mode for reproduction. This property of vegetative propagation is used in methods such as layering or grafting to grow many plants like sugarcane, roses, or grapes for agricultural purposes. Plants raised by vegetative propagation can bear flowers and fruits earlier than those produced from seeds. Such methods also make possible the propagation of plants such as banana, orange, rose and jasmine that have lost the capacity to produce seeds. Another advantage of vegetative propagation is that all plants produced are genetically similar enough to the parent plant to have all its characteristics.\n\nSimilarly buds produced in the notches along the leaf margin of Bryophyllum fall on the soil and develop into new plants.\n\nIn tissue culture, new plants are grown by removing tissue or separating cells from the growing tip of a plant. The cells are then placed in an artificial medium where they divide rapidly to form a small group of cells or callus. The callus is transferred to another medium containing hormones for growth and differentiation. The plantlets are then placed in the soil so that they can grow into mature plants. Using tissue culture, many plants can be grown from one parent in disease-free conditions. This technique is commonly used for ornamental plants."
            },
            {
            "heading_name": "7.2.6 Spore Formation",
            "raw_text": "Even in many simple multi-cellular organisms, specific reproductive parts can be identified. The thread-like structures that developed on the bread in Activity 7.2 above are the hyphae of the bread mould (Rhizopus). They are not reproductive parts. On the other hand, the tiny blob-on-a-stick structures are involved in reproduction. The blobs are sporangia, which contain cells, or spores, that can eventually develop into new Rhizopus individuals. The spores are covered by thick walls that protect them until they come into contact with another moist surface and can begin to grow.\n\nAll the modes of reproduction that we have discussed so far allow new generations to be created from a single individual. This is known as asexual reproduction."
            },
            {
            "heading_name": "7.3 SEXUAL REPRODUCTION",
            "raw_text": "We are also familiar with modes of reproduction that depend on the involvement of two individuals before a new generation can be created. Bulls alone cannot produce new calves, nor can hens alone produce new chicks. In such cases, both sexes, males and females, are needed to produce new generations. What is the significance of this sexual mode of reproduction? Are there any limitations of the asexual reproduction, which we have been discussing above?"
            },
            {
            "heading_name": "7.3.1 Why the Sexual Mode of Reproduction?",
            "raw_text": "The creation of two new cells from one involves copying of the DNA as well as of the cellular apparatus. The DNA copying mechanism, as we have noted, cannot be absolutely accurate, and the resultant errors are a source of variations in populations of organisms. Every individual organism cannot be protected by variations, but in a population, variations are useful for ensuring the survival of the species. It would therefore make sense if organisms came up with reproductive modes that allowed more and more variation to be generated. While DNA-copying mechanisms are not absolutely accurate, they are precise enough to make the generation of variation a fairly slow process. If the DNA copying mechanisms were to be less accurate, many of the resultant DNA copies would not be able to work with the cellular apparatus, and would die. So how can the process of making variants be speeded up? Each new variation is made in a DNA copy that already has variations accumulated from previous generations. Thus, two different individuals in a population would have quite different patterns of accumulated variations. Since all of these variations are in living individuals, it is assured that they do not have any really bad effects. Combining variations from two or more individuals would thus create new combinations of variants. Each combination would be novel, since it would involve two different individuals. The sexual mode of reproduction incorporates such a process of combining DNA from two different individuals during reproduction.\n\nBut this creates a major difficulty. If each new generation is to be the combination of the DNA copies from two pre-existing individuals, then each new generation will end up having twice the amount of DNA that the previous generation had. This is likely to mess up the control of the cellular apparatus by the DNA. How many ways can we think of for solving this difficulty? We have seen earlier that as organisms become more complex, the specialisation of tissue increases. One solution that many multi-cellular organisms have found for the problem mentioned above is to have special lineages of cells in specialised organs in which only half the number of chromosomes and half the amount of DNA as compared to the non-reproductive body cells. This is achieved by a process of cell division called meiosis. Thus, when these germ-cells from two individuals combine during sexual reproduction to form a new individual, it results in re-establishment of the number of chromosomes and the DNA content in the new generation.\n\nIf the zygote is to grow and develop into an organism which has highly specialised tissues and organs, then it has to have sufficient stores of energy for doing this. In very simple organisms, it is seen that the two germ-cells are not very different from one another, or may even be similar. But as the body designs become more complex, the germ-cells also specialise. One germ-cell is large and contains the food-stores while the other is smaller and likely to be motile. Conventionally, the motile germ-cell is called the male gamete and the germ-cell containing the stored food is called the female gamete. We shall see in the next few sections how the need to create these two different types of gametes give rise to differences in the male and female reproductive organs and, in some cases, differences in the bodies of the male and female organisms."
            },
            {
            "heading_name": "7.3.2 Sexual Reproduction in Flowering Plants",
            "raw_text": "The reproductive parts of angiosperms are located in the flower. You have already studied the different parts of a flower - sepals, petals, stamens and pistil. Stamens and pistil are the reproductive parts of a flower which contain the germ-cells. What possible functions could the petals and sepals serve? The flower may be unisexual (papaya, watermelon) when it contains either stamens or pistil or bisexual (Hibiscus, mustard) when it contains both stamens and pistil. Stamen is the male reproductive part and it produces pollen grains that are yellowish in colour. You must have seen this yellowish powder that often sticks to our hands if we touch the stamen of a flower. Pistil is present in the centre of a flower and is the female reproductive part. It is made of three parts. The swollen bottom part is the ovary, middle elongated part is the style and the terminal part which may be sticky is the stigma. The ovary contains ovules and each ovule has an egg cell. The male germ-cell produced by pollen grain fuses with the female gamete present in the ovule. This fusion of the germ-cells or fertilisation gives us the zygote which is capable of growing into a new plant. Thus the pollen needs to be transferred from the stamen to the stigma. If this transfer of pollen occurs in the same flower, it is referred to as self-pollination. On the other hand, if the pollen is transferred from one flower to another, it is known as cross-pollination. This transfer of pollen from one flower to another is achieved by agents like wind, water or animals. After the pollen lands on a suitable stigma, it has to reach the female germ-cells which are in the ovary. For this, a tube grows out of the pollen grain and travels through the style to reach the ovary. After fertilisation, the zygote divides several times to form an embryo within the ovule. The ovule develops a tough coat and is gradually converted into a seed. The ovary grows rapidly and ripens to form a fruit. Meanwhile, the petals, sepals, stamens, style and stigma may shrivel and fall off. Have you ever observed any flower part still persisting in the fruit? Try and work out the advantages of seed-formation for the plant. The seed contains the future plant or embryo which develops into a seedling under appropriate conditions. This process is known as germination."
            },
            {
            "heading_name": "7.3.3 Reproduction in Human Beings",
            "raw_text": "So far, we have been discussing the variety of modes that different species use for reproduction. Let us now look at the species that we are most interested in, namely, humans. Humans use a sexual mode of reproduction. How does this process work? Let us begin at an apparently unrelated point. All of us know that our bodies change as we become older. You have learnt changes that take place in your body earlier in Class VIII also. We notice that our height has increased continuously from early age till now. We acquire teeth, we even lose the old, so-called milk teeth and acquire new ones. All of these are changes that can be grouped under the general process of growth, in which the body becomes larger. But in early teenage years, a whole new set of changes occurs that cannot be explained simply as body enlargement. Instead, the appearance of the body changes. Proportions change, new features appear, and so do new sensations. Some of these changes are common to both boys and girls. We begin to notice thick hair growing in new parts of the body such as armpits and the genital area between the thighs, which can also become darker in colour. Thinner hair can also appear on legs and arms, as well as on the face. The skin frequently becomes oily and we might begin to develop pimples. We begin to be conscious and aware of both our own bodies and those of others in new ways. On the other hand, there are also changes taking place that are different between boys and girls. In girls, breast size begins to increase, with darkening of the skin of the nipples at the tips of the breasts. Also, girls begin to menstruate at around this time. Boys begin to have new thick hair growth on the face and their voices begin to crack. Further, the penis occasionally begins to become enlarged and erect, either in daydreams or at night. All of these changes take place slowly, over a period of months and years. They do not happen all at the same time in one person, nor do they happen at an exact age. In some people, they happen early and quickly, while in others, they can happen slowly. Also, each change does not become complete quickly either. So, for example, thick hair on the face in boys appears as a few scattered hairs first, and only slowly does the growth begin to become uniform. Even so, all these changes show differences between people. Just as we have differently shaped noses or fingers, so also we have different patterns of hair growth, or size and shape of breast or penis. All of these changes are aspects of the sexual maturation of the body. Why does the body show sexual maturation at this age? We have talked about the need for specialised cell types in multi-cellular bodies to carry out specialised functions. The creation of germ-cells to participate in sexual reproduction is another specialised function, and we have seen that plants develop special cell and tissue types to create them. Human beings also develop special tissues for this purpose. However, while the body of the individual organism is growing to its adult size, the resources of the body are mainly directed at achieving this growth. While that is happening, the maturation of the reproductive tissue is not likely to be a major priority. Thus, as the rate of general body growth begins to slow down, reproductive tissues begin to mature. This period during adolescence is called puberty. So how do all the changes that we have talked about link to the reproductive process? We must remember that the sexual mode of reproduction means that germ-cells from two individuals have to join together. This can happen by the external release of germ-cells from the bodies of individuals, as happens in flowering plants. Or it can happen by two individuals joining their bodies together for internal transfer of germ-cells for fusion, as happens in many animals. If animals are to participate in this process of mating, their state of sexual maturity must be identifiable by other individuals. Many changes during puberty, such as new hair-growth patterns, are signals that sexual maturation is taking place. On the other hand, the actual transfer of germ-cells between two people needs special organs for the sexual act, such as the penis when it is capable of becoming erect. In mammals such as humans, the baby is carried in the mother’s body for a long period, and will be breast-fed later. The female reproductive organs and breasts will need to mature to accommodate these possibilities. Let us look at the systems involved in the process of sexual reproduction."
                
            },
            {
                "heading_name":"7.3.3 (a) Male Reproductive System",
                "raw_text":"The male reproductive system (Fig. 7.10) consists of portions which produce the germ-cells and other portions that deliver the germ-cells to the site of fertilisation. The formation of germ-cells or sperms takes place in the testes. These are located outside the abdominal cavity in scrotum because sperm formation requires a lower temperature than the normal body temperature. We have discussed the role of the testes in the secretion of the hormone, testosterone, in the previous chapter. In addition to regulating the formation of sperms, testosterone brings about changes in appearance seen in boys at the time of puberty. The sperms formed are delivered through the vas deferens which unites with a tube coming from the urinary bladder. The urethra thus forms a common passage for both the sperms and urine. Along the path of the vas deferens, glands like the prostate and the seminal vesicles add their secretions so that the sperms are now in a fluid which makes their transport easier and this fluid also provides nutrition. The sperms are tiny bodies that consist of mainly genetic material and a long tail that helps them to move towards the female germ-cell."
            },
            {
                "heading_name":"7.3.3 (b) Female Reproductive System",
                "raw_text": "The female germ-cells or eggs are made in the ovaries. They are also responsible for the production of some hormones. Look at Fig. 7.11 and identify the various organs in the female reproductive system. When a girl is born, the ovaries already contain thousands of immature eggs. On reaching puberty, some of these start maturing. One egg is produced every month by one of the ovaries. The egg is carried from the ovary to the womb through a thin oviduct or fallopian tube. The two oviducts unite into an elastic bag-like structure known as the uterus. The uterus opens into the vagina through the cervix. The sperms enter through the vaginal passage during sexual intercourse. They travel upwards and reach the oviduct where they may encounter the egg. The fertilised egg (zygote) starts dividing and form a ball of cells or embryo. The embryo is implanted in the lining of the uterus where they continue to grow and develop organs to become foetus. We have seen in earlier sections that the mother’s body is designed to undertake the development of the child. Hence the uterus prepares itself every month to receive and nurture the growing embryo. The lining thickens and is richly supplied with blood to nourish the growing embryo. The embryo gets nutrition from the mother’s blood with the help of a special tissue called placenta. This is a disc which is embedded in the uterine wall. It contains villi on the embryo’s side of the tissue. On the mother’s side are blood spaces, which surround the villi. This provides a large surface area for glucose and oxygen to pass from the mother to the embryo. The developing embryo will also generate waste substances which can be removed by transferring them into the mother’s blood through the placenta. The development of the child inside the mother’s body takes approximately nine months. The child is born as a result of rhythmic contractions of the muscles in the uterus."
            },
            {
                "heading_name":" 7.3.3 (c) What happens when the Egg is not Fertilised?",
                "raw_text":"If the egg is not fertilised, it lives for about one day. Since the ovary releases one egg every month, the uterus also prepares itself every month to receive a fertilised egg. Thus its lining becomes thick and spongy. This would be required for nourishing the embryo if fertilisation had taken place. Now, however, this lining is not needed any longer. So, the lining slowly breaks and comes out through the vagina as blood and mucous. This cycle takes place roughly every month and is known as menstruation. It usually lasts for about two to eight days."
            },
            {
                "heading_name":"7.3.3 (d) Reproductive Health",
                "raw_text":"As we have seen, the process of sexual maturation is gradual and takes place while general body growth is still going on. Therefore, some degree of sexual maturation does not necessarily mean that the body or the mind is ready for sexual acts or for having and bringing up children. How do we decide if the body or the mind is ready for this major responsibility? All of us are under many different kinds of pressures about these issues. There can be pressure from our friends for participating in many activities, whether we really want to or not. There can be pressure from families to get married and start having children. There can be pressure from government agencies to avoid having children. In this situation, making choices can become very difficult. We must also consider the possible health consequences of having sex. We have discussed in Class IX that diseases can be transmitted from person to person in a variety of ways. Since the sexual act is a very intimate connection of bodies, it is not surprising that many diseases can be sexually transmitted. These include bacterial infections such as gonorrhoea and syphilis, and viral infections such as warts and HIV-AIDS. Is it possible to prevent the transmission of such diseases during the sexual act? Using a covering, called a condom, for the penis during sex helps to prevent transmission of many of these infections to some extent. The sexual act always has the potential to lead to pregnancy. Pregnancy will make major demands on the body and the mind of the woman, and if she is not ready for it, her health will be adversely affected. Therefore, many ways have been devised to avoid pregnancy. These contraceptive methods fall in a number of categories. One category is the creation of a mechanical barrier so that sperm does not reach the egg. Condoms on the penis or similar coverings worn in the vagina can serve this purpose. Another category of contraceptives acts by changing the hormonal balance of the body so that eggs are not released and fertilisation cannot occur. These drugs commonly need to be taken orally as pills. However, since they change hormonal balances, they can cause side-effects too. Other contraceptive devices such as the loop or the copper-T are placed in the uterus to prevent pregnancy. Again, they can cause side effects due to irritation of the uterus. If the vas deferens in the male is blocked, sperm transfer will be prevented. If the fallopian tube in the female is blocked, the egg will not be able to reach the uterus. In both cases, fertilisation will not take place. Surgical methods can be used to create such blocks. While surgical methods are safe in the long run, surgery itself can cause infections and other problems if not performed properly. Surgery can also be used for removal of unwanted pregnancies. These may be misused by people who do not want a particular child, as happens in illegal sex-selective abortion of female foetuses. For a healthy society, the female-male sex ratio must be maintained. Because of reckless female foeticides, the child sex ratio is declining at an alarming rate in some sections of our society, although prenatal sex determination has been prohibited by law. We have noted earlier that reproduction is the process by which organisms increase their populations. The rates of birth and death in a given population will determine its size. The size of the human population is a cause for concern for many people. This is because an expanding population makes it harder to improve everybody’s standard of living. However, if inequality in society is the main reason for poor standards of living for many people, the size of the population is relatively unimportant. If we look around us, what can we identify as the most important reason(s) for poor living standards?"
            }
        ]
    },
    {
    "chapter_number": 8,
    "chapter_name": "Heredity",
    "content": [
        {
            "heading_name": "8.1 ACCUMULATION OF VARIATION DURING REPRODUCTION",
            "raw_text": "We have seen that reproductive processes give rise to new individuals that are similar, but subtly different. We have discussed how some amount of variation is produced even during asexual reproduction. And the number of successful variations are maximised by the process of sexual reproduction. If we observe a field of sugarcane we find very little variations among the individual plants. But in a number of animals including human beings, which reproduce sexually, quite distinct variations are visible among different individuals. In this chapter, we shall be studying the mechanism by which variations are created and inherited. \n\nCreation of diversity over succeeding generations. The original organism at the top will give rise to, say, two individuals, similar in body design, but with subtle differences. Each of them, in turn, will give rise to two individuals in the next generation. Each of the four individuals in the bottom row will be different from each other. While some of these differences will be unique, others will be inherited from their respective parents, who were different from each other. Inheritance from the previous generation provides both a common basic body design, and subtle changes in it, for the next generation. Now think about what would happen when this new generation, in its turn, reproduces. The second generation will have differences that they inherit from the first generation, as well as newly created differences (Fig. 8.1). Figure 8.1 would represent the situation if a single individual reproduces, as happens in asexual reproduction. If one bacterium divides, and then the resultant two bacteria divide again, the four individual bacteria generated would be very similar. There would be only very minor differences between them, generated due to small inaccuracies in DNA copying. However, if sexual reproduction is involved, even greater diversity will be generated, as we will see when we discuss the rules of inheritance. Do all these variations in a species have equal chances of surviving in the environment in which they find themselves? Obviously not. Depending on the nature of variations, different individuals would have different kinds of advantages. Bacteria that can withstand heat will survive better in a heat wave, as we have discussed earlier. Selection of variants by environmental factors forms the basis for evolutionary processes, as we will discuss in later sections."
        },
        {
            "heading_name": "8.2 HEREDITY",
            "raw_text": "The most obvious outcome of the reproductive process still remains the generation of individuals of similar design. The rules of heredity determine the process by which traits and characteristics are reliably inherited. Let us take a closer look at these rules."
        },
        {
            "heading_name": "8.2.1 Inherited Traits",
            "raw_text": "What exactly do we mean by similarities and differences? We know that a child bears all the basic features of a human being. However, it does not look exactly like its parents, and human populations show a great deal of variation."
        },
        {
            "heading_name": "8.2.2 Rules for the Inheritance of Traits – Mendel’s Contributions",
            "raw_text": "The rules for inheritance of such traits in human beings are related to the fact that both the father and the mother contribute practically equal amounts of genetic material to the child. This means that each trait can be influenced by both paternal and maternal DNA. Thus, for each trait there will be two versions in each child. What will, then, the trait seen in the child be? Mendel (see box) worked out the main rules of such inheritance, and it is interesting to look at some of his experiments from more than a century ago. Mendel was educated in a monastery and went on to study science and mathematics at the University of Vienna. Failure in the examinations for a teaching certificate did not suppress his zeal for scientific quest. He went back to his monastery and started growing peas. Many others had studied the inheritance of traits in peas and other organisms earlier, but Mendel blended his knowledge of science and mathematics and was the first one to keep count of individuals exhibiting a particular trait in each generation. This helped him to arrive at the laws of inheritance. Mendel used a number of contrasting visible characters of garden peas—round/wrinkled seeds, tall/short plants, white/violet flowers and so on. He took pea plants with different characteristics—a tall plant and a short plant, produced progeny by crossing them, and calculated the percentages of tall or short progeny. In the first place, there were no halfway characteristics in this first-generation, or F1 progeny—no ‘medium-height’ plants. All plants were tall. This meant that only one of the parental traits was seen, not some mixture of the two. So the next question was, were the tall plants in the F1 generation exactly the same as the tall plants of the parent generation? Mendelian experiments test this by getting both the parental plants and these F1 tall plants to reproduce by self-pollination. The progeny of the parental plants are, of course, all tall. However, the second-generation, or F2, progeny of the F1 tall plants are not all tall. Instead, one quarter of them are short. This indicates that both the tallness and shortness traits were inherited in the F1 plants, but only the tallness trait was expressed. This led Mendel to propose that two copies of factor (now called genes) controlling traits are present in sexually reproducing organism. These two may be identical, or may be different, depending on the parentage. A pattern of inheritance can be worked out with this assumption, as shown in Fig. 8.3. In this explanation, both TT and Tt are tall plants, while only tt is a short plant. In other words, a single copy of T is enough to make the plant tall, while both copies have to be ‘t’ for the plant to be short. Traits like T are called dominant traits, while those that behave like ‘t’ are called recessive traits. What happens when pea plants showing two different characteristics, rather than just one, are bred with each other? What do the progeny of a tall plant with round seeds and a short plant with wrinkled-seeds look like? They are all tall and have round seeds. Tallness and round seeds are thus dominant traits. But what happens when these F1 progeny are used to generate F2 progeny by self-pollination? A Mendelian experiment will find that some F2 progeny are tall plants with round seeds, and some were short plants with wrinkled seeds. However, there would also be some F2 progeny that showed new combinations. Some of them would be tall, but have wrinkled seeds, while others would be short, but have round seeds. You can see as to how new combinations of traits are formed in F2 offspring when factors controlling for seed shape and seed colour recombine to form zygote leading to form F2 offspring (Fig. 8.5). Thus, the tall/short trait and the round seed/wrinkled seed trait are independently inherited."
        },
        {
            "heading_name": "8.2.3 How do these Traits get Expressed?",
            "raw_text": "How does the mechanism of heredity work? Cellular DNA is the information source for making proteins in the cell. A section of DNA that provides information for one protein is called the gene for that protein. How do proteins control the characteristics that we are discussing here? Let us take the example of tallness as a characteristic. We know that plants have hormones that can trigger growth. Plant height can thus depend on the amount of a particular plant hormone. The amount of the plant hormone made will depend on the efficiency of the process for making it. Consider now an enzyme that is important for this process. If this enzyme works efficiently, a lot of hormone will be made, and the plant will be tall. If the gene for that enzyme has an alteration that makes the enzyme less efficient, the amount of hormone will be less, and the plant will be short. Thus, genes control characteristics, or traits. If the interpretations of Mendelian experiments we have been discussing are correct, then both parents must be contributing equally to the DNA of the progeny during sexual reproduction. We have disscussed this issue in the previous Chapter. If both parents can help determine the trait in the progeny, both parents must be contributing a copy of the same gene. This means that each pea plant must have two sets of all genes, one inherited from each parent. For this mechanism to work, each germ cell must have only one gene set. How do germ-cells make a single set of genes from the normal two copies that all other cells in the body have? If progeny plants inherited a single whole gene set from each parent, then the experiment explained in Fig. 8.5 cannot work. This is because the two characteristics 'R' and 'y' would then be linked to each other and cannot be independently inherited. This is explained by the fact that each gene set is present, not as a single long thread of DNA, but as separate independent pieces, each called a chromosome. Thus, each cell will have two copies of each chromosome, one each from the male and female parents. Every germ-cell will take one chromosome from each pair and these may be of either maternal or paternal origin. When two germ cells combine, they will restore the normal number of chromosomes in the progeny, ensuring the stability of the DNA of the species. Such a mechanism of inheritance explains the results of the Mendel experiments, and is used by all sexually reproducing organisms. But asexually reproducing organisms also follow similar rules of inheritance. Can we work out how their inheritance might work?"
        },
        {
            "heading_name": "8.2.4 Sex Determination",
            "raw_text": "We have discussed the idea that the two sexes participating in sexual reproduction must be somewhat different from each other for a number of reasons. How is the sex of a newborn individual determined? Different species use very different strategies for this. Some rely entirely on environmental cues. Thus, in some animals like a few reptiles, the temperature at which fertilised eggs are kept determines whether the animals developing in the eggs will be male or female. In other animals, such as snails, individuals can change sex, indicating that sex is not genetically determined. However, in human beings, the sex of the individual is largely genetically determined. In other words, the genes inherited from our parents decide whether we will be boys or girls. But so far, we have assumed that similar gene sets are inherited from both parents. If that is the case, how can genetic inheritance determine sex? The explanation lies in the fact that all human chromosomes are not paired. Most human chromosomes have a maternal and a paternal copy, and we have 22 such pairs. But one pair, called the sex chromosomes, is odd in not always being a perfect pair. Women have a perfect pair of sex chromosomes, both called X. But men have a mismatched pair in which one is a normal-sized X while the other is a short one called Y. So women are XX, while men are XY. Now, can we work out what the inheritance pattern of X and Y will be? As Fig. 8.6 shows, half the children will be boys and half will be girls. All children will inherit an X chromosome from their mother regardless of whether they are boys or girls. Thus, the sex of the children will be determined by what they inherit from their father. A child who inherits an X chromosome from her father will be a girl, and one who inherits a Y chromosome from him will be a boy."
        }
    ]
},
{
    "chapter_number": 9,
    "chapter_name": "Light – Reflection and Refraction",
    "content": [
        {
            "heading_name": "9.1 REFLECTION OF LIGHT",
            "raw_text": "We see a variety of objects in the world around us. However, we are unable to see anything in a dark room. On lighting up the room, things become visible. What makes things visible? During the day, the sunlight helps us to see objects. An object reflects light that falls on it. This reflected light, when received by our eyes, enables us to see things. We are able to see through a transparent medium as light is transmitted through it. There are a number of common wonderful phenomena associated with light such as image formation by mirrors, the twinkling of stars, the beautiful colours of a rainbow, bending of light by a medium and so on. A study of the properties of light helps us to explore them. By observing the common optical phenomena around us, we may conclude that light seems to travel in straight lines. The fact that a small source of light casts a sharp shadow of an opaque object points to this straight-line path of light, usually indicated as a ray of light. If an opaque object on the path of light becomes very small, light has a tendency to bend around it and not walk in a straight line - an effect known as the diffraction of light. Then the straight-line treatment of optics using rays fails. To explain phenomena such as diffraction, light is thought of as a wave, the details of which you will study in higher classes. Again, at the beginning of the $20^{th}$ century, it became known that the wave theory of light often becomes inadequate for treatment of the interaction of light with matter, and light often behaves somewhat like a stream of particles. This confusion about the true nature of light continued for some years till a modern quantum theory of light emerged in which light is neither a 'wave' nor a 'particle' - the new theory reconciles the particle properties of light with the wave nature. In this Chapter, we shall study the phenomena of reflection and refraction of light using the straight-line propagation of light. These basic concepts will help us in the study of some of the optical phenomena in nature. We shall try to understand in this Chapter the reflection of light by spherical mirrors and refraction of light and their application in real life situations. A highly polished surface, such as a mirror, reflects most of the light falling on it. You are already familiar with the laws of reflection of light. Let us recall these laws - (i) The angle of incidence is equal to the angle of reflection, and (ii) The incident ray, the normal to the mirror at the point of incidence and the reflected ray, all lie in the same plane. These laws of reflection are applicable to all types of reflecting surfaces including spherical surfaces. You are familiar with the formation of image by a plane mirror. What are the properties of the image? Image formed by a plane mirror is always virtual and erect. The size of the image is equal to that of the object. The image formed is as far behind the mirror as the object is in front of it. Further, the image is laterally inverted. How would the images be when the reflecting surfaces are curved? Let us explore."
        },
        {
            "heading_name": "9.2 SPHERICAL MIRRORS",
            "raw_text": "The curved surface of a shining spoon could be considered as a curved mirror. The most commonly used type of curved mirror is the spherical mirror. The reflecting surface of such mirrors can be considered to form a part of the surface of a sphere. Such mirrors, whose reflecting surfaces are spherical, are called spherical mirrors. We shall now study about spherical mirrors in some detail. The reflecting surface of a spherical mirror may be curved inwards or outwards. A spherical mirror, whose reflecting surface is curved inwards, that is, faces towards the centre of the sphere, is called a concave mirror. A spherical mirror whose reflecting surface is curved outwards, is called a convex mirror. The schematic representation of these mirrors is shown in Fig. 9.1. You may note in these diagrams that the back of the mirror is shaded. You may now understand that the surface of the spoon curved inwards can be approximated to a concave mirror and the surface of the spoon bulged outwards can be approximated to a convex mirror. Before we move further on spherical mirrors, we need to recognise and understand the meaning of a few terms. These terms are commonly used in discussions about spherical mirrors. The centre of the reflecting surface of a spherical mirror is a point called the pole. It lies on the surface of the mirror. The pole is usually represented by the letter P. The reflecting surface of a spherical mirror forms a part of a sphere. This sphere has a centre. This point is called the centre of curvature of the spherical mirror. It is represented by the letter C. Please note that the centre of curvature is not a part of the mirror. It lies outside its reflecting surface. The centre of curvature of a concave mirror lies in front of it. However, it lies behind the mirror in case of a convex mirror. You may note this in Fig.9.2 (a) and (b). The radius of the sphere of which the reflecting surface of a spherical mirror forms a part, is called the radius of curvature of the mirror. It is represented by the letter R. You may note that the distance PC is equal to the radius of curvature. Imagine a straight line passing through the pole and the centre of curvature of a spherical mirror. This line is called the principal axis. Remember that principal axis is normal to the mirror at its pole. Let us understand an important term related to mirrors, through an Activity. CAUTION: Do not look at the Sun directly or even into a mirror reflecting sunlight. It may damage your eyes. The paper at first begins to burn producing smoke. Eventually it may even catch fire. Why does it burn? The light from the Sun is converged at a point, as a sharp, bright spot by the mirror. In fact, this spot of light is the image of the Sun on the sheet of paper. This point is the focus of the concave mirror. The heat produced due to the concentration of sunlight ignites the paper. The distance of this image from the position of the mirror gives the approximate value of focal length of the mirror. Let us try to understand this observation with the help of a ray diagram. Observe Fig.9.2 (a) closely. A number of rays parallel to the principal axis are falling on a concave mirror. Observe the reflected rays. They are all meeting/intersecting at a point on the principal axis of the mirror. This point is called the principal focus of the concave mirror. Similarly, observe Fig. 9.2 (b). How are the rays parallel to the principal axis, reflected by a convex mirror? The reflected rays appear to come from a point on the principal axis. This point is called the principal focus of the convex mirror. The principal focus is represented by the letter F. The distance between the pole and the principal focus of a spherical mirror is called the focal length. It is represented by the letter f. The reflecting surface of a spherical mirror is by-and-large spherical. The surface, then, has a circular outline. The diameter of the reflecting surface of spherical mirror is called its aperture. In Fig.9.2, distance MN represents the aperture. We shall consider in our discussion only such spherical mirrors whose aperture is much smaller than its radius of curvature. Is there a relationship between the radius of curvature R, and focal length f. of a spherical mirror? For spherical mirrors of small apertures, the radius of curvature is found to be equal to twice the focal length. We put this as $R=2f$. This implies that the principal focus of a spherical mirror lies midway between the pole and centre of curvature."
        },
        {
            "heading_name": "9.2.1 Image Formation by Spherical Mirrors",
            "raw_text": "You have studied about the image formation by plane mirrors. You also know the nature, position and relative size of the images formed by them. How about the images formed by spherical mirrors? How can we locate the image formed by a concave mirror for different positions of the object? Are the images real or virtual? Are they enlarged, diminished or have the same size? We shall explore this with an Activity. You will see in the above Activity that the nature, position and size of the image formed by a concave mirror depends on the position of the object in relation to points P, F and C. The image formed is real for some positions of the object. It is found to be a virtual image for a certain other position. The image is either magnified, reduced or has the same size, depending on the position of the object. A summary of these observations is given for your reference in Table 9.1. We studied the image formation by a concave mirror. Now we shall study the formation of image by a convex mirror. We consider two positions of the object for studying the image formed by a convex mirror. First is when the object is at infinity and the second position is when the object is at a finite distance from the mirror. The ray diagrams for the formation of image by a convex mirror for these two positions of the object are shown in Fig.9.8 (a) and (b), respectively. The results are summarised in Table 9.2. You have so far studied the image formation by a plane mirror, a concave mirror and a convex mirror. Which of these mirrors will give the full image of a large object? Let us explore through an Activity. You can see a full-length image of a tall building/tree in a small convex mirror. One such mirror is fitted in a wall of Agra Fort facing Taj Mahal. If you visit the Agra Fort, try to observe the full image of Taj Mahal. To view distinctly, you should stand suitably at the terrace adjoining the wall."
        },
        {
            "heading_name": "9.2.2 Representation of Images Formed by Spherical Mirrors Using Ray Diagrams",
            "raw_text": "We can also study the formation of images by spherical mirrors by drawing ray diagrams. Consider an extended object, of finite size, placed in front of a spherical mirror. Each small portion of the extended object acts like a point source. An infinite number of rays originate from each of these points. To construct the ray diagrams, in order to locate the image of an object, an arbitrarily large number of rays emanating from a point could be considered. However, it is more convenient to consider only two rays, for the sake of clarity of the ray diagram. These rays are so chosen that it is easy to know their directions after reflection from the mirror. The intersection of at least two reflected rays give the position of image of the point object. Any two of the following rays can be considered for locating the image. (i) A ray parallel to the principal axis, after reflection, will pass through the principal focus in case of a concave mirror or appear to diverge from the principal focus in case of a convex mirror. This is illustrated in Fig.9.3 (a) and (b). (ii) A ray passing through the principal focus of a concave mirror or a ray which is directed towards the principal focus of a convex mirror, after reflection, will emerge parallel to the principal axis. This is illustrated in Fig.9.4 (a) and (b). (iii) A ray passing through the centre of curvature of a concave mirror or directed in the direction of the centre of curvature of a convex mirror, after reflection, is reflected back along the same path. This is illustrated in Fig.9.5 (a) and (b). The light rays come back along the same path because the incident rays fall on the mirror along the normal to the reflecting surface. (iv) A ray incident obliquely to the principal axis, towards a point P (pole of the mirror), on the concave mirror [Fig. 9.6 (a)] or a convex mirror [Fig. 9.6 (b)], is reflected obliquely. The incident and reflected rays follow the laws of reflection at the point of incidence (point P), making equal angles with the principal axis. Remember that in all the above cases the laws of reflection are followed. At the point of incidence, the incident ray is reflected in such a way that the angle of reflection equals the angle of incidence. Figure 9.7 illustrates the ray diagrams for the formation of image by a concave mirror for various positions of the object. Draw neat ray diagrams for each position of the object shown in Table 9.1. You may take any two of the rays mentioned in the previous section for locating the image. Compare your diagram with those given in Fig. 9.7. Describe the nature, position and relative size of the image formed in each case. Tabulate the results in a convenient format. The ray diagrams for the formation of image by a convex mirror for these two positions of the object are shown in Fig.9.8 (a) and (b), respectively. The results are summarised in Table 9.2."
        },
        {
            "heading_name": "9.2.3 Sign Convention for Reflection by Spherical Mirrors",
            "raw_text": "While dealing with the reflection of light by spherical mirrors, we shall follow a set of sign conventions called the New Cartesian Sign Convention. In this convention, the pole (P) of the mirror is taken as the origin (Fig. 9.9). The principal axis of the mirror is taken as the x-axis (XX) of the coordinate system. The conventions are as follows - (i) The object is always placed to the left of the mirror. This implies that the light from the object falls on the mirror from the left-hand side. (ii) All distances parallel to the principal axis are measured from the pole of the mirror. (iii) All the distances measured to the right of the origin (along + x-axis) are taken as positive while those measured to the left of the origin (along-x-axis) are taken as negative. (iv) Distances measured perpendicular to and above the principal axis (along + y-axis) are taken as positive. (v) Distances measured perpendicular to and below the principal axis (along-y-axis) are taken as negative. The New Cartesian Sign Convention described above is illustrated in Fig.9.9 for your reference. These sign conventions are applied to obtain the mirror formula and solve related numerical problems."
        },
        {
            "heading_name": "9.2.4 Mirror Formula and Magnification",
            "raw_text": "In a spherical mirror, the distance of the object from its pole is called the object distance (u). The distance of the image from the pole of the mirror is called the image distance (v). You already know that the distance of the principal focus from the pole is called the focal length (f). There is a relationship between these three quantities given by the mirror formula which is expressed as $$\\frac{1}{v}+\\frac{1}{u}=\\frac{1}{f}$$ (9.1) This formula is valid in all situations for all spherical mirrors for all positions of the object. You must use the New Cartesian Sign Convention while substituting numerical values for u, v, f, and R in the mirror formula for solving problems. Magnification produced by a spherical mirror gives the relative extent to which the image of an object is magnified with respect to the object size. It is expressed as the ratio of the height of the image to the height of the object. It is usually represented by the letter m. If h is the height of the object and the height of the image, then the magnification m produced by a spherical mirror is given by $$m=\\frac{Height~of~the~image~(h')}{Height~of~the~object~(h)}=\\frac{h'}{h}$$ (9.2) The magnification m is also related to the object distance (u) and image distance (v). It can be expressed as: Magnification $(m)=\\frac{h'}{h}=-\\frac{v}{u}$ (9.3) You may note that the height of the object is taken to be positive as the object is usually placed above the principal axis. The height of the image should be taken as positive for virtual images. However, it is to be taken as negative for real images. A negative sign in the value of the magnification indicates that the image is real. A positive sign in the value of the magnification indicates that the image is virtual."
        },
        {
            "heading_name": "9.3 REFRACTION OF LIGHT",
            "raw_text": "Light seems to travel along straight-line paths in a transparent medium. What happens when light enters from one transparent medium to another? Does it still move along a straight-line path or change its direction? We shall recall some of our day-to-day experiences. You might have observed that the bottom of a tank or a pond containing water appears to be raised. Similarly, when a thick glass slab is placed over some printed matter, the letters appear raised when viewed through the glass slab. Why does it happen? Have you seen a pencil partly immersed in water in a glass tumbler? It appears to be displaced at the interface of air and water. You might have observed that a lemon kept in water in a glass tumbler appears to be bigger than its actual size, when viewed from the sides. How can you account for such experiences? Let us consider the case of the apparent displacement of a pencil, partly immersed in water. The light reaching you from the portion of the pencil inside water seems to come from a different direction, compared to the part above water. This makes the pencil appear to be displaced at the interface. For similar reasons, the letters appear to be raised, when seen through a glass slab placed over it. Does a pencil appear to be displaced to the same extent, if instead of water, we use liquids like kerosene or turpentine? Will the letters appear to rise to the same height if we replace a glass slab with a transparent plastic slab? You will find that the extent of the effect is different for different pair of media. These observations indicate that light does not travel in the same direction in all media. It appears that when travelling obliquely from one medium to another, the direction of propagation of light in the second medium changes. This phenomenon is known as refraction of light. Let us understand this phenomenon further by doing a few activities. Place a coin at the bottom of a bucket filled with water. With your eye to a side above water, try to pick up the coin in one go. Did you succeed in picking up the coin? Repeat the Activity. Why did you not succeed in doing it in one go? Ask your friends to do this. Compare your experience with theirs. Place a large shallow bowl on a Table and put a coin in it. Move away slowly from the bowl. Stop when the coin just disappears from your sight. Ask a friend to pour water gently into the bowl without disturbing the coin. Keep looking for the coin from your position. Does the coin becomes visible again from your position? How could this happen? The coin becomes visible again on pouring water into the bowl. The coin appears slightly raised above its actual position due to refraction of light. Draw a thick straight line in ink, over a sheet of white paper placed on a Table. Place a glass slab over the line in such a way that one of its edges makes an angle with the line. Look at the portion of the line under the slab from the sides. What do you observe? Does the line under the glass slab appear to be bent at the edges? Next, place the glass slab such that it is normal to the line. What do you observe now? Does the part of the line under the glass slab appear bent? Look at the line from the top of the glass slab. Does the part of the line, beneath the slab, appear to be raised? Why does this happen?"
        },
        {
            "heading_name": "9.3.1 Refraction through a Rectangular Glass Slab",
            "raw_text": "To understand the phenomenon of refraction of light through a glass slab, let us do an Activity. Fix a sheet of white paper on a drawing board using drawing pins. Place a rectangular glass slab over the sheet in the middle. Draw the outline of the slab with a pencil. Let us name the outline as ABCD. Take four identical pins. Fix two pins, say E and F, vertically such that the line joining the pins is inclined to the edge AB. Look for the images of the pins E and F through the opposite edge. Fix two other pins, say G and H. such that these pins and the images of E and F lie on a straight line. Remove the pins and the slab. Join the positions of tip of the pins E and F and produce the line up to AB. Let EF meet AB at O. Similarly, join the positions of tip of the pins G and H and produce it up to the edge CD. Let HG meet CD at O'. Join O and O'. Also produce EF up to P, as shown by a dotted line in Fig. 9.10. In this Activity, you will note, the light ray has changed its direction at points O and O'. Note that both the points O and O' on surfaces separating two transparent media. Draw a perpendicular NN' to AB at O and another perpendicular MM'to CD at O'. The light ray at point O has entered from a rarer medium to a denser medium, that is, from air to glass. Note that the light ray has bent towards the normal. At O' the light ray has entered from glass to air, that is, from a denser medium to a rarer medium. The light here has bent away from the normal. Compare the angle of incidence with the angle of refraction at both refracting surfaces AB and CD. In Fig. 9.10, a ray EO is obliquely incident on surface AB, called incident ray. OO' is the refracted ray and O'H is the emergent ray. You may observe that the emergent ray is parallel to the direction of the incident ray. Why does it happen so? The extent of bending of the ray of light at the opposite parallel faces AB (air-glass interface) and CD (glass-air interface) of the rectangular glass slab is equal and opposite. This is why the ray emerges parallel to the incident ray. However, the light ray is shifted sideward slightly. What happens when a light ray is incident normally to the interface of two media? Try and find out. Now you are familiar with the refraction of light. Refraction is due to change in the speed of light as it enters from one transparent medium to another. Experiments show that refraction of light occurs according to certain laws. The following are the laws of refraction of light. (i) The incident ray, the refracted ray and the normal to the interface of two transparent media at the point of incidence, all lie in the same plane. (ii) The ratio of sine of angle of incidence to the sine of angle of refraction is a constant, for the light of a given colour and for the given pair of media. This law is also known as Snell's law of refraction. (This is true for angle $0<i<90^{\\circ}$). If i is the angle of incidence and r is the angle of refraction, then, $$\\frac{sin~i}{sin~r}=constant$$ (9.4) This constant value is called the refractive index of the second medium with respect to the first. Let us study about refractive index in some detail."
        },
        {
            "heading_name": "9.3.2 The Refractive Index",
            "raw_text": "You have already studied that a ray of light that travels obliquely from one transparent medium into another will change its direction in the second medium. The extent of the change in direction that takes place in a given pair of media may be expressed in terms of the refractive index, the \"constant\" appearing on the right-hand side of Eq. (9.4). The refractive index can be linked to an important physical quantity, the relative speed of propagation of light in different media. It turns out that light propagates with different speeds in different media. Light travels fastest in vacuum with speed of $3\\times10^{8}$ m $s^{-1}$. In air, the speed of light is only marginally less, compared to that in vacuum. It reduces considerably in glass or water. The value of the refractive index for a given pair of media depends upon the speed of light in the two media, as given below. Consider a ray of light travelling from medium 1 into medium 2, as shown in Fig.9.11. Let $v_1$ be the speed of light in medium 1 and $v_2$ be the speed of light in medium 2. The refractive index of medium 2 with respect to medium 1 is given by the ratio of the speed of light in medium 1 and the speed of light in medium 2. This is usually represented by the symbol $n_{21}$. This can be expressed in an equation form as $$n_{21} = \\frac{Speed~of~light~in~medium~1}{Speed~of~light~in~medium~2} = \\frac{v_1}{v_2}$$ (9.5) By the same argument, the refractive index of medium 1 with respect to medium 2 is represented as $n_{12}$. It is given by $$n_{12} = \\frac{Speed~of~light~in~medium~2}{Speed~of~light~in~medium~1} = \\frac{v_2}{v_1}$$ (9.6) If medium 1 is vacuum or air, then the refractive index of medium 2 is considered with respect to vacuum. This is called the absolute refractive index of the medium. It is simply represented as $n_2$. If c is the speed of light in air and v is the speed of light in the medium, then, the refractive index of the medium $n_m$ is given by $$n_m = \\frac{Speed~of~light~in~air}{Speed~of~light~in~the~medium} = \\frac{c}{v}$$ (9.7) The absolute refractive index of a medium is simply called its refractive index. The refractive index of several media is given in Table 9.3. From the Table you can know that the refractive index of water, $n_w=1.33$. This means that the ratio of the speed of light in air and the speed of light in water is equal to 1.33. Similarly, the refractive index of crown glass, $n_g=1.52$. Such data are helpful in many places. However, you need not memorise the data. Note from Table 9.3 that an optically denser medium may not possess greater mass density. For example, kerosene having higher refractive index, is optically denser than water, although its mass density is less than water. The ability of a medium to refract light is also expressed in terms of its optical density. Optical density has a definite connotation. It is not the same as mass density. We have been using the terms 'rarer medium' and 'denser medium' in this Chapter. It actually means 'optically rarer medium' and 'optically denser medium', respectively. In comparing two media, the one with the larger refractive index is optically denser medium than the other. The other medium of lower refractive index is optically rarer. The speed of light is higher in a rarer medium than a denser medium. Thus, a ray of light travelling from a rarer medium to a denser medium slows down and bends towards the normal. When it travels from a denser medium to a rarer medium, it speeds up and bends away from the normal."
        },
        {
            "heading_name": "9.3.3 Refraction by Spherical Lenses",
            "raw_text": "You might have seen watchmakers using a small magnifying glass to see tiny parts. Have you ever touched the surface of a magnifying glass with your hand? Is it plane surface or curved? Is it thicker in the middle or at the edges? The glasses used in spectacles and that by a watchmaker are examples of lenses. What is a lens? How does it bend light rays? We shall discuss these in this section. A transparent material bound by two surfaces, of which one or both surfaces are spherical, forms a lens. This means that a lens is bound by at least one spherical surface. In such lenses, the other surface would be plane. A lens may have two spherical surfaces, bulging outwards. Such a lens is called a double convex lens. It is simply called a convex lens. It is thicker at the middle as compared to the edges. Convex lens converges light rays as shown in Fig. 9.12 (a). Hence convex lenses are also called converging lenses. Similarly, a double concave lens is bounded by two spherical surfaces, curved inwards. It is thicker at the edges than at the middle. Such lenses diverge light rays as shown in Fig. 9.12 (b). Such lenses are also called diverging lenses. A double concave lens is simply called a concave lens. A lens, either a convex lens or a concave lens, has two spherical surfaces. Each of these surfaces forms a part of a sphere. The centres of these spheres are called centres of curvature of the lens. The centre of curvature of a lens is usually represented by the letter C. Since there are two centres of curvature, we may represent them as $C_1$ and $C_2$. An imaginary straight line passing through the two centres of curvature of a lens is called its principal axis. The central point of a lens is its optical centre. It is usually represented by the letter O. A ray of light through the optical centre of a lens passes without suffering any deviation. The effective diameter of the circular outline of a spherical lens is called its aperture. We shall confine our discussion in this Chapter to such lenses whose aperture is much less than its radius of curvature and the two centres of curvatures are equidistant from the optical centre O. Such lenses are called thin lenses with small apertures. What happens when parallel rays of light are incident on a lens? Let us do an Activity to understand this. CAUTION: Do not look at the Sun directly or through a lens while doing this Activity or otherwise. You may damage your eyes if you do so. The paper begins to burn producing smoke. It may even catch fire after a while. Why does this happen? The light from the Sun constitutes parallel rays of light. These rays were converged by the lens at the sharp bright spot formed on the paper. In fact, the bright spot you got on the paper is a real image of the Sun. The concentration of the sunlight at a point generated heat. This caused the paper to burn. Now, we shall consider rays of light parallel to the principal axis of a lens. What happens when you pass such rays of light through a lens? This is illustrated for a convex lens in Fig.9.12 (a) and for a concave lens in Fig.9.12 (b). Observe Fig.9.12 (a) carefully. Several rays of light parallel to the principal axis are falling on a convex lens. These rays, after refraction from the lens, are converging to a point on the principal axis. This point on the principal axis is called the principal focus of the lens. Let us see now the action of a concave lens. Observe Fig.9.12 (b) carefully. Several rays of light parallel to the principal axis are falling on a concave lens. These rays, after refraction from the lens, are appearing to diverge from a point on the principal axis. This point on the principal axis is called the principal focus of the concave lens. If you pass parallel rays from the opposite surface of the lens, you get another principal focus on the opposite side. Letter F is usually used to represent principal focus. However, a lens has two principal foci. They are represented by $F_1$ and $F_2$. The distance of the principal focus from the optical centre of a lens is called its focal length. The letter f is used to represent the focal length. How can you find the focal length of a convex lens? Recall the Activity 9.11. In this Activity, the distance between the position of the lens and the position of the image of the Sun gives the approximate focal length of the lens."
        },
        {
            "heading_name": "9.3.4 Image Formation by Lenses",
            "raw_text": "Lenses form images by refracting light. How do lenses form images? What is their nature? Let us study this for a convex lens first. The nature, position and relative size of the image formed by convex lens for various positions of the object is summarised in Table 9.4. Let us now do an Activity to study the nature, position and relative size of the image formed by a concave lens. The summary of the above Activity is given in Table 9.5 below. What conclusion can you draw from this Activity? A concave lens will always give a virtual, erect and diminished image, irrespective of the position of the object."
        },
        {
            "heading_name": "9.3.5 Image Formation in Lenses Using Ray Diagrams",
            "raw_text": "We can represent image formation by lenses using ray diagrams. Ray diagrams will also help us to study the nature, position and relative size of the image formed by lenses. For drawing ray diagrams in lenses, alike of spherical mirrors, we consider any two of the following rays (i) A ray of light from the object, parallel to the principal axis, after refraction from a convex lens, passes through the principal focus on the other side of the lens, as shown in Fig. 9.13 (a). In case of a concave lens, the ray appears to diverge from the principal focus located on the same side of the lens, as shown in Fig. 9.13 (b). (ii) A ray of light passing through a principal focus, after refraction from a convex lens, will emerge parallel to the principal axis. This is shown in Fig. 9.14 (a). A ray of light appearing to meet at the principal focus of a concave lens, after refraction, will emerge parallel to the principal axis. This is shown in Fig.9.14 (b). (iii) A ray of light passing through the optical centre of a lens will emerge without any deviation. This is illustrated in Fig.9.15(a) and Fig.9.15 (b). The ray diagrams for the image formation in a convex lens for a few positions of the object are shown in Fig. 9.16. The ray diagrams representing the image formation in a concave lens for various positions of the object are shown in Fig. 9.17."
        },
        {
            "heading_name": "9.3.6 Sign Convention for Spherical Lenses",
            "raw_text": "For lenses, we follow sign convention, similar to the one used for spherical mirrors. We apply the rules for signs of distances, except that all measurements are taken from the optical centre of the lens. According to the convention, the focal length of a convex lens is positive and that of a concave lens is negative. You must take care to apply appropriate signs for the values of u, v, f, object height h and image height h'."
        },
        {
            "heading_name": "9.3.7 Lens Formula and Magnification",
            "raw_text": "As we have a formula for spherical mirrors, we also have formula for spherical lenses. This formula gives the relationship between object- distance (u), image-distance (v) and the focal length (f). The lens formula is expressed as $$\\frac{1}{v}-\\frac{1}{u}=\\frac{1}{f}$$ (9.8) The lens formula given above is general and is valid in all situations for any spherical lens. Take proper care of the signs of different quantities, while putting numerical values for solving problems relating to lenses. The magnification produced by a lens, similar to that for spherical mirrors, is defined as the ratio of the height of the image and the height of the object. Magnification is represented by the letter m. If h is the height of the object and h'is the height of the image given by a lens, then the magnification produced by the lens is given by $m=\\frac{Height~of~the~Image}{Height~of~the~object}=\\frac{h'}{h}$ (9.9) Magnification produced by a lens is also related to the object-distance u, and the image-distance v. This relationship is given by Magnification $(m)=\\frac{h'}{h}=\\frac{v}{u}$ (9.10)"
        },
        {
            "heading_name": "9.3.8 Power of a Lens",
            "raw_text": "You have already learnt that the ability of a lens to converge or diverge light rays depends on its focal length. For example, a convex lens of short focal length bends the light rays through large angles, by focussing them closer to the optical centre. Similarly, concave lens of very short focal length causes higher divergence than the one with longer focal length. The degree of convergence or divergence of light rays achieved by a lens is expressed in terms of its power. The power of a lens is defined as the reciprocal of its focal length. It is represented by the letter P. The power P of a lens of focal length f is given by $$P=\\frac{1}{f}$$ (9.11) The SI unit of power of a lens is 'dioptre'. It is denoted by the letter D. If f is expressed in metres, then, power is expressed in dioptres. Thus, 1 dioptre is the power of a lens whose focal length is 1 metre. $1D=1m^{-1}$. You may note that the power of a convex lens is positive and that of a concave lens is negative. Opticians prescribe corrective lenses indicating their powers. Let us say the lens prescribed has power equal to + 2.0 D. This means the lens prescribed is convex. The focal length of the lens is + 0.50 m. Similarly, a lens of power - 2.5 D has a focal length of -0.40 m. The lens is concave. Many optical instruments consist of a number of lenses. They are combined to increase the magnification and sharpness of the image. The net power (P) of the lenses placed in contact is given by the algebraic sum of the individual powers $P_1$, $P_2$, P3, as $P=P_1+P_2+P_3+...$. The use of powers, instead of focal lengths, for lenses is quite convenient for opticians. During eye-testing, an optician puts several different combinations of corrective lenses of known power, in contact, inside the testing spectacles' frame. The optician calculates the power of the lens required by simple algebraic addition. For example, a combination of two lenses of power +2.0 D and + 0.25 D is equivalent to a single lens of power + 2.25 D. The simple additive property of the powers of lenses can be used to design lens systems to minimise certain defects in images produced by a single lens. Such a lens system, consisting of several lenses, in contact, is commonly used in the design of lenses of camera, microscopes and telescopes."
        }
    ]
},
   {
    "chapter_number": 10,
    "chapter_name": "The Human Eye and the Colourful World",
    "content": [
        {
            "heading_name": "10.1 THE HUMAN EYE",
            "raw_text": "You have studied in the previous chapter about refraction of light by lenses. You also studied the nature, position and relative size of images formed by lenses. How can these ideas help us in the study of the human eye? The human eye uses light and enables us to see objects around us. It has a lens in its structure. What is the function of the lens in a human eye? How do the lenses used in spectacles correct defects of vision? Let us consider these questions in this chapter. We have learnt in the previous chapter about light and some of its properties. In this chapter, we shall use these ideas to study some of the optical phenomena in nature. We shall also discuss about rainbow formation, splitting of white light and blue colour of the sky. The human eye is one of the most valuable and sensitive sense organs. It enables us to see the wonderful world and the colours around us. On closing the eyes, we can identify objects to some extent by their smell, taste, sound they make or by touch. It is, however, impossible to identify colours while closing the eyes. Thus, of all the sense organs, the human eye is the most significant one as it enables us to see the beautiful, colourful world around us. The human eye is like a camera. Its lens system forms an image on a light-sensitive screen called the retina. Light enters the eye through a thin membrane called the cornea. It forms the transparent bulge on the front surface of the eyeball as shown in Fig. 10.1. The eyeball is approximately spherical in shape with a diameter of about 2.3 cm. Most of the refraction for the light rays entering the eye occurs at the outer surface of the cornea. The crystalline lens merely provides the finer adjustment of focal length required to focus objects at different distances on the retina. We find a structure called iris behind the cornea. Iris is a dark muscular diaphragm that controls the size of the pupil. The pupil regulates and controls the amount of light entering the eye. The eye lens forms an inverted real image of the object on the retina. The retina is a delicate membrane having enormous number of light-sensitive cells. The light-sensitive cells get activated upon illumination and generate electrical signals. These signals are sent to the brain via the optic nerves. The brain interprets these signals, and finally, processes the information so that we perceive objects as they are."
        },
        {
            "heading_name": "10.1.1 Power of Accommodation",
            "raw_text": "The eye lens is composed of a fibrous, jelly-like material. Its curvature can be modified to some extent by the ciliary muscles. The change in the curvature of the eye lens can thus change its focal length. When the muscles are relaxed, the lens becomes thin. Thus, its focal length increases. This enables us to see distant objects clearly. When you are looking at objects closer to the eye, the ciliary muscles contract. This increases the curvature of the eye lens. The eye lens then becomes thicker. Consequently, the focal length of the eye lens decreases. This enables us to see nearby objects clearly. The ability of the eye lens to adjust its focal length is called accommodation. However, the focal length of the eye lens cannot be decreased below a certain minimum limit. Try to read a printed page by holding it very close to your eyes. You may see the image being blurred or feel strain in the eye. To see an object comfortably and distinctly, you must hold it at about 25 cm from the eyes. The minimum distance, at which objects can be seen most distinctly without strain, is called the least distance of distinct vision. It is also called the near point of the eye. For a young adult with normal vision, the near point is about 25 cm. The farthest point upto which the eye can see objects clearly is called the far point of the eye. It is infinity for a normal eye. You may note here a normal eye can see objects clearly that are between 25 cm and infinity. Sometimes, the crystalline lens of people at old age becomes milky and cloudy. This condition is called cataract. This causes partial or complete loss of vision. It is possible to restore vision through a cataract surgery."
        },
        {
            "heading_name": "10.2 DEFECTS OF VISION AND THEIR CORRECTION",
            "raw_text": "Sometimes, the eye may gradually lose its power of accommodation. In such conditions, the person cannot see the objects distinctly and comfortably. The vision becomes blurred due to the refractive defects of the eye. There are mainly three common refractive defects of vision. These are (i) myopia or near-sightedness, (ii) Hypermetropia or far-sightedness, and (iii) Presbyopia. These defects can be corrected by the use of suitable spherical lenses. We discuss below these defects and their correction. (a) Myopia is also known as near-sightedness. A person with myopia can see nearby objects clearly but cannot see distant objects distinctly. A person with this defect has the far point nearer than infinity. Such a person may see clearly upto a distance of a few metres. In a myopic eye, the image of a distant object is formed in front of the retina [Fig. 10.2 (b)] and not at the retina itself. This defect may arise due to (i) excessive curvature of the eye lens, or (ii) elongation of the eyeball. This defect can be corrected by using a concave lens of suitable power. This is illustrated in Fig. 10.2 (c). A concave lens of suitable power will bring the image back on to the retina and thus the defect is corrected. (b) Hypermetropia is also known as far-sightedness. A person with hypermetropia can see distant objects clearly but cannot see nearby objects distinctly. The near point, for the person, is farther away from the normal near point (25 cm). Such a person has to keep a reading material much beyond 25 cm from the eye for comfortable reading. This is because the light rays from a closeby object are focussed at a point behind the retina as shown in Fig. 10.3 (b). This defect arises either because (i) the focal length of the eye lens is too long, or (ii) the eyeball has become too small. This defect can be corrected by using a convex lens of appropriate power. This is illustrated in Fig. 10.3 (c). Eye-glasses with converging lenses provide the additional focussing power required for forming the image on the retina. (c) Presbyopia The power of accommodation of the eye usually decreases with ageing. For most people, the near point gradually recedes away. They find it difficult to see nearby objects comfortably and distinctly without corrective eye-glasses. This defect is called Presbyopia. It arises due to the gradual weakening of the ciliary muscles and diminishing flexibility of the eye lens. Sometimes, a person may suffer from both myopia and hypermetropia. Such people often require bi-focal lenses. A common type of bi-focal lenses consists of both concave and convex lenses. The upper portion consists of a concave lens. It facilitates distant vision. The lower part is a convex lens. It facilitates near vision. These days, it is possible to correct the refractive defects with contact lenses or through surgical interventions."
        },
        {
            "heading_name": "10.3 REFRACTION OF LIGHT THROUGH A PRISM",
            "raw_text": "You have learnt how light gets refracted through a rectangular glass slab. For parallel refracting surfaces, as in a glass slab, the emergent ray is parallel to the incident ray. However, it is slightly displaced laterally. How would light get refracted through a transparent prism? Consider a triangular glass prism. It has two triangular bases and three rectangular lateral surfaces. These surfaces are inclined to each other. The angle between its two lateral faces is called the angle of the prism. Let us now do an activity to study the refraction of light through a triangular glass prism. Here PE is the incident ray, EF is the refracted ray and FS is the emergent ray. You may note that a ray of light is entering from air to glass at the first surface AB. The light ray on refraction has bent towards the normal. At the second surface AC, the light ray has entered from glass to air. Hence it has bent away from normal. Compare the angle of incidence and the angle of refraction at each refracting surface of the prism. Is this similar to the kind of bending that occurs in a glass slab? The peculiar shape of the prism makes the emergent ray bend at an angle to the direction of the incident ray. This angle is called the angle of deviation. In this case ∠D is the angle of deviation. Mark the angle of deviation in the above activity and measure it."
        },
        {
            "heading_name": "10.4 DISPERSION OF WHITE LIGHT BY A GLASS PRISM",
            "raw_text": "You must have seen and appreciated the spectacular colours in a rainbow. How could the white light of the Sun give us various colours of the rainbow? Before we take up this question, we shall first go back to the refraction of light through a prism. The inclined refracting surfaces of a glass prism show exciting phenomenon. Let us find it out through an activity. The prism has probably split the incident white light into a band of colours. Note the colours that appear at the two ends of the colour band. What is the sequence of colours that you see on the screen? The various colours seen are Violet, Indigo, Blue, Green, Yellow, Orange and Red, as shown in Fig. 10.5. The acronym VIBGYOR will help you to remember the sequence of colours. The band of the coloured components of a light beam is called its spectrum. You might not be able to see all the colours separately. Yet something makes each colour distinct from the other. The splitting of light into its component colours is called dispersion. You have seen that white light is dispersed into its seven-colour components by a prism. Why do we get these colours? Different colours of light bend through different angles with respect to the incident ray, as they pass through a prism. The red light bends the least while the violet the most. Thus the rays of each colour emerge along different paths and thus become distinct. It is the band of distinct colours that we see in a spectrum. Isaac Newton was the first to use a glass prism to obtain the spectrum of sunlight. He tried to split the colours of the spectrum of white light further by using another similar prism. However, he could not get any more colours. He then placed a second identical prism in an inverted position with respect to the first prism, as shown in Fig. 10.6. This allowed all the colours of the spectrum to pass through the second prism. He found a beam of white light emerging from the other side of the second prism. This observation gave Newton the idea that the sunlight is made up of seven colours. Any light that gives a spectrum similar to that of sunlight is often referred to as white light. A rainbow is a natural spectrum appearing in the sky after a rain shower (Fig. 10.7). It is caused by dispersion of sunlight by tiny water droplets, present in the atmosphere. A rainbow is always formed in a direction opposite to that of the Sun. The water droplets act like small prisms. They refract and disperse the incident sunlight, then reflect it internally, and finally refract it again when it comes out of the raindrop (Fig. 10.8). Due to the dispersion of light and internal reflection, different colours reach the observer's eye. You can also see a rainbow on a sunny day when you look at the sky through a waterfall or through a water fountain, with the Sun behind you."
        },
        {
            "heading_name": "10.5 ATMOSPHERIC REFRACTION",
            "raw_text": "You might have observed the apparent random wavering or flickering of objects seen through a turbulent stream of hot air rising above a fire or a radiator. The air just above the fire becomes hotter than the air further up. The hotter air is lighter (less dense) than the cooler air above it, and has a refractive index slightly less than that of the cooler air. Since the physical conditions of the refracting medium (air) are not stationary, the apparent position of the object, as seen through the hot air, fluctuates. This wavering is thus an effect of atmospheric refraction (refraction of light by the earth's atmosphere) on a small scale in our local environment. The twinkling of stars is a similar phenomenon on a much larger scale. Let us see how we can explain it. The twinkling of a star is due to atmospheric refraction of starlight. The starlight, on entering the earth's atmosphere, undergoes refraction continuously before it reaches the earth. The atmospheric refraction occurs in a medium of gradually changing refractive index. Since the atmosphere bends starlight towards the normal, the apparent position of the star is slightly different from its actual position. The star appears slightly higher (above) than its actual position when viewed near the horizon (Fig. 10.9). Further, this apparent position of the star is not stationary, but keeps on changing slightly, since the physical conditions of the earth's atmosphere are not stationary, as was the case in the previous paragraph. Since the stars are very distant, they approximate point-sized sources of light. As the path of rays of light coming from the star goes on varying slightly, the apparent position of the star fluctuates and the amount of starlight entering the eye flickers - the star sometimes appears brighter, and at some other time, fainter, which is the twinkling effect. Why don't the planets twinkle? The planets are much closer to the earth, and are thus seen as extended sources. If we consider a planet as a collection of a large number of point-sized sources of light, the total variation in the amount of light entering our eye from all the individual point-sized sources will average out to zero, thereby nullifying the twinkling effect. The Sun is visible to us about 2 minutes before the actual sunrise, and about 2 minutes after the actual sunset because of atmospheric refraction. By actual sunrise, we mean the actual crossing of the horizon by the Sun. Fig. 10.10 shows the actual and apparent positions of the Sun with respect to the horizon. The time difference between actual sunset and the apparent sunset is about 2 minutes. The apparent flattening of the Sun's disc at sunrise and sunset is also due to the same phenomenon."
        },
        {
            "heading_name": "10.6 SCATTERING OF LIGHT",
            "raw_text": "The interplay of light with objects around us gives rise to several spectacular phenomena in nature. The blue colour of the sky, colour of water in deep sea, the reddening of the sun at sunrise and the sunset are some of the wonderful phenomena we are familiar with. In the previous class, you have learnt about the scattering of light by colloidal particles. The path of a beam of light passing through a true solution is not visible. However, its path becomes visible through a colloidal solution where the size of the particles is relatively larger."
        },
        {
            "heading_name": "10.6.1 Tyndall Effect",
            "raw_text": "The earth's atmosphere is a heterogeneous mixture of minute particles. These particles include smoke, tiny water droplets, suspended particles of dust and molecules of air. When a beam of light strikes such fine particles, the path of the beam becomes visible. The light reaches us, after being reflected diffusely by these particles. The phenomenon of scattering of light by the colloidal particles gives rise to Tyndall effect which you have studied in Class IX. This phenomenon is seen when a fine beam of sunlight enters a smoke-filled room through a small hole. Thus, scattering of light makes the particles visible. Tyndall effect can also be observed when sunlight passes through a canopy of a dense forest. Here, tiny water droplets in the mist scatter light. The colour of the scattered light depends on the size of the scattering particles. Very fine particles scatter mainly blue light while particles of larger size scatter light of longer wavelengths. If the size of the scattering particles is large enough, then, the scattered light may even appear white."
        },
        {
            "heading_name": "10.6.2 Why is the colour of the clear Sky Blue?",
            "raw_text": "The molecules of air and other fine particles in the atmosphere have size smaller than the wavelength of visible light. These are more effective in scattering light of shorter wavelengths at the blue end than light of longer wavelengths at the red end. The red light has a wavelength about 1.8 times greater than blue light. Thus, when sunlight passes through the atmosphere, the fine particles in air scatter the blue colour (shorter wavelengths) more strongly than red. The scattered blue light enters our eyes. If the earth had no atmosphere, there would not have been any scattering. Then, the sky would have looked dark. The sky appears dark to passengers flying at very high altitudes, as scattering is not prominent at such heights. You might have observed that 'danger' signal lights are red in colour. Do you know why? The red is least scattered by fog or smoke. Therefore, it can be seen in the same color at a distance."
        }
    ]
},
    {
    "chapter_number": 11,
    "chapter_name": "Electricity",
    "content": [
        {
            "heading_name": "11.1 ELECTRIC CURRENT AND CIRCUIT",
            "raw_text": "Electricity has an important place in modern society. It is a controllable and convenient form of energy for a variety of uses in homes, schools, hospitals, industries and so on. What constitutes electricity? How does it flow in an electric circuit? What are the factors that control or regulate the current through an electric circuit? In this Chapter, we shall attempt to answer such questions. We shall also discuss the heating effect of electric current and its applications. We are familiar with air current and water current. We know that flowing water constitute water current in rivers. Similarly, if the electric charge flows through a conductor (for example, through a metallic wire), we say that there is an electric current in the conductor. In a torch, we know that the cells (or a battery, when placed in proper order) provide flow of charges or an electric current through the torch bulb to glow. We have also seen that the torch gives light only when its switch is on. What does a switch do? A switch makes a conducting link between the cell and the bulb. A continuous and closed path of an electric current is called an electric circuit. Now, if the circuit is broken anywhere (or the switch of the torch is turned off), the current stops flowing and the bulb does not glow. How do we express electric current? Electric current is expressed by the amount of charge flowing through a particular area in unit time. In other words, it is the rate of flow of electric charges. In circuits using metallic wires, electrons constitute the flow of charges. However, electrons were not known at the time when the phenomenon of electricity was first observed. So, electric current was considered to be the flow of positive charges and the direction of flow of positive charges was taken to be the direction of electric current. Conventionally, in an electric circuit the direction of electric current is taken as opposite to the direction of the flow of electrons, which are negative charges. If a net charge Q, flows across any cross-section of a conductor in time t, then the current I, through the cross-section is $$I=\\frac{Q}{t}$$ (11.1) The SI unit of electric charge is coulomb (C), which is equivalent to the charge contained in nearly $6\\times10^{18}$ electrons. (We know that an electron possesses a negative charge of $1.6\\times10^{-19}C.)$ The electric current is expressed by a unit called ampere (A), named after the French scientist, Andre-Marie Ampere (1775-1836). One ampere is constituted by the flow of one coulomb of charge per second, that is, $1~A=1~C/1$ s. Small quantities of current are expressed in milliampere $(1mA=10^{-3}A)$ or in microampere $(1~\\mu A=10^{-6}A)$. An instrument called ammeter measures electric current in a circuit. It is always connected in series in a circuit through which the current is to be measured. Figure 11.1 shows the schematic diagram of a typical electric circuit comprising a cell, an electric bulb, an ammeter and a plug key. Note that the electric current flows in the circuit from the positive terminal of the cell to the negative terminal of the cell through the bulb and ammeter. "
        },
        {
            "heading_name": "11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE",
            "raw_text": "What makes the electric charge to flow? Let us consider the analogy of flow of water. Charges do not flow in a copper wire by themselves, just as water in a perfectly horizontal tube does not flow. If one end of the tube is connected to a tank of water kept at a higher level, such that there is a pressure difference between the two ends of the tube, water flows out of the other end of the tube. For flow of charges in a conducting metallic wire, the gravity, of course, has no role to play: the electrons move only if there is a difference of electric pressure-called the potential difference - along the conductor. This difference of potential may be produced by a battery, consisting of one or more electric cells. The chemical action within a cell generates the potential difference across the terminals of the cell, even when no current is drawn from it. When the cell is connected to a conducting circuit element, the potential difference sets the charges in motion in the conductor and produces an electric current. In order to maintain the current in a given electric circuit, the cell has to expend its chemical energy stored in it. We define the electric potential difference between two points in an electric circuit carrying some current as the work done to move a unit charge from one point to the other - Potential difference (V) between two points = Work done (W)/Charge (Q) $$V=W/Q$$ (11.2) The SI unit of electric potential difference is volt (V), named after Alessandro Volta (1745-1827), an Italian physicist. One volt is the potential difference between two points in a current carrying conductor when 1 joule of work is done to move a charge of 1 coulomb from one point to the other. Therefore, 1 volt = 1 joule / 1 coulomb $$1V=1J~C^{-1}$$ (11.3) The potential difference is measured by means of an instrument called the voltmeter. The voltmeter is always connected in parallel across the points between which the potential difference is to be measured."
        },
        {
            "heading_name": "11.3 CIRCUIT DIAGRAM",
            "raw_text": "We know that an electric circuit, as shown in Fig. 11.1, comprises a cell (or a battery), a plug key, electrical component(s), and connecting wires. It is often convenient to draw a schematic diagram, in which different components of the circuit are represented by the symbols conveniently used. Conventional symbols used to represent some of the most commonly used electrical components are given in Table 11.1. "
        },
        {
            "heading_name": "11.4 OHM’S LAW",
            "raw_text": "Is there a relationship between the potential difference across a conductor and the current through it? Let us explore with an Activity. In this Activity, you will find that approximately the same value for V/I is obtained in each case. Thus the V-I graph is a straight line that passes through the origin of the graph, as shown in Fig. 11.3. Thus, V/I is a constant ratio. In 1827, a German physicist Georg Simon Ohm (1787-1854) found out the relationship between the current I, flowing in a metallic wire and the potential difference across its terminals. The potential difference, V, across the ends of a given metallic wire in an electric circuit is directly proportional to the current flowing through it, provided its temperature remains the same. This is called Ohm's law. In other words - $$V\\propto I$$ or $$V/I = constant = R$$ (11.4) or $$V=IR$$ (11.5) In Eq. (11.4), R is a constant for the given metallic wire at a given temperature and is called its resistance. It is the property of a conductor to resist the flow of charges through it. Its SI unit is ohm, represented by the Greek letter Ω. According to Ohm's law, $$R=V/I$$ (11.6) If the potential difference across the two ends of a conductor is 1 V and the current through it is 1 A, then the resistance R, of the conductor is 1 Ω. That is, 1 ohm = 1 volt / 1 ampere Also from Eq. (11.5) we get $$I=V/R$$ (11.7) It is obvious from Eq. (11.7) that the current through a resistor is inversely proportional to its resistance. If the resistance is doubled the current gets halved. In many practical cases it is necessary to increase or decrease the current in an electric circuit. A component used to regulate current without changing the voltage source is called variable resistance. In an electric circuit, a device called rheostat is often used to change the resistance in the circuit. We will now study about electrical resistance of a conductor with the help of following Activity. In this Activity we observe that the current is different for different components. Why do they differ? Certain components offer an easy path for the flow of electric current while the others resist the flow. We know that motion of electrons in an electric circuit constitutes an electric current. The electrons, however, are not completely free to move within a conductor. They are restrained by the attraction of the atoms among which they move. Thus, motion of electrons through a conductor is retarded by its resistance. A component of a given size that offers a low resistance is a good conductor. A conductor having some appreciable resistance is called a resistor. A component of identical size that offers a higher resistance is a poor conductor. An insulator of the same size offers even higher resistance."
        },
        {
            "heading_name": "11.5 FACTORS ON WHICH THE RESISTANCE OF A CONDUCTOR DEPENDS",
            "raw_text": "It is observed that the ammeter reading decreases to one-half when the length of the wire is doubled. The ammeter reading is increased when a thicker wire of the same material and of the same length is used in the circuit. A change in ammeter reading is observed when a wire of different material of the same length and the same area of cross-section is used. On applying Ohm's law [Eqs. (11.5) (11.7)], we observe that the resistance of the conductor depends (i) on its length, (ii) on its area of cross-section, and (iii) on the nature of its material. Precise measurements have shown that resistance of a uniform metallic conductor is directly proportional to its length (l) and inversely proportional to the area of cross-section (A). That is, $$R\\propto l$$ (11.8) and $$R\\propto1/A$$ (11.9) Combining Eqs. (11.8) and (11.9) we get $$R\\propto\\frac{l}{A}$$ or, $$R=\\rho\\frac{l}{A}$$ (11.10) where ρ (rho) is a constant of proportionality and is called the electrical resistivity of the material of the conductor. The SI unit of resistivity is Ω m. It is a characteristic property of the material. The metals and alloys have very low resistivity in the range of $10^{-8}$ Ωm to $10^{-6}$ Ωm. They are good conductors of electricity. Insulators like rubber and glass have resistivity of the order of $10^{12}$ to $10^{17}$ Ω m. Both the resistance and resistivity of a material vary with temperature. Table 11.2 reveals that the resistivity of an alloy is generally higher than that of its constituent metals. Alloys do not oxidise (burn) readily at high temperatures. For this reason, they are commonly used in electrical heating devices, like electric iron, toasters etc. Tungsten is used almost exclusively for filaments of electric bulbs, whereas copper and aluminium are generally used for electrical transmission lines. You need not memorise these values. You can use these values for solving numerical problems."
        },
        {
            "heading_name": "11.6 RESISTANCE OF A SYSTEM OF RESISTORS",
            "raw_text": "In preceding sections, we learnt about some simple electric circuits. We have noticed how the current through a conductor depends upon its resistance and the potential difference across its ends. In various electrical gadgets, we often use resistors in various combinations. We now therefore intend to see how Ohm's law can be applied to combinations of resistors. There are two methods of joining the resistors together. Figure 11.6 shows an electric circuit in which three resistors having resistances $R_1$ $R_2$ and $R_3$ respectively, are joined end to end. Here the resistors are said to be connected in series. Figure 11.7 shows a combination of resistors in which three resistors are connected together between points X and Y. Here, the resistors are said to be connected in parallel."
        },
        {
            "heading_name": "11.6.1 Resistors in Series",
            "raw_text": "You will observe that the value of the current in the ammeter is the same, independent of its position in the electric circuit. It means that in a series combination of resistors the current is the same in every part of the circuit or the same current through each resistor. You will observe that the potential difference V is equal to the sum of potential differences $V_1$, $V_2$, and $V_3$. That is the total potential difference across a combination of resistors in series is equal to the sum of potential difference across the individual resistors. That is, $$V=V_1+V_2+V_3$$ (11.11) In the electric circuit shown in Fig. 11.8, let I be the current through the circuit. The current through each resistor is also I. It is possible to replace the three resistors joined in series by an equivalent single resistor of resistance R, such that the potential difference V across it, and the current I through the circuit remains the same. Applying the Ohm's law to the entire circuit, we have $$V=I~R$$ (11.12) On applying Ohm's law to the three resistors separately, we further have $$V_1=IR_1$$ [11.13(a)] $$V_2=IR_2$$ [11.13(b)] and $$V_3=IR_3$$ [11.13(c)] From Eq. (11.11), $$IR=I~R_1+I~R_2+I~R_3$$ or $$R_s=R_1+R_2+R_3$$ (11.14) We can conclude that when several resistors are joined in series, the resistance of the combination $R_s$ equals the sum of their individual resistances, $R_1$ $R_2$ $R_3$ and is thus greater than any individual resistance."
        },
        {
            "heading_name": "11.6.2 Resistors in Parallel",
            "raw_text": "Now, let us consider the arrangement of three resistors joined in parallel with a combination of cells (or a battery), as shown in Fig. 11.7. It is observed that the total current I, is equal to the sum of the separate currents through each branch of the combination. $$I=I_1+I_2+I_3$$ (11.15) On applying Ohm's law to each resistor, we have $I_1=V/R_1$, $I_2=V/R_2$; and $I_3=V/R_3$ (11.16) Let $R_p$ be the equivalent resistance of the parallel combination of resistors. By applying Ohm's law to the parallel combination of resistors, we have $$I=V/R_p$$ (11.17) From Eqs. (11.15) to (11.17), we have $$V/R_p=V/R_1+V/R_2+V/R_3$$ or $$1/R_p=1/R_1+1/R_2+1/R_3$$ (11.18) Thus, we may conclude that the reciprocal of the equivalent resistance of a group of resistances joined in parallel is equal to the sum of the reciprocals of the individual resistances."
        },
        {
            "heading_name": "11.7 HEATING EFFECT OF ELECTRIC CURRENT",
            "raw_text": "We know that a battery or a cell is a source of electrical energy. The chemical reaction within the cell generates the potential difference between its two terminals that sets the electrons in motion to flow the current through a resistor or a system of resistors connected to the battery. We have also seen, in Section 11.2, that to maintain the current, the source has to keep expending its energy. Where does this energy go? A part of the source energy in maintaining the current may be consumed into useful work (like in rotating the blades of an electric fan). Rest of the source energy may be expended in heat to raise the temperature of gadget. We often observe this in our everyday life. For example, an electric fan becomes warm if used continuously for longer time etc. On the other hand, if the electric circuit is purely resistive, that is, a configuration of resistors only connected to a battery; the source energy continually gets dissipated entirely in the form of heat. This is known as the heating effect of electric current. This effect is utilised in devices such as electric heater, electric iron etc. Consider a current I flowing through a resistor of resistance R. Let the potential difference across it be V (Fig. 11.13). Let t be the time during which a charge Q flows across. The work done in moving the charge Q through a potential difference V is VQ. Therefore, the source must supply energy equal to VQ in time t. Hence the power input to the circuit by the source is $$P=V\\frac{Q}{t}=VI$$ (11.19) Or the energy supplied to the circuit by the source in time t is $P\\times t$. that is, VIt. What happens to this energy expended by the source? This energy gets dissipated in the resistor as heat. Thus for a steady current I, the amount of heat H produced in time t is $$H=VIt$$ (11.20) Applying Ohm's law [Eq. (11.5)], we get $$H=I^2Rt$$ (11.21) This is known as Joule's law of heating. The law implies that heat produced in a resistor is (i) directly proportional to the square of current for a given resistance, (ii) directly proportional to resistance for a given current, and (iii) directly proportional to the time for which the current flows through the resistor. In practical situations, when an electric appliance is connected to a known voltage source, Eq. (11.21) is used after calculating the current through it, using the relation $I=V/R$."
        },
        {
            "heading_name": "11.7.1 Practical Applications of Heating Effect of Electric Current",
            "raw_text": "The generation of heat in a conductor is an inevitable consequence of electric current. In many cases, it is undesirable as it converts useful electrical energy into heat. In electric circuits, the unavoidable heating can increase the temperature of the components and alter their properties. However, heating effect of electric current has many useful applications. The electric laundry iron, electric toaster, electric oven, electric kettle and electric heater are some of the familiar devices based on Joule's heating. The electric heating is also used to produce light, as in an electric bulb. Here, the filament must retain as much of the heat generated as is possible, so that it gets very hot and emits light. It must not melt at such high temperature. A strong metal with high melting point such as tungsten (melting point $3380^{\\circ}C)$ is used for making bulb filaments. The filament should be thermally isolated as much as possible, using insulating support, etc. The bulbs are usually filled with chemically inactive nitrogen and argon gases to prolong the life of filament. Most of the power consumed by the filament appears as heat, but a small part of it is in the form of light radiated. Another common application of Joule's heating is the fuse used in electric circuits. It protects circuits and appliances by stopping the flow of any unduly high electric current. The fuse is placed in series with the device. It consists of a piece of wire made of a metal or an alloy of appropriate melting point, for example aluminium, copper, iron, lead etc. If a current larger than the specified value flows through the circuit, the temperature of the fuse wire increases. This melts the fuse wire and breaks the circuit. The fuse wire is usually encased in a cartridge of porcelain or similar material with metal ends. The fuses used for domestic purposes are rated as 1 A, 2A, 3A, 5 A, 10 A, etc. For an electric iron which consumes 1 kW electric power when operated at 220 V, a current of $(1000/220)$ A, that is, 4.54 A will flow in the circuit. In this case, a 5 A fuse must be used."
        },
        {
            "heading_name": "11.8 ELECTRIC POWER",
            "raw_text": "You have studied in your earlier Class that the rate of doing work is power. This is also the rate of consumption of energy. Equation (11.21) gives the rate at which electric energy is dissipated or consumed in an electric circuit. This is also termed as electric power. The power P is given by $$P=VI$$ Or $$P=I^2R=V^2/R$$ (11.22) The SI unit of electric power is watt (W). It is the power consumed by a device that carries 1 A of current when operated at a potential difference of 1 V. Thus, $$1~W=1~volt\\times1~ampere=1~VA$$ (11.23) The unit 'watt' is very small. Therefore, in actual practice we use a much larger unit called 'kilowatt'. It is equal to 1000 watts. Since electrical energy is the product of power and time, the unit of electric energy is, therefore, watt hour (Wh). One watt hour is the energy consumed when 1 watt of power is used for 1 hour. The commercial unit of electric energy is kilowatt hour (kWh), commonly known as 'unit'. 1 kWh $=1000~watt\\times3600$ second $=3.6\\times10^{6}$ watt second $=3.6\\times10^{6}$ joule (J) Many people think that electrons are consumed in an electric circuit. This is wrong! We pay the electricity board or electric company to provide energy to move electrons through the electric gadgets like electric bulb, fan and engines. We pay for the energy that we use."
        }
    ]
},
    {
    "chapter_number": 12,
    "chapter_name": "Magnetic Effects of Electric Current",
    "content": [
        {
            "heading_name": "12.1 MAGNETIC FIELD AND FIELD LINES",
            "raw_text": "In the previous Chapter on 'Electricity' we learnt about the heating effects of electric current. What could be the other effects of electric current? We know that an electric current-carrying wire behaves like a magnet. Let us perform the following Activity to reinforce it. We see that the needle is deflected. What does it mean? It means that the electric current through the copper wire has produced a magnetic effect. Thus we can say that electricity and magnetism are linked to each other. Then, what about the reverse possibility of an electric effect of moving magnets? In this Chapter we will study magnetic fields and such electromagnetic effects. We shall also study about electromagnets which involve the magnetic effect of electric current. Hans Christian Oersted, one of the leading scientists of the 19th century, played a crucial role in understanding electromagnetism. In 1820 he accidentally discovered that a compass needle got deflected when an electric current passed through a metallic wire placed nearby. Through this observation Oersted showed that electricity and magnetism were related phenomena. His research later created technologies such as the radio, television and fiber optics. The unit of magnetic field strength is named the oersted in his honor. We are familiar with the fact that a compass needle gets deflected when brought near a bar magnet. A compass needle is, in fact, a small bar magnet. The ends of the compass needle point approximately towards north and south directions. The end pointing towards north is called north seeking or north pole. The other end that points towards south is called south seeking or south pole. Through various activities we have observed that like poles repel, while unlike poles of magnets attract each other. The iron filings arrange themselves in a pattern as shown Fig. 12.2. Why do the iron filings arrange in such a pattern? What does this pattern demonstrate? The magnet exerts its influence in the region surrounding it. Therefore the iron filings experience a force. The force thus exerted makes iron filings to arrange in a pattern. The region surrounding a magnet, in which the force of the magnet can be detected, is said to have a magnetic field. The lines along which the iron filings align themselves represent magnetic field lines. Are there other ways of obtaining magnetic field lines around a bar magnet? Yes, you can yourself draw the field lines of a bar magnet. Magnetic field is a quantity that has both direction and magnitude. The direction of the magnetic field is taken to be the direction in which a north pole of the compass needle moves inside it. Therefore it is taken by convention that the field lines emerge from north pole and merge at the south pole (note the arrows marked on the field lines in Fig. 12.4). Inside the magnet, the direction of field lines is from its south pole to its north pole. Thus the magnetic field lines are closed curves. The relative strength of the magnetic field is shown by the degree of closeness of the field lines. The field is stronger, that is, the force acting on the pole of another magnet placed is greater where the field lines are crowded (see Fig. 12.4). No two field-lines are found to cross each other. If they did, it would mean that at the point of intersection, the compass needle would point towards two directions, which is not possible."
        },
        {
            "heading_name": "12.2 MAGNETIC FIELD DUE TO A CURRENT-CARRYING CONDUCTOR",
            "raw_text": "In Activity 12.1, we have seen that an electric current through a metallic conductor produces a magnetic field around it. In order to find the direction of the field produced let us repeat the activity in the following way. You will see that now the needle moves in opposite direction, that is, towards the west [Fig. 12.5 (b)]. It means that the direction of magnetic field produced by the electric current is also reversed. "
        },
        {
            "heading_name": "12.2.1 Magnetic Field due to a Current through a Straight Conductor",
            "raw_text": "What determines the pattern of the magnetic field generated by a current through a conductor? Does the pattern depend on the shape of the conductor? We shall investigate this with an activity. We shall first consider the pattern of the magnetic field around a straight conductor carrying current. What happens to the deflection of the compass needle placed at a given point if the current in the copper wire is changed? To see this, vary the current in the wire. We find that the deflection in the needle also changes. In fact, if the current is increased, the deflection also increases. It indicates that the magnitude of the magnetic field produced at a given point increases as the current through the wire increases. What happens to the deflection of the needle if the compass is moved away from the copper wire but the current through the wire remains the same? To see this, now place the compass at a farther point from the conducting wire (say at point Q). What change do you observe? We see that the deflection in the needle decreases. Thus the magnetic field produced by a given current in the conductor decreases as the distance from it increases. From Fig. 12.6, it can be noticed that the concentric circles representing the magnetic field around a current-carrying straight wire become larger and larger as we move away from it."
        },
        {
            "heading_name": "12.2.2 Right-Hand Thumb Rule",
            "raw_text": "A convenient way of finding the direction of magnetic field associated with a current-carrying conductor is given in Fig. 12.7. Imagine that you are holding a current-carrying straight conductor in your right hand such that the thumb points towards the direction of current. Then your fingers will wrap around the conductor in the direction of the field lines of the magnetic field, as shown in Fig. 12.7. This is known as the right-hand thumb rule*. "
        },
        {
            "heading_name": "12.2.3 Magnetic Field due to a Current through a Circular Loop",
            "raw_text": "We have so far observed the pattern of the magnetic field lines produced around a current-carrying straight wire. Suppose this straight wire is bent in the form of a circular loop and a current is passed through it. How would the magnetic field lines look like? We know that the magnetic field produced by a current-carrying straight wire depends inversely on the distance from it. Similarly at every point of a current-carrying circular loop, the concentric circles representing the magnetic field around it would become larger and larger as we move away from the wire (Fig. 12.8). By the time we reach at the centre of the circular loop, the arcs of these big circles would appear as straight lines. Every point on the wire carrying current would give rise to the magnetic field appearing as straight lines at the center of the loop. By applying the right hand rule, it is easy to check that every section of the wire contributes to the magnetic field lines in the same direction within the loop."
        },
        {
            "heading_name": "12.2.4 Magnetic Field due to a Current in a Solenoid",
            "raw_text": "A coil of many circular turns of insulated copper wire wrapped closely in the shape of a cylinder is called a solenoid. The pattern of the magnetic field lines around a current-carrying solenoid is shown in Fig. 12.10. Compare the pattern of the field with the magnetic field around a bar magnet (Fig. 12.4). Do they look similar? Yes, they are similar. In fact, one end of the solenoid behaves as a magnetic north pole, while the other behaves as the south pole. The field lines inside the solenoid are in the form of parallel straight lines. This indicates that the magnetic field is the same at all points inside the solenoid. That is, the field is uniform inside the solenoid. A strong magnetic field produced inside a solenoid can be used to magnetise a piece of magnetic material, like soft iron, when placed inside the coil (Fig. 12.11). The magnet so formed is called an electromagnet."
        },
        {
            "heading_name": "12.3 FORCE ON A CURRENT-CARRYING CONDUCTOR IN A MAGNETIC FIELD",
            "raw_text": "We have learnt that an electric current flowing through a conductor produces a magnetic field. The field so produced exerts a force on a magnet placed in the vicinity of the conductor. French scientist Andre Marie Ampere (1775-1836) suggested that the magnet must also exert an equal and opposite force on the current-carrying conductor. The force due to a magnetic field acting on a current-carrying conductor can be demonstrated through the following activity. The displacement of the rod in the above activity suggests that a force is exerted on the current-carrying aluminium rod when it is placed in a magnetic field. It also suggests that the direction of force is also reversed when the direction of current through the conductor is reversed. Now change the direction of field to vertically downwards by interchanging the two poles of the magnet. It is once again observed that the direction of force acting on the current-carrying rod gets reversed. It shows that the direction of the force on the conductor depends upon the direction of current and the direction of the magnetic field. Experiments have shown that the displacement of the rod is largest (or the magnitude of the force is the highest) when the direction of current is at right angles to the direction of the magnetic field. In such a condition we can use a simple rule to find the direction of the force on the conductor. In Activity 12.7, we considered the direction of the current and that of the magnetic field perpendicular to each other and found that the force is perpendicular to both of them. The three directions can be illustrated through a simple rule, called Fleming's left-hand rule. According to this rule, stretch the thumb, forefinger and middle finger of your left hand such that they are mutually perpendicular (Fig. 12.13). If the first finger points in the direction of magnetic field and the second finger in the direction of current, then the thumb will point in the direction of motion or the force acting on the conductor. Devices that use current-carrying conductors and magnetic fields include electric motor, electric generator, loudspeakers, microphones and measuring instruments. "
        },
        {
            "heading_name": "12.4 DOMESTIC ELECTRIC CIRCUITS",
            "raw_text": "In our homes, we receive supply of electric power through a main supply (also called mains), either supported through overhead electric poles or by underground cables. One of the wires in this supply, usually with red insulation cover, is called live wire (or positive). Another wire, with black insulation, is called neutral wire (or negative). In our country, the potential difference between the two is 220 V. At the meter-board in the house, these wires pass into an electricity meter through a main fuse. Through the main switch they are connected to the line wires in the house. These wires supply electricity to separate circuits within the house. Often, two separate circuits are used, one of 15 A current rating for appliances with higher power ratings such as geysers, air coolers, etc. The other circuit is of 5 A current rating for bulbs, fans, etc. The earth wire, which has insulation of green colour, is usually connected to a metal plate deep in the earth near the house. This is used as a safety measure, especially for those appliances that have a metallic body, for example, electric press, toaster, table fan, refrigerator, etc. The metallic body is connected to the earth wire, which provides a low-resistance conducting path for the current. Thus, it ensures that any leakage of current to the metallic body of the appliance keeps its potential to that of the earth, and the user may not get a severe electric shock. Figure 12.15 gives a schematic diagram of one of the common domestic circuits. In each separate circuit, different appliances can be connected across the live and neutral wires. Each appliance has a separate switch to 'ON'/'OFF' the flow of current through it. In order that each appliance has equal potential difference, they are connected parallel to each other. Electric fuse is an important component of all domestic circuits. We have already studied the principle and working of a fuse in the previous chapter (see Section 11.7). A fuse in a circuit prevents damage to the appliances and the circuit due to overloading. Overloading can occur when the live wire and the neutral wire come into direct contact. (This occurs when the insulation of wires is damaged or there is a fault in the appliance.) In such a situation, the current in the circuit abruptly increases. This is called short-circuiting. The use of an electric fuse prevents the electric circuit and the appliance from a possible damage by stopping the flow of unduly high electric current. The Joule heating that takes place in the fuse melts it to break the electric circuit. Overloading can also occur due to an accidental hike in the supply voltage. Sometimes overloading is caused by connecting too many appliances to a single socket."
        }
    ]
},
    {
    "chapter_number": 13,
    "chapter_name": "Our Environment",
    "content": [
        {
            "heading_name": "13.1 ECO-SYSTEM - WHAT ARE ITS COMPONENTS?",
            "raw_text": "We have heard the word 'environment' often being used on the television, in newspapers and by people around us. Our elders tell us that the 'environment' is not what it used to be earlier; others say that we should work in a healthy 'environment'; and global summits involving the developed and developing countries are regularly held to discuss 'environmental issues. In this chapter, we shall be studying how various components in the environment interact with each other and how we impact the environment. All organisms such as plants, animals, microorganisms and human beings as well as the physical surroundings interact with each other and maintain a balance in nature. All the interacting organisms in an area together with the non-living constituents of the environment form an ecosystem. Thus, an ecosystem consists of biotic components comprising living organisms and abiotic components comprising physical factors like temperature, rainfall, wind, soil and minerals. For example, if you visit a garden you will find different plants, such as grasses, trees; flower bearing plants like rose, jasmine, sunflower; and animals like frogs, insects and birds. All these living organisms interact with each other and their growth, reproduction and other activities are affected by the abiotic components of ecosystem. So a garden is an ecosystem. Other types of ecosystems are forests, ponds and lakes. These are natural ecosystems while gardens and crop-fields are human-made (artificial) ecosystems. We have seen in earlier classes that organisms can be grouped as producers, consumers and decomposers according to the manner in which they obtain their sustenance from the environment. Let us recall what we have learnt through the self sustaining ecosystem created by us above. Which organisms can make organic compounds like sugar and starch from inorganic substances using the radiant energy of the Sun in the presence of chlorophyll? All green plants and certain bacteria which can produce food by photosynthesis come under this category and are called the producers. Organisms depend on the producers either directly or indirectly for their sustenance? These organisms which consume the food produced, either directly from producers or indirectly by feeding on other consumers are the consumers. Consumers can be classed variously as herbivores, carnivores, omnivores and parasites. Can you give examples for each of these categories of consumers? Imagine the situation where you do not clean the aquarium and some fish and plants have died. Have you ever thought what happens when an organism dies? The microorganisms, comprising bacteria and fungi, break-down the dead remains and waste products of organisms. These microorganisms are the decomposers as they break-down the complex organic substances into simple inorganic substances that go into the soil and are used up once more by the plants. What will happen to the garbage, and dead animals and plants in their absence? Will the natural replenishment of the soil take place, even if decomposers are not there?"
        },
        {
            "heading_name": "13.1.1 Food Chains and Webs",
            "raw_text": "In Activity 13.4 we have formed a series of organisms feeding on one another. This series or organisms taking part at various biotic levels form a food chain (Fig. 13.1). Each step or level of the food chain forms a trophic level. The autotrophs or the producers are at the first trophic level. They fix up the solar energy and make it available for heterotrophs or the consumers. The herbivores or the primary consumers come at the second, small carnivores or the secondary consumers at the third and larger carnivores or the tertiary consumers form the fourth trophic level (Fig. 13.2). We know that the food we eat acts as a fuel to provide us energy to do work. Thus the interactions among various components of the environment involves flow of energy from one component of the system to another. As we have studied, the autotrophs capture the energy present in sunlight and convert it into chemical energy. This energy supports all the activities of the living world. From autotrophs, the energy goes to the heterotrophs and decomposers. However, as we saw in the previous Chapter on 'Sources of Energy', when one form of energy is changed to another, some energy is lost to the environment in forms which cannot be used again. The flow of energy between various components of the environment has been extensively studied and it has been found that - The green plants in a terrestrial ecosystem capture about 1% of the energy of sunlight that falls on their leaves and convert it into food energy. When green plants are eaten by primary consumers, a great deal of energy is lost as heat to the environment, some amount goes into digestion and in doing work and the rest goes towards growth and reproduction. An average of 10% of the food eaten is turned into its own body and made available for the next level of consumers. Therefore, 10% can be taken as the average value for the amount of organic matter that is present at each step and reaches the next level of consumers. Since so little energy is available for the next level of consumers, food chains generally consist of only three or four steps. The loss of energy at each step is so great that very little usable energy remains after four trophic levels. There are generally a greater number of individuals at the lower trophic levels of an ecosystem, the greatest number is of the producers. The length and complexity of food chains vary greatly. Each organism is generally eaten by two or more other kinds of organisms which in turn are eaten by several other organisms. So instead of a straight line food chain, the relationship can be shown as a series of branching lines called a food web (Fig. 13.3). From the energy flow diagram (Fig. 13.4), two things become clear. Firstly, the flow of energy is unidirectional. The energy that is captured by the autotrophs does not revert back to the solar input and the energy which passes to the herbivores does not come back to autotrophs. As it moves progressively through the various trophic levels it is no longer available to the previous level. Secondly, the energy available at each trophic level gets diminished progressively due to loss of energy at each level. Another interesting aspect of food chain is how unknowingly some harmful chemicals enter our bodies through the food chain. You have read in Class IX how water gets polluted. One of the reasons is the use of several pesticides and other chemicals to protect our crops from diseases and pests. These chemicals are either washed down into the soil or into the water bodies. From the soil, these are absorbed by the plants along with water and minerals, and from the water bodies these are taken up by aquatic plants and animals. This is one of the ways in which they enter the food chain. As these chemicals are not degradable, these get accumulated progressively at each trophic level. As human beings occupy the top level in any food chain, the maximum concentration of these chemicals get accumulated in our bodies. This phenomenon is known as biological magnification. This is the reason why our food grains such as wheat and rice, vegetables and fruits, and even meat, contain varying amounts of pesticide residues. They cannot always be removed by washing or other means."
        },
        {
            "heading_name": "13.2 HOW DO OUR ACTIVITIES AFFECT THE ENVIRONMENT?",
            "raw_text": "We are an integral part of the environment. Changes in the environment affect us and our activities change the environment around us. We have already seen in Class IX how our activities pollute the environment. In we shall be looking at two of the environmental problems is, depletion of the ozone layer and waste disposal."
        },
        {
            "heading_name": "13.2.1 Ozone Layer and How it is Getting Depleted",
            "raw_text": "Ozone $(O_3)$ is a molecule formed by three atoms of oxygen. While $O_2$ which we normally refer to as oxygen, is essential for all aerobic forms of life. Ozone, is a deadly poison. However, at the higher levels of the atmosphere, ozone performs an essential function. It shields the surface of the earth from ultraviolet (UV) radiation from the Sun. This radiation is highly damaging to organisms, for example, it is known to cause skin cancer in human beings. Ozone at the higher levels of the atmosphere is a product of UV radiation acting on oxygen $(O_2)$ molecule. The higher energy UV radiations split apart some moleculer oxygen $(O_2)$ into free oxygen (O) atoms. These atoms then combine with the molecular oxygen to form ozone as shown- UV $O_2\\rightarrow O+O$; $O+O_2\\rightarrow O_3$ (Ozone) The amount of ozone in the atmosphere began to drop sharply in the 1980s. This decrease has been linked to synthetic chemicals like chlorofluorocarbons (CFCs) which are used as refrigerants and in fire extinguishers. In 1987, the United Nations Environment Programme (UNEP) succeeded in forging an agreement to freeze CFC production at 1986 levels. It is now mandatory for all the manufacturing companies to make CFC-free refrigerators throughout the world."
        },
        {
            "heading_name": "13.2.2 Managing the Garbage we Produce",
            "raw_text": "In our daily activities, we generate a lot of material that are thrown away. What are some of these waste materials? What happens after we throw them away? Let us perform an activity to find answers to these questions. We have seen in the chapter on 'Life Processes' that the food we eat is digested by various enzymes in our body. Have you ever wondered why the same enzyme does not break-down everything we eat? Enzymes are specific in their action, specific enzymes are needed for the break-down of a particular substance. That is why we will not get any energy if we try to eat coal! Because of this, many human-made materials like plastics will not be broken down by the action of bacteria or other saprophytes. These materials will be acted upon by physical processes like heat and pressure, but under the ambient conditions found in our environment, these persist for a long time. Substances that are broken down by biological processes are said to be biodegradable. How many of the substances you buried were biodegradable? Substances that are not broken down in this manner are said to be non-biodegradable. These substances may be inert and simply persist in the environment for a long time or may harm members of the eco-system. Visit any town or city, and we are sure to find heaps of garbage all over the place. Visit any place of tourist interest and we are sure to find the place littered with empty food wrappers. In the earlier classes we have talked about this problem of dealing with the garbage that we generate. Let us now look at the problem a bit more deeply. Improvements in our life-style have resulted in greater amounts of waste material generation. Changes in attitude also have a role to play, with more and more things we use becoming disposable. Changes in packaging have resulted in much of our waste becoming non-biodegradable. What do you think will be the impact of these on our environment?"
        }
    ]
}
]